[[{"title":"HS01 哲学","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"網谷　祐一","update":"2019/02/05","outline":"講義の概要：哲学者は古来、この世界や人間に関わる根本的な問題について議論をしてきた。この科目の目的は、そうした問題の中から有名で重要な問題を取り出して受講者と一緒に考えていくことである。これにより哲学で歴史的にどのようなことが問題になってきたかを知ると同時に、こうした問題に正面から向き合うことで、受講者は込み入った問題をきちんと把握しそれについて筋道たてて議論をする力（哲学的に議論する力）が養われる。","gradingMethod":"平常点（授業内クイズ含む、15%）、定期試験（50%）、エッセイ課題（35%）、レスポンスシート（＋α）。","reference":"-スティーブン・ロー、中山元訳、『考える力をつける哲学問題集』、ちくま学芸文庫、2013年-ジェームス・レイチェルズ、古牧徳生・次田憲和訳、『哲学のアポリア』、晃洋書房、2015年-久木田水生・神崎宣次・佐々木拓、『ロボットからの倫理学入門』、名古屋大学出版会、2017年-トマス・ネーゲル、岡本裕一朗・若松良樹訳、『哲学ってどんなこと？』、昭和堂、1993年-ジュリアン・パジーニ、向井和美訳、『100の思考実験』、紀伊國屋書店、2012年"},{"title":"HS03 心理学","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"蛯名　正司","update":"2019/02/16","outline":"心理学は人の行動や心に関する法則を明らかにする実証的な経験科学として発展してきた。人はあたりまえのように行動したり，考えたり，感じたりしている。心理学はどのようにそこから法則を見つけてきたのだろうか。心理学の研究手法も紹介しながら，認知・社会・パーソナリティに関する研究成果を中心に，人の行動や心にどのような法則があるのかを概説する。","gradingMethod":"討論への参加20%試験80%","reference":"授業内で紹介する。"},{"title":"HS04 言語学","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"島田　純理","update":"2019/03/04","outline":"私たちが日常生活で特に意識することなく使っている自然言語は、意味を音の連なりに暗号化する大変複雑なシステムです。この授業は、自然言語を経験的自然現象と捉えて研究する、言語の科学への入門です。授業では、単に講義を聴くだけでなく多くの演習問題に取り組むことで基本的な知識と考え方を身につけて欲しいと思います。Natural language, which we use to communicate in everyday life, is a complex system that encodes meanings in sequences of sounds. This course is an introduction to the science of natural language, i.e. the study of natural language as an empirical, natural phenomenon. In this course, students are expected to not only listen to the lecture but also try and solve numerous exercises to learn basic knowledge of linguistics and how to do linguistics.","gradingMethod":"持ち帰り課題(70%)と授業参加(30%)による。By a take-home exam (70%) and class participation (30%).","reference":"Akmajian et al. Linguistics: An Introduction to Language and Communication, 7th edition. MIT Press.O'Grady et al. Contemporary Linguistics: An Introduction, 7th edition. Bedford/St. Martin’s."},{"title":"HS05 文学","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"澁澤　尚","update":"2019/03/04","outline":"黄河と長江という二大河を中心に育まれた中華文明には、それに相応しい悠久の歴史、思想があり、膨大な文学、文化があります。それらは、いずれの時代をいかように切り取っても、圧倒的な輝き・深さをもって我々に迫ってきます。それは、日本語を含む日本文化の源流、東洋文化の源流です。　漢字・漢文学は、「八宗兼学でなければ一分科をも修め得ない」（すべてのジャンルに習熟していなければひとつも習得できない）といわれ、中学高等学校時代のイメージとは相違し、実学虚学の文理全分野がその対象となる深遠無辺な学問です。例えば、本来の漢文学のなかには医薬学や動植物学、天文学や物理学といった理系分野さえも含まれるのです。李白や杜甫、『論語』や『三国志』は、漢文学のほんの一部分なのです。　もちろん短期間の講義の中では、理系分野の漢文学に触れる機会はありませんが、諸文化の源流といえる「巫祝」と呼ばれるシャーマン（古代の呪術者）への理解と、それを伝えてきた媒体である「漢字」、そしてそれが思想や文学として花開いた「故事成語」や「漢詩」の世界について具体例を挙げながら学びたいと思います。","gradingMethod":"小レポート45％（15％×3回）、試験55％","reference":"東洋文字文化研究所編『白川静を読むときの辞典』（平凡社、1,800円）"},{"title":"HS06 芸術学","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"マイケル　コーエン","update":"2019/08/09","outline":"このコースは、広範囲なデジタルコンピューターアートクラスです。従来のアナログメディア同様デジタルアート（コンピュータを使って芸術作品を作る）の制作、2D＆ 3D、静的＆動的、電子的とフィジカルそしてマルチメディアをも含みます。","gradingMethod":"コースの内容は、デジタルコンテンツ作成ツールの創造的な応用を使用し、沢山の発見やデザインと発明を促し、またラボ演習も含みます。必要な技術が身に付いているかを毎週『チェックポイント』課題で、発見やデザインの確認をします。シナリオ製作と絵コンテ製作、絵描きと色塗り、カラーモデルと仕様、デジタル合成（レイヤー・オーバレイ・テクスチャマッピング）、立体視（3D図面を含むオートステレオグラム・ランダムドットステレオグラム・アナグリフ・クロマステレオスコープ）、SFXを用いた音声編集、TTSによる音声との対話、BGM用のデスクトップ音楽の合成を通じて、仮想世界とストーリーを徐々に製作していきます。クリエイティブスタジオでの課題と時折のクイズ、試験があります。クロマステレオスコピックアートコンテストを開催し、優秀な作品は大学図書館に展示されます。また、動画、ゲームなどの独創的な作品を製作します。学生によって構成されたモンタージュは、レビューセッション授業で発表されます。演習、クイズ: 35%、試験: 25%、個別プロジェクト: 20%、最終プロジェクト: 20%","reference":"Related web pages:course home page: http://web-int.u-aizu.ac.jp/%7Emcohen/welcome/courses/AizuDai/undergraduate/HS06%20Art/Photo Booth photo capture: https://support.apple.com/ja-jp/guide/photo-booth/welcome/macPhotos photo manipulation: https://www.apple.com/jp/macos/photos/Apple iMovie video editor: https://www.apple.com/jp/imovie/Tiertime Up Box 3D printer: https://www.tiertime.com/OS X \"say\" TTS (text-to-speech) utility: http://developer.apple.com/library/mac/#documentation/Darwin/Reference/ManPages/man1/say.1.htmlAudacity audio editor: http://audacity.sourceforge.net/?lang=jaPhotopea image editor: https://www.photopea.com/GarageBand DTM (desk-top music) composition application: http://www.apple.com/jp/mac/garageband/Chromastereoptic stereo system: http://www.chromatek.comBlender: https://www.blender.org (https://blender.jp)Experience statementThe instructor has broad if shallow experience in computer arts, having led the Computer Arts Lab. at the U. of Aizu for 14 years,including serving as faculty advisor to the \"M-Project\" Digital Arts circle and the \"A-PxL\" (Aizu Progressive xr Lab) VR circle.He has academic experience with photographic editing, stereography, audio editing, digital typography, computer music, videography, 2D design, and 3D modeling.He has presented at such conferences asACMP: the Asia Computer Music Project,CSTM: the Canadian Society for Traditional Music,andISEA, the Int. Symp. on Electronic Arts,and in such journals asthe Computer Music Journal,Ethnologies,TUGboat: Communications of the TeX Users Group,andVisible Language.As an undergraduate, he studied photography at art school for 3 semesters.He has a registered design patent.授業形態：講義"},{"title":"HS07 ジェンダー・セクシュアリティ論","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"前川　直哉","update":"2019/08/09","outline":"ジ ェ ン ダ ー ・ セ ク シ ュ ア リ テ ィ 研 究 と は 一 言 で 言 う と 、「 性 」 を め ぐ る こ と が ら （ 性 別 、 性 差 、 性 欲 、 性 行 為 な ど ） に つ い て 、 自 然 科 学 で は な く 社 会 科 学 の 側 か ら ア プ ロ ー チ す る 学 問 分 野 で あ る 。 授 業 で は イ ン ト ロ ダ ク シ ョ ン で ジ ェ ン ダ ー ・ セ ク シ ュ ア リ テ ィ 研 究 が 扱 う 領 域 に つ い て 学 ん だ あ と 、「 近 代 家 族 と 女 性・男性 の 就 労 」「 性 を め ぐ っ て 」「 同 性 愛 の 日 本 近 現 代 史 」 の 三 つ の 大 テ ー マ に つ い て 学 ぶ 。　「 近 代 家 族 と 女 性・男性 の 就 労 」 で は 、「 男 は 外 で 仕 事 、 女 は 内 で 家 事 ・ 育 児 」 と い う 性 別 役 割 分 業 観 や 、 子 ど も へ の 関 心 、 家 庭 に お け る 愛 情 の 強 調 を 特 徴 と す る 近 代 家 族 に つ い て 学 ぶ 。 そ の 上 で 、 そ う し た 近 代 家 族 を 取 り 巻 く 規 範 が 女 性 の 就 労 を ど の よ う に 妨 げ て い る の か を 考 え 、 ま た ジ ェ ン ダ ー 規 範 が 女 性 の み な ら ず 男 性 の 生 き 方 を も 縛 っ て い る 現 状 に つ い て 学 習 す る 。　「 性 を め ぐ っ て 」 で は 、 性 の 自 己 決 定 権・性的自由 と い う 考 え 方 に 基 づ き 、 ジ ェ ン ダ ー を 問 わ ず 誰 も が 自 身 の 性 に つ い て 他 者 か ら 侵 さ れ な い 固 有 の 権 利 を 持 っ て い る こ と 、 だ が 実 際 に は ジ ェ ン ダ ー の 非 対 称 を 背 景 に 、 特 に 女 性 の 性 が 男 性 に よ っ て 侵 さ れ る 現 実 が あ る こ と に つ い て 学 ぶ 。 性 別 を 問 わ ず 、 と も に 社 会 を 担 う 一 員 と し て 親 密 な 交 際 を 築 く た め に は 、性的自由に 関 す る 理 解 が 不 可 欠 で あ る 。　「 同 性 愛 の 日 本 近 現 代 史 」 で は 、性 的 マ イ ノ リ テ ィ の 中 で も 特 に 同 性 愛 に つ い て 、 歴 史 社 会 学 の 手 法 を 用 い な が ら 学 ぶ 。 そ の 上 で 、 昨 今 日 本 で も 議 論 さ れ て い る 同 性 婚 や 同 性 パ ー ト ナ ー シ ッ プ 制 度 の み で は 同 性 愛 者 の 真 の 解 放 は 実 現 し な い こ と 、 そ の た め に は ジ ェ ン ダ ー の 平 等 が 不 可 欠 で あ る こ と を 習 得 す る 。　ジ ェ ン ダ ー と セ ク シ ュ ア リ テ ィ は 別 個 の 問 題 で は な く 、 複 雑 に 絡 み 合 っ て い る 問 題 で あ る と い う こ と を 、 一 つ 一 つ 丁 寧 に 解 き ほ ぐ し な が ら 授 業 を 進 め て い く 。","gradingMethod":"講義中のワーク・小テスト　20点×3回、最終テスト　40点"},{"title":"HS09 法学","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"清野　正哉","update":"2019/02/12","outline":"社会と法の関わりについて、具体的な事例を題材として、そこでの法的な考え方、法的アプローチについて学んでもらうことを目標とする。また、コンピュータに関わる法、インターネットと法、著作権法を中心とした知的財産権に関わる法についても積極的に取り上げ、実践的な講義を行うことを考えている。また、実務的に取り組んでいるコンテンツビジネス(アニメ、ゲーム、映画映像等)についてのライセンス処理、ファンド創生等の最先端のお話しをする予定である。","gradingMethod":"授業態度（出席等）20%、期末試験等80%"},{"title":"HS10 経済学","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"小暮　克夫, 苅間澤　勇人","update":"2019/02/19","outline":"人類が長い年月をかけて築いてきた「市場」制度の機能について学習します。経済学は、家計と企業の意思決定や特定の産業の価格や生産の分析を行う「ミクロ経済学」と経済全体の動きと失業や産出量、経済成長、物価水準、インフレーションといった集計された変数に焦点を当てる「マクロ経済学」の分野から成ります。本授業では、主にミクロ経済学の基礎理論を学習します。","gradingMethod":"授業への参加姿勢（20％）、課題（20％）、期末試験（60％）"},{"title":"HS11 社会学","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"池本　淳一","update":"2019/02/05","outline":"社会学とは近代社会における社会の仕組みと社会問題を探求する学問です。本講義では社会学における基本的な知見と調査方法を学びますが、社会問題を自らの問題として理解するために、グループワークとプレゼンテーションを積極的に取り入れています。またこの講義では、ITがどのように社会問題を解決できるのか、を学生のみなさんそれぞれが考える場も作っていきたいと思います。これらの座学とアクティブラーニングを通じて、本講義ではITと社会の相互依存やITによる社会貢献についての理解も深めていきます。","gradingMethod":"リアクションペーパー及びプレゼンテーション等 100％","reference":"宇都宮京子編『よくわかる社会学』[第2版]ミネルヴァ書房"},{"title":"HS12 日本国憲法","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"清野　正哉","update":"2019/02/12","outline":"諸外国に比べ詳細な人権に関する規定を設けている日本国憲法の現代社会における意義とその役割について、具体的な事例を題材に講義していきたい。また、ネットが個人・家庭・社会へとますます浸透していく中で、そこでの個人の権利がどのように保障されていくべきか、あるいは国家はどのようなコントロールを個人・社会に向けていくべきか、という問題についての憲法的考え方を講義の中で提示していきたい。なお、国会法制局での実務経験と現在も国会審議のお手伝いしている立場からの実務的な憲法の考え方についても伝えていきたい。担当教員は、かつて公務員試験の憲法の試験委員をしていた関係、将来、教員、公務員試験予定者は受講を。","gradingMethod":"授業態度（出席等）20%、期末試験等80%"},{"title":"HS13 国際関係論","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/02/18","outline":"本講義の目的は、転換期を迎えている今日の世界と日本を理解するための分析視角と考察枠組みを学ぶことにある。この場合、2011年3月11日の東日本大震災以後の日本を取り巻く国内・国際情勢に焦点を当てつつ、授業を行なう。「国際関係論」は理系学生にとっては聞きなれない学問分野であるが、政治、経済、外交、安全保障の問題についての基礎的知識のない学生にも配慮しつつ、授業を展開する予定である。授業は原則的に講義中心で行うが、リサーチ実習、グループ討論、個人発表なども積極的に取り入れていきたい。また、学生の学習意欲を高めるため、新聞やニュースで注目を集めている時事問題の解説にも十分な時間を取りたいと考えている。キーワード：「東日本大震災・福島第一原発事故」、「東アジアのダイナミズム」、「日本のICT戦略」、「BOPビジネス」、「官民連携」、「クール・ジャパン」、「ダークツーリズム」、「今、ここにいる自分」","gradingMethod":"授業の最終成績は、以下の基準に基づいて決定する。出席小レポート・授業への貢献状況 　：２０点授業の際に出される諸課題 　　　　　：３０点最終レポート 　　　　　　　　　　　：５０点","reference":"自学自習に有益なインターネット・サイトは、以下の通りである。首相官邸：http://www.kantei.go.jp外務省：http://www.mofa.go.jp/mofaj総務省統計局統計センター：http://www.stat.go.jp/data/guide/index.htm"},{"title":"HS16 保健体育理論","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"中澤　謙, 長谷川　弘一","update":"2019/02/14","outline":"保健体育の目的は、心と体を一体としてとらえ健康・安全についての理解と運動の合理的な実践を通して積極的に運動に親しむ資質や能力を育てるとともに、健康の保持増進のための実践力の育成と体力の向上を図り、明るく豊かな生活を営む態度を育てるところにあります。本講義では、体力の定義，基礎的なトレーニング理論，人間の発育発達についての理解を深めていきます，保健体育の基礎的な知識は健康的でアクティブな生活を送ることに役立ちます．","gradingMethod":"2019年度到達度テスト（75％）、　レポート（25％）","reference":"1．NPO法人日本トレーニング指導者協会編『トレーニング指導者テキスト』大修館書店 2．宮下充正『年齢に応じた運動のすすめ』杏林書院3．近藤光夫『幼児のこころと運動-その発達と指導-』教育出版4．中込四郎『よくわかるスポーツ心理学』ミネルヴァ書房"},{"title":"HS17 科学史","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"網谷　祐一","update":"2019/02/05","outline":"現代社会の繁栄は科学技術の成功なしにはあり得ない。その一方で原子力発電やゲノム編集など、現代科学はさまざまな社会的問題を突きつけている。本科目ではそうした自然科学の本質を歴史的に振り返る。具体的には科学の歴史を古代ギリシアから遡る一方現代の科学および科学者が置かれている問題についても素描する。これによって受講者は科学のたどってきた道およびその現在地を理解することができる。","gradingMethod":"平常点（授業内クイズ含む、15%）、定期試験（50%）、エッセイ課題（35%）、レスポンスシート（＋α）。［比重など変更することがある］","reference":"-朝永振一郎、『物理学とは何だろうか（上）（下）』、岩波新書、1979年-中根美千代他、『科学の真理は永遠に不変なのだろうか』、ベレ出版、2013年-ボウラー、『進化思想の歴史（上）（下）』、朝日選書、1987年-キャンベル=ケリー，W・アスプレイ、『コンピュータ200年史—情報マシーン開発物語』、海文堂、2000年-古川安、『科学の社会史』、ちくま学芸文庫、2018年-W・ブロード、N・ウェイド、『背信の科学者たち』、講談社、2014年その他適宜授業内で紹介する。"},{"title":"HS19 会津の歴史と文化","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"程　子学, 川口　立喜","update":"2019/08/09","outline":"グローバル化に伴い、異文化及びその多様性を理解することや異文化への寛容性を持つことの重要性が増している。そして、多様な文化が接触する現代社会において課題を発見し、その文化的背景を考察しながら解決していく能力が必要になってきている。本授業では、会津の歴史と文化の中からいくつかのテーマを取り上げ、それらと自国の文化や歴史との比較を通して、比較文化・文化人類学の視点から文化が個別的側面と普遍的側面とを持つことを理解し、個別文化の価値を認識する能力を養う。また、多様な文化を持つ学生同士のディスカッションを通し、異文化コミュニケーション力や世界への展開力を同時に身に付けていく。具体的には、会津の風土、文化、歴史、産業、さらには東日本大震災からの福島復興ビジョンを学び、会津や日本についての知識を深める。そして、自国文化と比較しながら会津と自分とのかかわりを明確にすることで、地域アイデンティティを醸成し、それらを活かした世界への展開力を育成していく。本授業では、担当教員から講義を聞いた後、学生は各自が持ち寄った資料の紹介や自国の文化との違いを説明する。そして、グループディスカッションをもとに話題を発展させたり、新たな資料を作成し、自分たちの考えや意見を発表する。また、最終回では各自「ＩＣＴを用いた会津への提案」をまとめ、プレゼンテーションを行う。","gradingMethod":"授業中の課題・宿題：70％プレゼンテーション：30％","reference":"実務経験有り（光永）：学校法人ザベリオ学園にて、会津の郷土史に係る意味論的なデータベースと地理情報システムを構築、高校生の郷土史の研究とシステム開発の指導を行ってきた。この経験をもとに会津の歴史と文化について教授する。授業形態：講義"},{"title":"HS20 アカデミックスキル１","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"菊地　則行, 青木　滋之, 清野　正哉, 長谷川　弘一, 中澤　謙, 苅間澤　勇人, 蛯名　正司","update":"2019/02/20","outline":"教養科目の基礎となる技法―情報のインプットである「読む」、情報から自分の主張を組み立てる「考える」、主張の表現である「書く」の3つを論理的に行うことを学ぶ。また、学問を行う上での基本的マナーを身に付けることで、これからの大学生活の基礎を修得する。","gradingMethod":"学生の授業参加と到達目標に応じた課題により評価が行われる。","reference":"適宜、授業中に指示する。"},{"title":"HS21 アカデミックスキル２","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"長谷川　弘一, 中澤　謙, 清野　正哉, 青木　滋之, 苅間澤　勇人, 菊地　則行, 蛯名　正司","update":"2019/02/20","outline":"特定のテーマについて問題を発見し、設定することを通して、人文・社会科学の認識法の基礎、問題解決型教養の基礎を修得する。","gradingMethod":"授業目的に即して課されるレポートにより評価が行われる。","reference":"適宜、授業中に指示する。"},{"title":"HS22 地域社会学","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"池本　淳一","update":"2019/02/05","outline":"地域社会学とは地域社会における社会構造と社会問題を探求する学問です。本講義では地域社会学における基本的な知見と地域社会が現在直面している地域課題を学びますが、それらを自分自身の「地元の問題」として理解するために、授業ではグループワークとプレゼンテーションを取り入れています。この講義では前半は地域課題の背景と現状を、後半は観光と地域の関係性を学びますが、ITがどのように地域の問題を解決できるのか、を学生のみなさんそれぞれが考える場も作っていきたいと思います。これらの座学とアクティブラーニングを通じて、本講義ではITと社会の相互依存やITによる地域貢献についての理解も深めていきます。","gradingMethod":"リアクションペーパー及びプレゼンテーション等 100％","reference":"「RESAS - 地域経済分析システム」https://resas.go.jp/#/13/13101「みんなで育てる地域の力　地方創生」https://www.kantei.go.jp/jp/singi/sousei/"},{"title":"HS23 経済発展論","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年 \n                  ,\n                  2年","credets":"2.0","instructor":"小暮　克夫","update":"2019/02/19","outline":"国家が経済的に発展するメカニズムや、その過程で抱える様々な社会・経済・政治的問題について学習します。また、ICTが経済発展に与える影響についても多方面から検討します。会津大学の学生が広い視野を持って国際舞台で活躍できることを意図した授業です。","gradingMethod":"授業への参加姿勢（20％）、課題（20％）、試験（60％）"}],[{"title":"PA01 体育実技１","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"1年","credets":"1.0","instructor":"中澤　謙, 長谷川　弘一","update":"2019/02/17","outline":"体育実技の教育的機能は，体育活動（身体運動）を通じて学生の健康的な生活実現のために必要な最大限の身体的，精神的，かつ社会的発達を助成涵養することにある．体育実技１，２は，スポーツの多様な価値や特性を理解し，自己の身体特性や技能水準に合わせて生涯にわたって安全・公正にスポーツを楽しむ態度や社会的スキルを養い，継続的な運動習慣を身につけることにより，健康を保持増進するスキルを養う科目である．⑴履修条件体育実技科目の領域から2単位取得することが卒業要件となる．特に体育実技１と体育実技２を推奨科目として位置づけている．(2)運動環境〇体育館はバスケットボールコート１面，屋内プール25m×５レーン，テニスコート4面，グラウンドは400mトラック1面（サッカーフィールド１面），大学外周２km,内周１kmである．〇各施設において安全を確保し一斉にプレイ可能な人数はそれぞれ以下の通りである．・体育館：最大で24名（バトミントン16名（4面×4名，16名），バレーボール20名（ハーフ２面×12名，24名），卓球20名（５台×4名，20名），・屋内プール：25名（５レーン×５名，25名）・テニスコート：16名（４面×4名）・サッカーフィールド22名（２チーム×11名）（3）素材として取り扱うスポーツ種目バスケットボール，バレーボール，ソフトボール，サッカー，テニス，卓球，バドミントン，水泳など．","gradingMethod":"到達目標に照らし合わせ評価する．1.学習意欲，参加意欲，態度（70％）2.スキルテスト（30％）","reference":"なし"},{"title":"PA02 体育実技２","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"1年","credets":"1.0","instructor":"中澤　謙, 長谷川　弘一","update":"2019/02/17","outline":"体育実技の教育的機能は，体育活動（身体運動）を通じて学生の健康的な生活実現のために必要な最大限の身体的，精神的，かつ社会的発達を助成涵養することにある．体育実技１，２は，スポーツの多様な価値や特性を理解し，自己の身体特性や技能水準に合わせて生涯にわたって安全・公正にスポーツを楽しむ態度や社会的スキルを養い，継続的な運動習慣を身につけることにより，健康を保持増進するスキルを養う科目である．⑴履修条件体育実技科目の領域から2単位取得することが卒業要件となる．特に体育実技１と体育実技２を推奨科目として位置づけている．(2)運動環境〇体育館はバスケットボールコート１面，屋内プール25m×５レーン，テニスコート4面，グラウンドは400mトラック1面（サッカーフィールド１面），大学外周２km,内周１kmである．〇各施設において安全を確保し一斉にプレイ可能な人数はそれぞれ以下の通りである．・体育館：最大で24名（バトミントン16名（4面×4名，16名），バレーボール20名（ハーフ２面×12名，24名），卓球20名（５台×4名，20名），・屋内プール：25名（５レーン×５名，25名）・テニスコート：16名（４面×4名）・サッカーフィールド22名（２チーム×11名）（3）素材として取り扱うスポーツ種目バスケットボール，バレーボール，ソフトボール，サッカー，テニス，卓球，バドミントン，水泳，ランニングなど．","gradingMethod":"到達目標に照らし合わせ評価する．学習意欲，参加意欲，態度（70～80％）スキルテスト（20～30％）","reference":"なし（必要に応じて資料作成および配布）"},{"title":"PA03 体育実技３","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"中澤　謙, 長谷川　弘一","update":"2019/02/01","outline":"／Course outline\t体育実技の教育的機能は、体育活動（身体運動）を通じて学生の健康的な生活実現のために必要な最大限の身体的、精神的、かつ社会的発達を助成涵養することにある。体育実技科目の領域から2単位取得することが卒業要件となるが、特に体育実技１と体育実技２を推奨科目として位置づけており、継続的な運動習慣を身につけることによって健康保持のため生涯体育を目指す。","gradingMethod":"／Grading method/criteria\t学習意欲、参加意欲、態度（70％）スキルテスト（30％）","reference":"／Reference (coursewebsite, literature, etc.)\t特になし"},{"title":"PA04 体育実技４","semester":"2019年度／Academic Year\n            　4学期集中\n              ／4thQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"中澤　謙, 長谷川　弘一","update":"2019/02/01","outline":"／Course outline\t一生涯を通じて実践できるスポーツや健康法に対する意識を啓蒙し、より専門的な技術体系を理解することにより実践力の向上を図る。","gradingMethod":"／Grading method/criteria\t参加・学習意欲、態度（50）、技術力（50）","reference":"／Reference (coursewebsite, literature, etc.)\t種目ごとに資料作成および配布"}],[{"title":"EN01 Introductory English 1","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"1年","credets":"1.0","instructor":"安田　尚子, 野北　明嗣","update":"2019/08/09","outline":"This course teaches students basic English skills necessary for communication, achieving academic goals, and personal development at the University of Aizu. Through a variety of topics and activities, students will develop four language skills (i.e., reading, writing, listening and speaking) with emphasis on receptive skills. ***Important: All English courses for first-year students are extremely important for your success at the University of Aizu. We strongly recommend you to take all of them (Introductory English 1-4) regardless of your TOEIC score.The course includes the following components:• In-class activities: Participating actively in class activities and tasks is an important part of the course. • Homework assignments: Your instructor will assign homework to be done outside of class. These assignments are an important part of the course, and contribute to your overall final course grade.• Survival list: You must learn frequently used expressions in class and take quizzes based on the survival list.• Midterm & final exams: You must take these exams in order to pass this course. ***Important: In order to pass this course, students must also complete :• TOEIC e-learning: Students must finish the assigned number of lessons and get at least 65% correct at each quiz.• Vocabulary quizzes: Take assigned vocabulary quizzes online and achieve the required score.","gradingMethod":"Grades will be based on the following items:• Survival list 10%• Class activities (quizzes, in-class assignments, reflection) 20%• Homework assignments 20%• Midterm exam 25%• Final exam 25%You need to earn more than 40% in each component to pass the course. ***Important: In order to pass this course, students must also complete TOEIC e-learning and vocabulary quizzes.","reference":"Work experienceAkitsugu Nogita: He worked in KAWAI Musical Instruments as an inventory manager and a musical instrument seller. He also worked in Seibu Recreation as a tennis instructor. He was also in charge of sound analysis in the Amazon speech recognition project.Class:Lecture"},{"title":"EN02 Introductory English 2","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"1年","credets":"1.0","instructor":"ピーター　イリチュ, 金子　恵美子, 野北　明嗣, アラン　ニコラス","update":"2019/08/09","outline":"This course teaches students basic English skills necessary for communication, achieving academic goals, and personal development at the University of Aizu. Through a variety of topics and activities, students will develop four language skills (i.e., reading, writing, listening and speaking) with emphasis on receptive skills. The course includes the following components:• In-class activities: Participating actively in class activities and tasks is an important part of the course. • Vocabulary quizzes: Take assigned vocabulary quizzes online and achieve the required score. • Homework assignments: Your instructor will assign homework to be done outside of class. These assignments are an important part of the course, and contribute to your overall final course grade.• Midterm & final exams: You must take these exams in order to pass this course. ***Important: In order to pass this course, students must also complete:• TOEIC e-learning: Students must finish the assigned number of lessons and get at least 65% correct at each quiz.• Extensive reading: Students must read required words during the second quarter.","gradingMethod":"Grades will be based on the following items (subject to change):• Vocabulary quizzes 10%• Class activities (quizzes, in-class assignments, reflection) 20%• Homework assignments 20%• Midterm exam 25%• Final exam 25%You need to earn more than 40% in each component to pass the course. ***Important: In order to pass this course, students must also complete TOEIC e-learning and Mreader (extensive reading):","reference":"Work experience:Emiko Kaneko: She worked in Gakken School Management as an English instructor and an academic administrator. She was also in charge of the development and the quality maintenance of English speaking tests in ALC press. Akitsugu Nogita: He worked in KAWAI Musical Instruments as an inventory manager and a musical instrument seller. He also worked in Seibu Recreation as a tennis instructor. He was also in charge of sound analysis in the Amazon speech recognition project.Class:Lecture"},{"title":"EN03 Introductory English 3","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年","credets":"1.0","instructor":"アラン　ニコラス, 金子　恵美子","update":"2019/08/09","outline":"This course continues from the Introductory English 1 and Introductory English 2 courses taught in the first two quarters of the freshman year. Introductory English 3 aims to continue developing learners’ four language skills of reading, writing, listening and speaking for general communication. In addition, the course aims to improve learners’ fluency with English; learners’ ability to engage in meaningful communicative interaction, and also further learners’ knowledge of the formal aspects of the English language, such as vocabulary, grammar and pronunciation. At the same time, learners will engage with a variety of content topics and themes, developing their ability to discuss issues and think critically.The course includes:•In-class activities- participating actively in class activities and tasks is an important part of the course. Your participation will be carefully monitored. It is also important for you to bring the course textbook to every class; not bringing the textbook will affect your class participation evaluation. If you have to miss a class for an important reason (such as illness, or a family emergency), you should contact your instructor in advance.•Vocabulary quizzes- there will be regular vocabulary quizzes throughout the course, based on words found in the course textbook. Your vocabulary quiz scores contribute to your overall final course grade.•Homework assignments- your instructor will sometimes assign homework to be done outside of class. These assignments are an important part of the course, and contribute to your overall final course grade.•Mid-term & final exams- exams will be administered twice for this course. Make-up exams will only be allowed for legitimate reasons (such as illness or a family emergency).***Important: In order to pass this course, students must also complete:•TOEIC e-learning- students must successfully pass the quizzes of the assigned units.•Extensive reading- students must achieve a set goal for the number of words read during the third quarter of the freshmen year. If a student fails to complete the TOEIC e-learning or extensive reading components, they cannot pass the Introductory English 3 course.","gradingMethod":"Grades will be based on class participation, vocabulary quizzes, homework assignments, a speaking assignment, and the two examinations:•\tActive participation- 5%•\tSpeaking assignment- 15%•\tIn-class activities/ homework assignments- 20%•\tMid-term exam- 30%•\tFinal exam- 30%***It is necessary to earn at least 40% in each category in order to pass the course.***•Student obligations- It is the students’ responsibility to read the syllabus and weekly instructions; take the quizzes, speaking assignments and exams on time, and complete homework assignments in a timely manner. It is important to attend classes. If you are absent more than the maximum number allowed for this course, the final grade will be an “F,” regardless of your final score for the course.If you are late three times, that will count as one absence. If you are more than twenty minutes late, you will be regarded as being absent from that class.•Academic integrity- Students must take the quizzes and exams individually; cheating or plagiarizing other’s work will not be allowed. Students can help each other to understand instructions, or the meaning of questions, but they must give their answers independently.","reference":"The course instructors have work experience in private industry, as language instructors, administrators and in developing and administering language assessments.The course will be managed via the Schoology website.***Note: This course syllabus is subject to change.Class:Lecture"},{"title":"EN04 Introductory English 4","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年","credets":"1.0","instructor":"ジェレミー　パーキンズ, アラン　ニコラス, ピーター　イリチュ","update":"2019/08/09","outline":"This course continues from the Introductory English 1, Introductory English 2 and Introductory English 3 courses taught in the first three quarters of the freshman year. Introductory English 4 aims to continue developing learners’ four language skills of reading, writing, listening and speaking for general communication. In addition, the course aims to improve learners’ fluency with English; learners’ ability to engage in meaningful communicative interaction, and also further learners’ knowledge of the formal aspects of the English language, such as vocabulary, grammar and pronunciation. At the same time, learners will engage with a variety of content topics and themes, developing their ability to discuss issues and think critically.The course includes:•\tIn-class activities- participating actively in class activities and tasks is an important part of the course. Your participation will be carefully monitored. It is also important for you to bring the course textbook to every class; not bringing the textbook will affect your class participation evaluation. If you have to miss a class for an important reason (such as illness, or a family emergency), you should contact your instructor in advance.•\tVocabulary quizzes- there will be regular vocabulary quizzes throughout the course, based on words found in the course textbook. Your vocabulary quiz scores contribute to your overall final course grade.•\tHomework assignments- your instructor will sometimes assign homework to be done outside of class. These assignments are an important part of the course, and contribute to your overall final course grade.•\tMid-term & final exams- exams will be administered twice for this course. Make-up exams will only be allowed for legitimate reasons (such as illness or a family emergency).***Important: In order to pass this course, students must also complete:•\tTOEIC e-learning- students must successfully pass the quizzes of the assigned units.•\tExtensive reading- students must achieve the set goal for number of words read during the fourth quarter of the freshmen year. If a student fails to complete the TOEIC e-learning or extensive reading components, they cannot pass the Introductory English 4 course.","gradingMethod":"Grades will be based on class participation, vocabulary quizzes, homework assignments, a speaking assignment, and the two examinations:•\tActive participations- 5%•\tVocabulary quizzes- 10%•\tSpeaking assignment- 15%•\tIn-class activities/ homework assignments- 20%•\tMid-term exam- 30%•\tFinal exam- 30%***It is necessary to earn at least 40% in each category in order to pass the course.***•\tStudent obligations- It is the students’ responsibility to read the syllabus and weekly instructions; take the quizzes, speaking assignments and exams on time, and complete homework assignments in a timely manner. It is important to attend classes. If you are absent more than 4 times for this course, the final grade will be an “F,” regardless of your final score for the course.Being late three times will be counted as one absence. Being more than twenty minutes late will be counted as an absence.•\tAcademic integrity- Students must take the quizzes and exams individually; cheating or plagiarizing other’s work will not be allowed. Students can help each other to understand instructions, or the meaning of questions, but they must give their answers independently.","reference":"The course instructors have experience in private industry, as language instructors, administrators and in developing and administering language assessments.The course will be managed via the Schoology website.***Note: This syllabus is subject to change.***Class:Lecture"},{"title":"EN05 Intermediate English 1","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"ホウ　ヨンヒョン, ジェレミー　パーキンズ, ピーター　イリチュ","update":"2019/02/14","outline":"This course is designed to consolidate basic communication skills in English and further foster critical thinking skills, learning to summarize/generate ideas or construct/evaluate arguments in English independently and collaboratively. Activities will be balanced across the 4 skills (listening, speaking, reading and writing), designed to improve both the receptive and productive skills in discussing course topics. Topics introduced in this course center around the contemporary issues, which students will find intriguing and essential in their career development. Also, there will be mandatory e-learningassignments in this course. Details will be provided in class.","gradingMethod":"Assignments: 30%Midterm Exam: 30%Final Exam: 30%Participation: 10%","reference":"Course materials (e.g. lecture notes) are available on the course page."},{"title":"EN06 Intermediate English 2","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"2年","credets":"2.0","instructor":"ジョン　ブレイク, イアン　ウイルソン, ホウ　ヨンヒョン, 手代木　Troy　香","update":"2019/02/14","outline":"This course is designed to teach students how to organize and present their ideas effectively in English so that they can further develop their skills required in academic English. With the topics encompassing broad areas of study, students will learn how to summarize English materials (both verbally and also in writing) and express their ideas clearly in English (both in the form of structured texts and oral presentation). Also, there will be mandatory e-learningassignments in this course. Details will be provided in class.","gradingMethod":"Assignments: 30%Midterm Exam: 30%Final Exam: 30%Participation: 10%","reference":"Course materials (e.g. lecture notes) are available on the course page."},{"title":"EN07 Intermediate English 3","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"2.0","instructor":"イアン　ウイルソン, デボプリオ　ロイ, ジョン　ブレイク","update":"2019/02/14","outline":"Course descriptionIE3 is an English course focused on writing and technical presentation skills. This course teaches students to speak and write English at an intermediate to advanced level. Course focus is on preparing students for careers as computer scientists. The course will focus on critical thinking abilities in specific contexts of use. Further, the course will prepare students to make conference presentations, speak diligently, make presentations articulately and learn online content management and delivery at an acceptable level.","gradingMethod":"Methods and criteria for assessmentAssignment\t                          Class Session 1 - Introductory Forum Assignment - 5%\t                               Class Session 2, 3 - Summarization of Ideas in Writing - 10%\t                               Class Session 2, 3 - Summary in Speech\t2, 3 - 10%\t                                                       Class Session 4 - Keywords identification and re-phrasing/rewording - 5%Class Session 5 - Note-taking assignment based on TED talks - 10%Class Session 6 - Summary of TED Talks / Rephrasing of points - 10%\t              Class Session 7, 8 - Thesis Statement / Mind-Maps / Graphics caption - 10%Class Session 9, 10 - Designing tech presentation & verbal summary - 10%Class Session 11, 12 - Using Screencast-o-matic for content delivery - 10%\t   Class Session 13, 14 - Technical Presentation - 10%\tWeek # 8: Poster Creation - 10%                               TOTAL\t100","reference":"Technology Resources•\tSchoology (https://www.schoology.com/)•\tMind Maps (https://coggle.it/)•\tScreencast-o-Matic (https://screencast-o-matic.com/)•\tGrammarly (https://www.grammarly.com/)•\tYouTube (https://www.youtube.com/)•\tTED Talks (https://www.ted.com/talks)•\tVoiceTube (https://www.voicetube.com/)•\tGoogle Scholar (https://scholar.google.co.jp/)•\tPoster Creation (http://guides.nyu.edu/posters)"},{"title":"EN08 Thesis Writing and Presentation","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"4年","credets":"1.0","instructor":"ジョン　ブレイク, キム　フオレスター　ロッケル, イアン　ウイルソン, ピーター　イリチュ, デボプリオ　ロイ, アラン　ニコラス, ジェレミー　パーキンズ, 金子　恵美子, 安田　尚子, ホウ　ヨンヒョン, 野北　明嗣","update":"2019/08/09","outline":"The primary aim of this course is to enable participants to write a graduation thesis that conforms to the university guidelines and expectations of supervisors. The form, function and content of the graduation thesis and its sections will be studied in detail. Participants will plan, draft, edit and revise their own graduation thesis throughout this course. The secondary aim is to plan, prepare and practice for the graduation thesis presentation.","gradingMethod":"Thesis writing: 70%Criteria: Accuracy, Brevity, Clarity, Objectivity, Formality and CompletenessPresentation: 30%Criteria:Language skills (grammar, vocabulary, pronunciation)Presentation skills (content, slide design, body language)","reference":"The course instructors have many years of experience teaching writing and presentations in a variety of private language schools within Japan and worldwide, in private companies, in multinational corporations, such as Seimens and Epson, and in nonprofit organisations, such as the International Federation of the Red Cross and Red Cresent.Class:Lecture"}],[{"title":"EL102 Design of Human Languages","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"ホウ　ヨンヒョン","update":"2019/02/08","outline":"This course introduces how human languages are designed/structured.  Specifically, it will focus on the word, sentence and sound structure of various languages in the world showing structural diversity of human languages as it introduces some basic concepts and terms used in linguistics. Also, some interesting topics related to human language (e.g., “language acquisition”, “language and brain” and “language and thought”) will be discussed.","gradingMethod":"Participation: 15%Homework: 25%  Midterm Project: 30%Final exam: 30%","reference":"Course materials (e.g. lecture notes) are available on the course page."},{"title":"EL113 Pronunciation: Comparing English and Japanese Sound Systems","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"イアン　ウイルソン","update":"2019/08/09","outline":"This course is a contrastive analysis of the phonology and phonetics (the sound systems) of Japanese and English. Each language's inventory of sound segments will be compared systematically, as well as the syllable structure and some phonological rules. Students will be taught to produce (pronounce) and perceive the differences between sounds in these two languages. In order to assist students in differentiating between English and Japanese sounds, both ultrasound and acoustic analysis software will sometimes be used in the classroom.","gradingMethod":"Participation:  15%Quizzes and Online Forums:  45%Final Exam:  40%"},{"title":"EL115 Analysis of English Sentence Structure","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"金子　恵美子","update":"2019/02/06","outline":"[This class will be offered in the flipped-classroom style]Students will analyze sentences at the micro level and manually draw tree diagrams both in class and as assignments. We will start from simple to more complex sentences and give enough time to learn diagramming techniques.","gradingMethod":"1. Class Participation (Presentations and participation in group work) [20% ]2. In-class and homework assignments/quizzes [ 10% ]3. Midterm Exam [ 30% ]4. Final Exam [ 40% ]","reference":"For more information about flipped classroom.http://g-jhd.jp/questionnaire/7140"},{"title":"EL131 Language and Linguistics","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"ジェレミー　パーキンズ","update":"2019/02/13","outline":"Students will learn about the structural properties of human language as illuminated by modern linguistic theory. A range of topics will be covered, including sound patterns, sentence structure, word form and aspects of meaning.","gradingMethod":"Homework Assignments\t30%Midterm Exam\t\t\t25%Final Exam\t\t\t35%Class Participation\t\t10%"},{"title":"EL134 High Frequency Vocabulary","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"スチュアート　ベンソン","update":"2019/08/26","outline":"Knowledge of the most frequent 3,000 words in English are critical to communicate (listen and speak), and to read and write. Luckily, there is a high-frequency vocabulary word list that contains these words. However, just learning these words receptively is not enough. We need to be able to productively use the words in context. Therefore, this course will focus on receptively and productively using these words from the 3,000-word list. In this high-frequency vocabulary course, we will learn the most important words in English through numerous meaning-focused activities as well as the goal of learning a weekly list of words, which will focus on the most frequently used words in English.","gradingMethod":"1. Participation: 10%2. Weekly vocabulary quizzes: 30%3. Mid-term vocabulary test: 30%4. End-term vocabulary test: 30%"},{"title":"EL144 Conversation Analysis and the Pragmatics of Spoken Interaction","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"アラン　ニコラス","update":"2019/02/08","outline":"When we learn a foreign language, we typically focus on grammar, vocabulary and pronunciation. These are important! However, we sometimes forget to think about pragmatics- the ways in which our language choices can change in different social situations. This short course introduces you to the pragmatics of the English language. You will learn about how conversation is constructed in real-life situations, and how our grammar patterns and vocabulary choices vary in different contexts. \tThe course introduces the concept of speech-as-action. We will use the tools of \t\tconversation analysis to describe authentic talk and gain an understanding of how it can vary according to context. You will have opportunities to analyse model talk and apply apply knowledge to your own spoken interactions.Course components1. In-class activities/participationYou should attend all classes and participate in all activities. Attendance will be \t\ttaken at the beginning of class. Students who arrive on time will receive 1 point for “Attendance and participation;” those who arrive late will receive 0.5 points, and those who are absent will receive 0 points for that class. In addition, failure to actively participate in class may lead to points being deducted from the “Attendance and participation” category. If you have to miss a class for a legitimate reason (e.g., illness or family emergency), you have to contact Allan Nicholas in advance to get credits for attendance.2. Assignments/homeworkSometimes your instructor will give you assignments to complete for homework. It is important to complete all assignments and hand them in on time.3. Mid-term and end-term assessmentsThere are two assessments for this course- the mid-term assessment, and the end-term assessment. Make-up assessments will only be given if you miss a test for a legitimate reason (e.g. illness or family emergency).4. End-term projectYou will complete a project at the end of the term to demonstrate your ability to \t\tapply the things you have learnt throughout the course.","gradingMethod":"Participation: 15%Mid-term assessment: 20%Final assessment: 20%Assignments: 15%End-term project: 30%Student obligationsIt is the responsibility of students to read the syllabus and complete all assignments, tests and projects on time.If you do not bring the materials you need to class, you will be considered ‘absent.’ If you are exceed the maximum number of absences allowed, the final grade will be an F regardless of your final score for the course.\tAcademic integrityCheating/plagiarizing other’s work is not allowed. Sometimes the instructor will ask you to complete work in pairs or small groups, and sometimes individually. When working by yourself, you are not allowed to copy other students’ work.","reference":"Every student must enroll in the course through Schoology. Your professor will give you the access code on the first day of classes. Weekly announcements will be uploaded on the course page on Schoology. Please check Schoology for detailed information on assignments or other course information. Please contact your professor if you have any problems accessing the website. If you have problems with your login, please contact or visit SSB (RQ 207-E)."},{"title":"EL145 Vocabulary: Theory and Practice","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"スチュアート　ベンソン","update":"2019/08/26","outline":"Have you ever thought about what words to study, why you study some words and not others and how to study words effectively? If you have, this course will finally give you the answers. Vocabulary: Theory and practice will look at several topics that have been extensively researched and finally give you answers to the questions above. We will cover the basics of vocabulary, looking at which words are most valuable to your English learning. We will then look at several strategies that will help in learning vocabulary. Finally, we will look at how learning vocabulary is not just from word lists but can be incorporated into the four skills.","gradingMethod":"1. Participation: 15%2. In-class and homework 15%3. Mid-term Project: 30%4. End-term project: 40%"},{"title":"EL152 Reading Fluency","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"金子　恵美子","update":"2019/02/14","outline":"You will practice both \"extensive\" and \"intensive\" reading in this class. Extensive reading (ER), the activity that you had in the first year, is believed to improve overall language ability if enough number of words is read. In this course, students will read more than 40,000 words of graded readers and write and present a book report at the end of the quarter.  Intensive reading is a way of reading difficult text by analyzing the structure and meaning, possible with a dictionary. This course will attempt to improve your overall reading fluency by reading English in these two ways.","gradingMethod":"1. Number of words and books that you have read [30%]2. Midterm Exam [20% ]3. Final Exam [ 20% ]4. Book report [15%]5. Presentation [10%]6. Active class participation [5%]","reference":"The course instructor, Emiko Kaneko, worked in Gakken School Management as an English instructor and an academic administrator. She was also in charge of the development and the quality maintenance of English speaking tests in ALC Press. About extensive readinghttp://www.toyota-ct.ac.jp/intro/education/student_support/tadoku.html"}],[{"title":"EL213 Design of Movies for Professonal Communication","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"デボプリオ　ロイ","update":"2019/02/14","outline":"In this interesting course, students will be asked to design the script for a full-fledged movie documentary about a recently developed technology in the market. Students during the quarter will have to use different semantic models for linguistic application, including developing the ontology of different variants of information and linkages which could be used to develop a proper thoughtful storyline and an informative script. Different semantic models including text-mining, concept mapping and infographics software will be used for information management purposes. A lot of time during this course will be spent on understanding the basics of ontology development, and information scripting for documentary movies.","gradingMethod":"Assessment Rubric: The assessment rubric is part of the assignment instructions each week. However, a detailed grading schema will be maintained for each assignment. Please check the course webpage for the grading schema for each assignment. Assessment (Overall Criteria): Each group and/or individual assignment will be graded against a specific set of criteria. A student will either get 0 or 1 for each category as is seen below. 1. Organization of Ideas ( 0/1)2. Clarity of Ideas (0/1)3. Grammatical and Sentence Construction Issues (0/1)4. Use and Explanation of Graphics (0/1)5. User-Friendly Nature of the Information (0/1)6. Text-Graphics Coordination (0/1)7. Information Accessibility (0/1)**** Specific overall feedback will be provided on each of these points every week. Grading: Every week you will have different kinds of assignments. In order to get a grade, students MUST individually post the group assignment in Schoology. The grade distribution might be subjected to last minute changes. Assignment # 1 (10%): Developing a Movie Script from Scratch (Brainstorming and Searching for Information from Internet); Short Report including a Heat Map to Demonstrate the Use of a New Technology in the World MarketAssignment # 2 (15%): Developing the Complete Storyline Textually; Include SketchboardAssignment # 3 (15%): Designing 4 Types of Concept MapsAssignment # 4 (15%): Write a Feasibility Report using Data Mining ReportWeek # 5 (5%): Poster Design for Movie Script - VENNGAGE / CRELLOWeek # 6 (20%): Research: The Use of Chosen Technology in the European Market - Represent your Research in Social Network Visualizer with SOCNEVWeek # 7 (20%): Demonstrate the Full Development of the Movie Idea using Gephi"},{"title":"EL218 Presentation Skills","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"ホウ　ヨンヒョン","update":"2019/02/08","outline":"This course is designed to provide students with skills and trainings in preparing and giving informal to formal presentations. Trainings include sessions on learning useful techniques for presentation and also preparing presentation materials and delivering them effectively during the presentation.","gradingMethod":"Class Participation: 15% Assignments/Activities: 25%Midterm Project: 20%Final Project: 40%","reference":"Course materials (e.g. lecture notes) are available on the course page."},{"title":"EL222 Business Writing and Presentations","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"デボプリオ　ロイ","update":"2019/02/14","outline":"Course DescriptionThis course is designed for advanced students at University of Aizu who expect to write in their future employment. Moreover, the purpose is to increase awareness of students at UoA about the start-up business culture in Silicon Valley, California. This corporate knowledge about the inner functioning of some of the Silicon Valley companies are important as students get ready to start working after their graduation. Such knowledge would also help them prepare for job interviews. Successful employees know how to communicate clearly and effectively, changing writing style and content for varying audiences and purposes. This class will focus on the difficult task of meeting readers' needs while simultaneously representing your best interests and those of your employer. To meet that end, the assignments will cover a variety of tasks produced under different circumstances, some done quickly during class and some polished and perfected over time. Students completing the semester's work should see a visible improvement in their writing, especially in terms of clarity and precision.","gradingMethod":"Grading:(Everyone in the group should individually post every individual part of the group assignment)•\t1st Graded Assignment (week #1 - 15%)•\t2nd Graded Assignment (week #2 - 15%)•\t3rd Graded Assignment (week # 3 - 15%)•\t4th Graded Assignment (week # 4 - 15%)•\t5th Graded Assignment (week # 5 - 10%)•\tFinal Project (week # 6, 7 and 8 - 30%)Assessment Criteria for Workshops:I believe that students can motivate themselves best when real-life experience is involved in the process of learning.The grading for the real-client project would be based on a number of criteria:1. Organization.2. Content3. Quality.4. Layout.5. Formatting.6. Visual Design.7. Productions and Print Quality.8. Group Collaboration and Confidential Evaluation"},{"title":"EL233 Technical Writing for IT Business","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"デボプリオ　ロイ","update":"2019/02/15","outline":"This course is about IT Business and International Collaboration. IT Business in the modern era is as much about IT, as it is about international collaboration. As part of this course, we will learn about technology and also take part in international project management. 3D printing is the new wave in the industrial revolution.As part of this course, students will learn about the 3D printing technology and its associated processes. They will complete a short project related to 3D printing every week. The course will have a very strong focus on designing technical videos and making in-class technical presentations.As they complete the weekly projects, they will share their own project outcomes with students from Karlsruhe University of Applied Sciences, Germany. These students from HSKA, Germany will consult with you about your weekly projects; take the information and learn how to make a content management and delivery system as part of their own course. This collaboration with HSKA, Germany will then result in an ACM seminar presentation from January 28 - February 1, 2020 (final dates yet to be decided).WE WILL HAVE LOTS OF FUN WORKING ON THIS COURSE.","gradingMethod":"Weekly Assignments and Grades:Week # 1: 1st Graded Assignment - (Introduction to 3D Printing) - 10%Week # 2: 2nd Graded Assignment - (Industrial Applications of 3D Printing) - 10%Week # 3: 3rd Graded Assignment - (Video on 3D Printing Business Idea) - 10%Week # 4: 4th Graded Assignment - (User Guide on CAD Prototyping) - 15%Week # 5: 5th Graded Assignment - (Screencast-o-Matic Presentation on 3D Scanning & Slicing) - 15%Week # 6:6th Graded Assignment – (YouTube/Adobe Spark Animation Presentation on Communication, Design & Content Management Tools) - 15%ORRestaurant Industry Technical Production - 15%Week # 7: 7th Graded Assignment– (COLLABORATION WITH HSKA) - 25%"},{"title":"EL234 Research poster presentations","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"ジョン　ブレイク","update":"2019/08/09","outline":"The ability to design and deliver presentations is a skill that is valued in academia and business alike. This course focuses on developing presentation skills to enable students to present their research confidently to a small audience. This course is specifically designed to help students prepare for the graduate thesis poster presentation.","gradingMethod":"Oral presentation: 30%Poster design: 30%Poster presentation: 40%","reference":"The course instructor has many years of experience teaching presentation skills in a variety of private companies, in multinational corporations, such as Seimens and Epson, and in nonprofit organisations, such as the International Federation of the Red Cross and Red Cresent.Class:Lecture"},{"title":"EL235 Basic and Practical English Pronunciation: 13 vowels and 24 consonants","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"野北　明嗣","update":"2019/08/26","outline":"日本語には五十音表があり、全ての単語は五十音表の音だけでできている。英語にも五十音表にあたるものがあり、全ての英単語はその表の音だけでできている。つまりその表さえ覚えれば、理論上は全ての英単語を通じるように発音できる。ほとんどの日本人英語学習者は、この最も土台の部分を習うチャンスに恵まれないので、本授業ではそれを行う。","gradingMethod":"Vowel quiz (母音小テスト): 20Consonant quiz (子音小テスト): 15Phonics quiz (つづり小テスト): 15Assignments (課題): 15Final exam (期末テスト): 35","reference":"https://youtu.be/g0QIzy2KfKc"},{"title":"EL244 An Introduction to Cross-cultural Communication","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"2.0","instructor":"アラン　ニコラス","update":"2019/08/09","outline":"Course IntroductionIn this course, learners' awareness of cultural differences and the ways in which these differences are realized in communication will be raised. Learners will practice and develop all four language skills (reading, writing, listening & speaking), and will build their vocabulary. Course componentsa) In-class activities/participationYou should attend all classes and participate in in-class listening and speaking activities. Attendance will be taken at the beginning of every lesson, and your participation will be carefully checked during the class. If you have to miss a class for a legitimate reason (e.g., illness or family emergency), you must contact your professor in advance to get credits for attendance.b) Assignments:The professor will regularly give graded tasks and quizzes. Some of these will be done in class, and some at home. It is important to complete them on time, and bring them to class. Late homework will not be accepted.c) Mid-term and final exams:Exams will be administered twice this term. Make-up exams will be provided only if you miss an exam for a legitimate reason (e.g., illness or family emergency).","gradingMethod":"Grading Method/Criteria:Participation: 15%Mid-term exam: 25%End-term assessment: 30%Project: 15%\tQuizzes & Tasks: 15%Attendance will be taken at the beginning of class. Failure to complete homework on time or to actively participate in class may lead to points being deducted from the “participation” category.To pass the course, your overall score must be at least 50%. Course policiesStudent obligationsIt is the responsibility of students to read the syllabus and weekly agendas carefully to take the quizzes and exams during the designated time and submit their works by the designated due dates. If you are absent more than the maximum allowed number of times, the final grade will be an F regardless of your final score for the course. Academic integrityIt is required that students take quizzes and exams individually; cheating/plagiarizing other’s work will not be tolerated. Students can help each other with assignments to clearly understand questions, but answer parts in each assignment must be completed independently. Co-work is not allowed for this course unless in case of group-work assignments.","reference":"The course instructor has experience working in the private language education sector, designing curricula and providing instruction.Course WebsiteEvery student must enroll in the course through Schoology. Your professor will give you the access code on the first day of classes. Weekly announcements will be uploaded on the course page on Schoology. Please check Schoology for detailed information on assignments or other course information. Please contact your professor if you have any problems accessing the website. If you have problems with your login, please contact or visit SSB (RQ 207-E). ***Note: this syllabus is subject to change.***Class:Lecture"},{"title":"EL245 Learning Theory and Online Technologies","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"ピーター　イリチュ","update":"2019/02/14","outline":"In our technology-driven world, it is critical and timely to study the intersection of learning theory and technology. This course will cover both learning theory and online technologies in Education particularly focusing on the intersection of learning theory and technology. It will address the challenges faced by professionals as new technologies transform the world of education. Students will gain the theoretical and practical knowledge invaluable for education in our technology-driven world. We will discuss and reflect on the theory of learning and teaching practices and pedagogical approaches in relation to the opportunities afforded by online technologies. It will be of particular interest to students who are interested in becoming educators.","gradingMethod":"•\tOnline Quizzes: 72%•\tProject Presentation (PowerPoint): 25%•\tSurvey 3%"},{"title":"EL246 Communicating in Organizations","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"野北　明嗣","update":"2019/08/26","outline":"大学卒業後、どのような仕事に就こうとも（民間企業、政府、学校、研究所等）、コミュニケーションスキルが高い方が成功しやすい。本コースでは、担当教員が主にカナダや中国で学んできたコミュニケーションスキルを扱う。各授業で、学生達は与えられたトピックに関して、インストラクションに従って、意見を述べてもらう。クラスの人数が多い場合は、スピーチの動画をYouTubeにアップする課題を出すこともある。意見をレポートにして出す課題も数回出す。このコースには、他人の意見を批判しないというルールがあるので、人前で意見を言うのが苦手な学生歓迎。","gradingMethod":"In-class and/or out-of-class oral presentation assignments : 60%Writing assignments: 25%Final project (Play): 15%","reference":"Empathy and sympathyhttps://www.workplacestrategiesformentalhealth.com/mmhm/pdf/articles/Understanding_Empathy_and_Sympathy.pdfClarificationhttps://www.skillsyouneed.com/ips/clarification.htmlCustomer complaintshttps://www.eonetwork.org/octane-magazine/special-features/sixstepstodealingwithcustomercomplaintsComplimentshttps://englishwithkim.com/giving-compliments/Gender differenceshttps://online.pointpark.edu/public-relations-and-advertising/gender-differences-communication-styles/Smart answershttps://chroniclevitae.com/news/358-stupid-questions-smart-answershttps://www.inc.com/lolly-daskal/the-smartest-ways-you-can-answer-dumb-interview-questions.htmlManaging people with low ambitionhttps://www.mindtools.com/pages/article/low-ambition-workers.htm"}],[{"title":"EL314 Experimental Methods and Statistics for Linguistics","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"ジェレミー　パーキンズ","update":"2019/02/13","outline":"Students will learn to use R in order to apply basic statistical techniques on linguistic data. The course will focus on analysis of acoustic data using the Praat software package. Students will learn how to run an acoustic study using Praat scripts, with techniques for organizing, processing and analyzing the results via R.","gradingMethod":"Homework Assignments (6 assignments worth 5% each)\t\t       30%Midterm Exam (in class – class 8 or 9)\t\t\t\t               25%Take-home Final Project (assigned class 10; due end of quarter)\t25%Class Participation\t\t\t\t\t\t\t                       20%"},{"title":"EL315 Design and Analysis for IT Business","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"2.0","instructor":"デボプリオ　ロイ","update":"2019/02/15","outline":"This course is designed to help you develop an overall understanding of the IT market with applications which are specific to a SMART CITY DESIGN context. As part of this course, students will develop arguments through technical reports and presentations about how different SMART and INTELLIGENT IOT-based technologies could be used in the context of Fukushima revitalization. We will also look into how practical and feasible is SMART CITY from the perspective of social and community planning and economic development in the society.This course will help develop entrepreneurial thinking in our students, and provide a context for understanding the IT market while developing technical communication-based skillset.","gradingMethod":"Weekly Assignments and Grades: (100%) + 5% bonus markingfor attendance and group participationWeek # 1: Reflection Paper # 1 - 5% (Importance of Usability)Week # 2: Reflection Paper # 2 - 10% (User Experience Research)Week # 3: Reflection Paper # 3 – 10% (Understanding Usability Concepts in a Smart City Context)Week # 4 - 5: Group Project Model Analysis # 1 – Oral Presentations Design and Presentation (25%)Week # 6 – 7: Group Project Model Analysis # 2: Community Website Design Project – WebsiteDesign and Usability (50%)o Smart City Prototype using Free Trial Autodesk Software (20%)o Use of Concept Mapping / Sketch boarding Software to Explain the Layout of Fukushima Smart City (10%)o Use of IoT technology for Smart City Planning (5%)o Contextualize the Information for Fukushima Smart City Planning Context (5%)o Technical Usability Presentation (10%)Notes: Minor alternations to the grading schema might be necessary based on immediate needs.","reference":"Selected Online References on Smart City (More references available on the course webpage):Social Usability and Smart City:https://www.igi-global.com/chapter/from-the-smart-city-to-the-people-friendly-city/130975https://intenseminimalism.com/2010/social-usability-checklist/Introducing Smart City:https://en.wikipedia.org/wiki/Smart_cityhttps://www.slideshare.net/gargmfp/smart-city-41833712Examples of Smart City Planning:https://www.wien.gv.at/stadtentwicklung/studien/pdf/b008403j.pdfhttp://smartcities.gov.in/upload/uploadfiles/files/Bhubaneshwar_WinningProposal.pdfSmart City Apps:http://www.smartappcity.com/en/"},{"title":"EL317 Patterns and language","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"ジョン　ブレイク","update":"2019/02/15","outline":"Language is permeated with patterns. In English, the letter q tends to be followed by the letter u. The word moon is almost always preceded by the word the. Passive voice is usually formed with the verb be and a past participle (e.g. was done). Students study the patterns in the words, grammar, meaning and functions in texts. Less obvious patterns can be discerned using specialist pattern-matching tools. This course enables students to investigate the relationship between patterns and language by exploring the vocabulary, grammar and structure of texts. Statistical tools and visualization tools are used to discover the less obvious patterns.","gradingMethod":"Active participation: 30%Quizzes: 30%Final exam: 40%","reference":"None"},{"title":"EL318 ICT in Education","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年 \n                  ,\n                  4年","credets":"2.0","instructor":"- -","update":"2019/02/14","outline":"This course will cover Information and Communications Technology (ICT) in Education particularly focusing on affordances offered by the technology. It will address the “what” and “how” of ICT in education, by providing students with theoretical and practical knowledge invaluable in the planning, implementation, and evaluation of ICT supported education. Students will learn about various affordances of educational technology, from current trends to future possibilities. Also, the course will help students develop awareness of the current advantages and limitations of ICT in the educational context. It will be of particular interest to students who are interested in becoming educators.","gradingMethod":"Online Reading Quizzes: 80%Project: Total 20%     • Project Outline: 5%     • Project Presentation (PowerPoint): 15%Notes:Late assignments will lose 10% per day.After 5 days, a late assignment will receive a mark of 0%.Not participating in class activities will result in -2%.Being late 3 times will be equivalent to 1 absence.Being more than 30 minutes late will equal 1 absence."},{"title":"EL321 Pronunciation: Acoustic Analysis Using Software","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"イアン　ウイルソン","update":"2019/08/09","outline":"In this course, open-source acoustic analysis software (\"Praat\") will be mastered so that students have skills to analyze speech/pronunciation beyond the classroom. Students will be taught about properties of the acoustic signal and they will be taught how to write Praat scripts to automate acoustic analysis. Students will sometimes be required to submit voice recordings demonstrating their pronunciation. This course provides basic phonetic knowledge that is necessary for work in fields such as speech recognition and speech synthesis.","gradingMethod":"Participation and quizzes:  20%Homework assignments:  20%Midterm exam:  30%Final exam:  30%"},{"title":"EL328 Logic and language","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"2.0","instructor":"ジョン　ブレイク","update":"2019/02/15","outline":"Newspaper articles, research articles and advertisements are written to persuade readers of something, such as the veracity of the story, the validity of the conclusions or the benefits of a product. This course aims to provide students with tools to evaluate such texts critically and not fall victim to persuasive arguments. Students are shown how to use logic to understand and evaluate written language.","gradingMethod":"Active participation: 30%Quizzes: 30%Final exam: 40%","reference":"None"},{"title":"EL329 Critical Thinking","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"ウイリアム　リングル","update":"2019/08/26","outline":"This course aims to provide students with the cognitive tools to distinguish between statements of fact and opinion, between strong and weak logical arguments, and to identify how emotions and cultural values can influence the ways in which arguments are constructed, expressed, and understood.","gradingMethod":"Active participation: 30%Quizzes: 30%Final exam: 40%","reference":"None"}],[{"title":"EG101 Global Experience Gateway (RHIT)","semester":"2019年度／Academic Year\n            　4学期集中\n              ／4thQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年","credets":"2.0","instructor":"金子　恵美子","update":"2019/02/14","outline":"All students wishing to participate in two short-term overseas programs (Rose-Hulman Institute of Technology student exchange in USA and Waikato Pathways culture enrichment program in New Zealand) will take this course in preparation for such programs. Students are required to take this elective course to participate in these overseas programs. The course will prepare students by offering language and cultural preparation for overseas travel and overseas life and introduction to interview video production.","gradingMethod":"In-class participation 10% (includes pre- and post-program English language proficiency testing to determine progress)Interview video 1 30%Interview video 2 30%Blog 30% The scores of the speaking tests will be taken into consideration as extra points.","reference":"The course instructor, Emiko Kaneko, worked in Gakken School Management as an English instructor and an academic administrator. She was also in charge of the development and the quality maintenance of English speaking tests in ALC press."},{"title":"EG102 Global Experience Gateway (Waikato)","semester":"2019年度／Academic Year\n            　4学期集中\n              ／4thQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年","credets":"2.0","instructor":"金子　恵美子","update":"2019/02/14","outline":"All students wishing to participate in two short-term overseas programs (Rose-Hulman Institute of Technology student exchange in USA and Waikato Pathways culture enrichment program in New Zealand) will take this course in preparation for such programs. Students are required to take this elective course to participate in these overseas programs. The course will prepare students by offering language and cultural preparation for overseas travel and overseas life and introduction to interview video production.","gradingMethod":"In-class participation 10% (includes pre- and post-program English language proficiency testing to determine progress)Interview video 1 30%Interview video 2 30%Blog 30% The scores of the speaking tests will be taken into consideration as extra points.","reference":"The course instructor, Emiko Kaneko, worked in Gakken School Management as an English instructor and an academic administrator. She was also in charge of the development and the quality maintenance of English speaking tests in ALC press."}],[{"title":"JP01 初級日本語 I [留学生対象]","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年","credets":"1.0","instructor":"草刈　明美","update":"2019/02/27","outline":"このコースは初めて日本語を学ぶ人のためのコースです。学生は、基本的な四技能（聞く、話す、読む、書く）全てを使って日本語の勉強をし、四技能全てを伸ばすことを目的としています。This is a course for beginners in the study of the Japanese language. Students will learn Japanese with a comprehensive approach that aims to developing the linguistic competence of overall Japanese to finding four basic language abilities (listening, speaking, reading and writing).","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%期末試験（Final Examination）40%","reference":"なし None"},{"title":"JP02 初級日本語 II [留学生対象]","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年","credets":"1.0","instructor":"草刈　明美","update":"2019/02/27","outline":"学生は、基本的な四技能（聞く、話す、読む、書く）全てを使って日本語の勉強をし、四技能全てを伸ばすことを目的としています。Students will learn Japanese with a comprehensive approach that aims to developing the linguistic competence of overall Japanese to finding four basic language abilities (listening, speaking, reading and writing).","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%期末試験（Final Examination）40%","reference":"なしNone"},{"title":"JP03 中級日本語 I [留学生対象]","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"1年","credets":"1.0","instructor":"草刈　明美","update":"2019/02/27","outline":"学生は、基本的な四技能（聞く、話す、読む、書く）全てを使って日本語の勉強をし、四技能全てを伸ばすことを目的としています。This course aims to encourage students to learn Japanese with four basic comprehensive abilities (listening, speaking, reading and writing) and develop all these abilities.","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%期末試験（Final Examination）40%","reference":"なしNone"},{"title":"JP04 中級日本語 II [留学生対象]","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"1年","credets":"1.0","instructor":"草刈　明美","update":"2019/02/27","outline":"学生は、基本的な四技能（聞く、話す、読む、書く）全てを使って日本語の勉強をし、四技能全てを伸ばすことを目的としています。This course aims to encourage students to learn Japanese with four basic comprehensive abilities (listening, speaking, reading and writing) and develop all these abilities.","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%期末試験（Final Examination）40%","reference":"なしNone"},{"title":"JP05 上級日本語 I [留学生対象]","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"2.0","instructor":"草刈　明美","update":"2019/02/27","outline":"基本的な四技能（聞く、話す、読む、書く）全てを使って日本語の勉強をし、四技能全てを伸ばすことを目的としています。This course aims to encourage students to learn Japanese with four basic comprehensive abilities (listening, speaking, reading and writing) and develop all these abilities.","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%期末試験（Final Examination）40%","reference":"なしNone"},{"title":"JP06 上級日本語 II [留学生対象]","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"2年","credets":"2.0","instructor":"草刈　明美","update":"2019/02/27","outline":"基本的な四技能（聞く、話す、読む、書く）全てを使って日本語の勉強をし、四技能全てを伸ばすことを目的としています。This course aims to encourage students to learn Japanese with four basic comprehensive abilities (listening, speaking, reading and writing) and develop all these abilities.","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%期末試験（Final Examination）40%","reference":"なしNone"},{"title":"JP07 ビジネス日本語 [留学生対象]","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"草刈　明美","update":"2019/02/27","outline":"このコースは、日本でインターンシップをしたい学生や日本企業に就職したい学生を対象に、ビジネス日本語やビジネスマナーを学習します。This is a course for international students who want to participate in internships in Japan or want to work at Japanese companies in the future. The students will learn both Business-Japanese and Business manner.","gradingMethod":"宿題（Assignments）30%中間試験（Midterm Examination）30%発表（Presentation）40%","reference":"日本企業への就職　ビジネス会話トレーニング（アスク出版）にほんで働く！ビジネス日本語30時間（スリーエーネットワーク）"}],[{"title":"MA01 線形代数 I","semester":"2019年度／Academic Year\n            　1学期・2学期\n              ／1st & 2nd Quarter","corseFor":"1年","credets":"2.0","instructor":"前田　多可雄, 浅井　和人, 渡部　繁, コン　タン　チョオン, 蘇　春華","update":"2019/01/16","outline":"(ICTGクラスはQ3に開講し、担当は浅井和人先生コンタンチョオン先生です。)理工系大学の基礎課程における数学は、線型代数と微積分の二コースについて学習するのが通例となっている。本講義では、線型代数の前半部分を学習する。もう一方の柱である微積分とともに履修することが求められる。線型代数の理解なくして微積分の理解はありえないし、その逆もありえないからである。線型代数は、和とスカラー倍によって不変な対象を調べる分野であって、高校では、ベクトルとしてすでに現れている。歴史的には、連立一次方程式の解法を源泉としているが、中心テーマである行列の固有値問題は、連立線型微分方程式の理論に始まる。この講義では、固有値問題を考える上で必要となる最小限の概念と、計算技術の習得とを目標にする。受身になりがちな講義と並行して、学生の主体的学習の場として演習も行う。学生諸君の積極的参加を期待する。線型代数が扱うテーマは、コンピュータ理工学のあらゆる分野に現れる。グラフィックスひとつにしても、その数理を理解する上で、線型代数は欠くことができない。確かに、数学はそれ自身のために発展してきたという側面がある。しかし、工学や物理学等からの要請から生まれ、または発展してきたという側面もある。コンピュータ理工学を学ぼうとする諸君が、数学をここで学ぶのはそのためである。","gradingMethod":"浅井クラスレポート課題8割以上の提出の前提の下で、期末試験100%で評価する。渡部クラス期末試験 100%前田クラス毎回の小テスト（クイズ）10%、 一つの演習時間に実施する中間試験30%、 期末試験60%"},{"title":"MA02 線形代数 II","semester":"2019年度／Academic Year\n            　3学期・4学期\n              ／3rd & 4th Quarter","corseFor":"1年","credets":"2.0","instructor":"前田　多可雄, 渡部　繁, 渡邊　曜大, 松本　和也, ローター　シュミット","update":"2019/01/16","outline":"ICTGクラスはQ1に開講し、担当はシュミット先生です。線型代数 I の続きとして、固有値問題を扱う。前期と同様に、微積分とともに履修することが求められるが、その理由は I に述べた通りである。たとえば、多変数関数の微積分において、行列や行列式が決定的な役割を果たす様を見ることになる。また、固有値問題は、数列の漸化式を解く有力な方法を提供する。線型代数と微積分とを有機的に結び付けて理解しておくことがいかに重要であるか、痛感することになるだろう。また、電磁気学で必要不可欠なベクトル解析の下地もここで養われる。その他、演習も含め基本的方針は、線型代数 I と変わるところはない。","gradingMethod":"渡部クラス期末試験 100%前田クラス毎回の小テスト（クイズ）10%、 一つの演習時間に実施する中間試験30%、 期末試験60%"},{"title":"MA03 微積分 I","semester":"2019年度／Academic Year\n            　1学期・2学期\n              ／1st & 2nd Quarter","corseFor":"1年","credets":"2.0","instructor":"木原　浩, 小川　佳子, 浅井　信吉, 李　鵬","update":"2019/03/10","outline":"(ICTGクラスはQ4に開講し、担当は李　鵬先生です。)本講義では、微積分の前半部分を学習する。もう一方の柱である線型代数と並行して履修することになるが、線型代数の理解なくして微積分の理解はありえない し、その逆もありえないからである。また物理では、早々に微積分が必要となり、さらにはベクトルに対する微積分まで登場する。これらを学習するためにも、 なるべく早い時期に、二つの基礎数学に接し、双方を有機的に結び付けて理解しておくことは重要である。微積 分は、図形の面積、曲線への接線等の問題を出発点とし、ニュートンによる力学的考察に基づいて一定の基礎が築かれた。極限の概念がその根底にあるのは、い うまでもないことである。その後も、先人達によって整備された微積分は、その扱われ方の違いから、一変数と多変数のふたつにわけられる。本講義では、この うち一変数の微積分を扱う。基本的な計算技術に関しては、高校で学ぶ事柄と大差はなく、扱う関数の範囲を若干ひろげるだけのことである。異なるのは、極限 概念の取り扱いであるが、厳密な議論を行うには無理な点があるので、全面的な導入はしない。受身になりがちな講義と並行して、学生の主体的学習の場として 演習も行う。学生諸君の積極的参加を期待する。","gradingMethod":"期末テスト:レポート= 8:2","reference":"授業で指示する"},{"title":"MA04 微積分 II","semester":"2019年度／Academic Year\n            　3学期・4学期\n              ／3rd & 4th Quarter","corseFor":"1年","credets":"2.0","instructor":"木原　浩, 三瓶　岳昭, 土屋　貴裕, 渡邊　曜大, 大藤　建太, 李 想","update":"2019/03/08","outline":"(ICTGクラスはQ2に開講し、担当はLi. X.先生です。)微積分Iに引続き、多変数関数の微積分を扱う。一変数のときと比べて、趣が異なるけれども、実際の計算は、一変数の場合に帰着してしまう。従って、授業を 大事にして基本さえおさえておけば、何ら恐れることはない。なお、基本的方針は、微積分 I と変わるところはない。また、線型代数 II の項も参照されたい。","gradingMethod":"期末テスト:レポート= 8:2","reference":"授業で指示する"},{"title":"MA05 フーリエ解析","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"前田　多可雄, 土屋　貴裕, 李 想, 森　和好","update":"2019/03/05","outline":"(ICTGクラスはQ3に開講し、担当はLi, X.先生です。)フーリエ解析は19世紀初頭のフーリエによる熱方程式（微分方程式）の研究を起源としている。そのアイディアは「三角関数をうまく用いて任意の関数を表そう」というものであった。この考え方は応用において多くの有用な結論を導いたが、収束概念等が整備されていなかった当時としては、その結論が数学的に正当化されるか否かは不明であった。現在においては通常の理工学応用に関する部分では数学的にきちんとした理論の整備がなされている。フーリエ解析にはフーリエの時代からの応用（微分方程式に関する処理）に加え現代的な応用たとえば、画像情報や音声情報等に関する信号処理において必須の基礎理論としての地位があたえられている。本講義では数学的な論証の細部には立ち入ることはできないが、与えられた関数を三角関数や指数関数を用いて取り扱うテクニックを習得してもらう。演習問題への解答等を通し、フーリエ解析の基本的な定理の使い方および付随する計算に習熟してもらう。","gradingMethod":"基本的には期末試験の成績をもとに評点を付ける。ただし、小テスト及び演習毎のレポートの状況を最終評点加点することがある。","reference":"トランスナショナルカレッジオブレックス編「フーリエの冒険」,ヒッポファミリークラブ金谷健一著「これならわかる応用数学教室」,共立出版"},{"title":"MA06 複素関数論","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"2年","credets":"2.0","instructor":"杉山　雅英, 浅井　和人, 李 想","update":"2019/02/07","outline":"複素関数とは，広い意味では複素数から複素数への写像，すなわち複素変数複素数値関数であるが，通常複素関数論と言えば， さらに解析性と呼ばれる性質をもつ関数を扱う． 解析性とは，局所的に（十分小さい円の内部で）収束するべき級数で展開されるという性質であり， それはまたそこにおいて関数が正則（複素変数として微分可能）ということと同値となる．本講では，まず複素関数を導入した後，その正則性とCauchy--Riemannの関係式を学ぶ．次に複素平面上の曲線に沿った 複素積分を定義した上で，Cauchyの積分定理，積分公式などを導く． さらにその応用としてTaylor展開および Laurent展開を得る． 前者はべき級数による関数の展開であって，複素関数論におけるもっとも基本的な結果である． 後者は特異点や留数定理の研究に応用される．また，最大値の原理, 微分方程式のべき級数による解法， Roucheの定理による零点の個数計算など，直接応用に役立つ事柄も数多く導かれる．この理論を学ぶとき，必要な定理が次から次へと自然に導かれていくことに感銘を受けるだろう．それゆえ複素関数論は， 数学のなかでも美しい体系を持っていると言われる．その中でも最も印象に深いことは， 解析性をもつ関数は，極めて小さい領域における振る舞いによって，全領域での振る舞いが決まってしまうという事実である． このことは，あらゆる生物が1つの細胞から全体を復元できることと似ている．解析性という性質は，私たちが一般に実関数としてなじみの深い関数: 多項式，有理関数，指数関数，対数関数，三角関数，およびそれらを組合せて得られるものすべてが持っている性質である． それゆえ複素関数論は，種々の分野において容易に応用されるという特徴を持つ． 電磁気学，流体力学，熱伝導論や，コンピュータサイエンスにおけるシステム理論，信号処理等，さまざまな応用分野において， 複素関数論の素養は極めて重要な要件と言える．","gradingMethod":"杉山クラス：第1講で学生と相談して決める（昨年度は中間試験，期末試験，クイズ，宿題を 3:4:1:2 で評価）浅井クラス：レポート課題8割以上の提出の前提の下で，期末試験100%で評価する．（期末試験は125点満点程度とし，試験の得点 p に対して，原則として s=80+(p-80)/2 (p>80), s=p (p≦80) で成績sを算出する）李クラス：ホームワーク26%，（2 x 13 回，出席は2/3以上），期末試験74%．","reference":"杉山クラスの授業用ホームページ: http://web-int.u-aizu.ac.jp/~sugiyama/Lecture/CA/2018/welcome.html浅井クラスの授業用ディレクトリ: ~k-asai/classes/holm/浅井クラスのハンドアウトと演習問題: http://web-ext.u-aizu.ac.jp/~k-asai/classes/class-texts.html 李クラスの講義ノートと演習問題: https://github.com/uoaworks/complex-analysis"},{"title":"MA07 確率統計学","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"土屋　貴裕, 蘇　春華, イゴール　ルバシェフスキー","update":"2019/01/16","outline":"(Prof. Lubashevskiy, I. is in charge of ICTG class.)Probability and Statistics is the most useful area in mathematics. We present an introduction to Probability and Statistics for 2nd year students.","gradingMethod":"Test 80 and reports 20","reference":"An Introductiion to Probability Theory and its Application, Vol 1Tokeigaku Nyumon (Tokyo Univ Press)"},{"title":"MA08 応用代数","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"浅井　信吉, 李 想","update":"2019/08/09","outline":"本科目では代数的な演算を定義した種々の集合とその性質について学ぶ．定義される演算が満たす条件に応じて，それら集合は，群，環，体などと呼ばれる．代数的な演算を抽象的に取り扱うことで，これらの対象について一般的に論じられる性質を学ぶことができる．これは，コンピュータサイエンスの基礎として「アルゴリズムとデータ構造」や「離散系論」などを学ぶとき，様々な具体的な問題を抽象化してアルゴリズムや離散系として論ずるのと同様である．一見すると形式的な抽象理論のように感じらるが，実際には整数，実数や行列などの具体的な集合の持つ共通な代数的な性質の一般化である．それらの議論の応用として，符号理論，公開鍵暗号や乱数生成などの実際的な問題について学ぶ．講義では定理の証明をなるべく分かりやすく述べると共に，定理の持つ意味やその応用を述べる．また抽象的に考える力，演繹する思考法を学ぶ．理解を助け深めるため，例題（計算問題，証明問題）及び課題（宿題）などを課す．講義内容の確認のためのクイズ，小テストを適宜実施する．","gradingMethod":"中間試験，期末試験，クイズ，宿題を 3 : 4 : 1 : 2 で評価．","reference":"N.浅井クラスの授業用ホームページ: http://hare.u-aizu.ac.jp/AppA/2019S.丁 クラスの授業用ホームページは授業で周知されますN. 浅井の実務経験について\t1997-2000 （株）ウェーブフロント　研究員\t2002-2003　国立環境研究所　客員研究員\t2001-2010 旭硝子（株）との共同研究ウェーブフロント（株）において、また、会津大においても旭硝子(AGC)社との共同研究において、数値シミュレーション、モデリング、ハイパフォーマンスコンピューティングに関する研究、開発を行ってきた。特にモデリングは代数学の抽象化そのものであり、ハイパフォーマンスコンピューティングにも直結する。授業形態：講義,演習"},{"title":"MA09 数理論理学","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"ローター　シュミット","update":"2019/03/01","outline":"The course has three parts:(1) Review of Boolean Logic and Propositional Logic.=============================================Review to bring students with different prerequisites to the same level. Topics discussed include:Mathematical propositions and propositional logic (truth values in {0,1}); Set theory; Boolean algebras as generalizing principle of the latter two subjects; Stone's Theorem.Some computer applications of the material is discussed as well.(2) Fuzzy Sets and Applications.===========================Here the structure of (1) is generalized to truth values in the full interval [0,1] in IR. This allows to define fuzzy subsets of a given set, the embedding of regular sets into the set of fuzzy subsets. A special case of fuzzy subsets are fuzzy relations. The main application of this chapter is the rigorous development of the Tamura classification method based upon a given fuzzy relation. An indication how to use this method in image reconstruction is given.See: http://ieeexplore.ieee.org/xpl/freeabs_all.jsp?arnumber=5408605(3) Model Theory.=================In mathematics, model theory is the study of (classes of) mathematical structures (e.g., groups, fields, graphs, universes of set theory) using tools from mathematical logic. A theory is built which allows to say in a proper calculus: One can verify a formula or theorem in any set interpretation, if and only if one can find a formal proof of that formula or theorem by means of strict textual manipulations according to a fixed set of proof-rules without referring to special properties of any example. This is known as Goedel's completeness theorem.","gradingMethod":"Required for admission to final exam: [a] sufficient attendance (2/3), and [b] participation in online quizzes (2/3, this is for training only). The final exam determines the grade.","reference":"Online Lecture Notes (email L@LMSchmitt.de for the link)."},{"title":"MA10 位相幾何学概論","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"高橋　成雄","update":"2019/08/16","outline":"現代数学の基礎となす位相幾何学(トポロジー)の諸概念とその応用について講究する．「やわらかい幾何学」と形容される位相幾何学においては，２つのかたちの間をつながりを保持したまま変形できる場合，同じものとみなすことができる．この考え方は，かたちの大局的に特徴づける新たな方法を提供し，近年までのコンピュータ理工学の発展にも大きく寄与している．具体的には，グラフ，曲面などの記述方法の基礎から，データ解析における最先端の特徴抽出技法まで含まれる．本授業においては，そのような位相幾何学において重要な，かたちを分類するためのさまざまな概念を，１，２次元のかたちを具体的な事例を用いて学習する．","gradingMethod":"期末試験(50％)，授業中のクイズ(25％)，演習レポート(25%)授業前に前回のレポートを提出のこと期末試験を受験された方のみが単位認定対象です．期末試験の受験には，規定の授業出席回数(2/3以上)が必要です．不正行為(クイズやレポートの代筆含む)には厳正に対処します．(期末試験の再試験は欠席のガイドラインにそって対応します．)","reference":"小宮克弘著 「位相幾何入門」裳華房川久保勝夫著 「トポロジーの発想」講談社Stephen Barr 「Experiments in Topology」 Dover Publications, INC"},{"title":"MA11 応用幾何とトポロジー","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"2.0","instructor":"ローター　シュミット","update":"2019/03/01","outline":"We study the ideas of topology from the application perspective of analysis. For this purpose, the definition of the real numbers IR is reviewed and it is shown how the sup-axiom in IR relates to the existence of limits. In the major part of the course, the relationship between(1) limits in IR^n(2) the canonical topology in IR^n(3) continuous functions is discussed. The relationship between these structures is studied extensively. As an application, we show, e.g., that compactness and associated uniform continuity are the ingredients which make integration work.The second major part of this course introduces a rigorous treatment of the concept of continuous deformation (homotopy) and the fundamental groups which one can construct using homotopy equivalence classes of continuous functions on a set with a given topology. As an application we show the fundamental theorem of algebra at the end of the course.","gradingMethod":"Required for admission to final exam: [a] sufficient attendance (2/3), and [b] participation in online quizzes (2/3, this is for training only). The final exam determines the grade only.","reference":"Lecture Notes can be obtained from L.M.Schmitt on CD. (email: L@LMSchmitt.de)"}],[{"title":"NS01 力学","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"1年","credets":"2.0","instructor":"本間　道雄, 藤津　明, 山上　雅之, 三瓶　岳昭, ハミード　サジ","update":"2019/03/06","outline":"(ICTGクラスはQ4に開講し、担当はサジ先生です。)物理学はあらゆる自然科学の基礎であるが、力学はさらに物理学のなかで基本となる分野である。そのなかで現れる、質量、保存量、エネルギー、ポテンシャルといった概念は、物理はもちろんコンピューター科学を含む他の理工学分野でもその形を変えて現れるものである。講義では高校の物理とオーバーラップさせながら、ニュートン力学を質点の運動を中心に具体例に沿いながら進める。また演習ではパソコンを使って物体の運動を具体的にシミュレーションする。","gradingMethod":"中間試験（４5％）、学期末試験（45％）、演習発表およびレポート（１0％）"},{"title":"NS02 電磁気学","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年","credets":"2.0","instructor":"本間　道雄, 藤津　明, 山上　雅之, マキシム　リズィー, 渡邊　曜大, 久田　泰広","update":"2019/03/06","outline":"(ICTGクラスはQ2に開講し、担当はリズィー先生です。)電磁気学で特徴的な、そして新しい概念は、電場、磁場といった「場」の考え方である。これは力学では現れなかった考え方であるが、いっぽうこれは現代物理のすべてに共通な考え方でもあり、物事の作用がこうした「場」を通しておこなわれることを学ぶことが大事な点である。","gradingMethod":"中間試験(４５％）、学期末試験（４５％）、演習発表およびレポート（１0％）","reference":"「電磁気学」大林康二著 共立出版"},{"title":"NS03 量子力学","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"本間　道雄, ハミード　サジ","update":"2019/02/15","outline":"(ICTGクラスはQ4に開講し、担当はサジ先生です。)量子力学は電子や原子の運動を扱う分野で、その現象を日常レベルでは見られないこと、またその内容自体も古典力学とは全く異なっていることから、初学者にはなじみにくい。講義は、量子力学の最も基本的な題材である井戸型ポテンシャルを中心にすすめる。","gradingMethod":"中間試験（５０％）、学期末試験（５０％）","reference":"「量子力学と私」のなかの「光子の裁判」 朝永振一郎著, 岩波文庫"},{"title":"NS04 半導体デバイス","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"2.0","instructor":"束原　恒夫, 富岡　洋一, マキシム　リズィー","update":"2019/08/09","outline":"現代のICT社会は半導体デバイスなしには成立し得ないといえる。半導体デバイスは、ネットワークを支えるサーバー、通信網、そして身近なPC、家電製品、近年は自動車をはじめとする機械類の制御などに導入されている。そして、いまや我々の生活基盤にしっかりと根をはり、そこに半導体デバイスが使われていることすら気がつかない空気のような存在となり、我々の生活スタイルをも短期間に激変させてきた。MOS構造やデバイスに関連した半導体技術を中心に、この半導体デバイスとは何であるか、どんな原理で機能を実現しているのか、どんな分野に利用されているのか、そしてどんな未来があるのかを理解する。","gradingMethod":"小テスト 25%中間試験 30%期末試験 45%を目安に評価する。別途、講義への参加度(質問)なども評価する。","reference":"実務経験あり(束原):NTT 研究所に 25 年間勤務し、通信システム用の半導体集積回路・LSI の研究開発に従事してきた。この経験をもとに、半導体デバイスの基礎について教授する。担当教員により、それぞれ、webサイトを準備する。甲南大物理学科教材（動画付き、わかりやすい）http://kccn.konan-u.ac.jp/physics/semiconductor/top_frame.html製造方法／工程についてhttp://japan.renesas.com/company_info/fab/index.jsphttp://www1.ocn.ne.jp/~raichi参考書や解説サイトは数多く存在するので書店・ネットなどで自分にあったものを探してみるとよい。授業形態：講義"},{"title":"NS05 熱・統計力学","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"2年","credets":"2.0","instructor":"小川　佳子, イゴール　ルバシェフスキー","update":"2019/02/15","outline":"The course deals with thermodynamics and statistical thermodynamics. The special focus is placed on entropy.The aim of this course is to help students acquire an understanding of the macro- and micro- physics.","gradingMethod":"Your final grade will be calculated according to the following process: Mid-term Examination (40%), term-end Examination (60%), and a fraction of short reports."}],[{"title":"LI01 コンピュータリテラシー","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"1年","credets":"4.0","instructor":"平田　成, 中村　章人, 松本　和也, 本田　親寿, 藤津　明, 程　同軍, 黒川　弘国","update":"2019/08/09","outline":"(ICTGクラスはQ3に開講し、担当は程同軍先生です。)会津大学では、演習室他の教室でネットワークに接続されたUNIXベースのコンピュータ環境を提供しており、多くの講義がこの環境の利用を前提とした内容を持っている。本科目では、まず会津大学のコンピュータ環境の利用方法を学び、そこを足がかりとしてより一般的なコンピュータ、ネットワークの各種機能の利用方法、文書作成と管理の方法、ネットワークを介したコミュニケーションの原則とマナー、プログラミング及びデータ処理のための各種ツールの使用方法について学ぶ。以上は大学を卒業したのちの職業人、研究者としての基礎的な知識となる。","gradingMethod":"講義・演習回ごとに課題を課す。課題の一部は授業中に口頭採点を実施する。課題は一つあたり10点満点で評価し、100点満点の期末試験の結果と合わせて最終的な評価を行う。なお、課題提出その他の方法により講義と演習の出欠を確認する。","reference":"http://web-int.u-aizu.ac.jp/course/literacy/実務経験有り（平田成、科目コーディネーター）：NASDA（現JAXA）他の研究員、会津大学教員として、20年以上にわたりUNIXベースのコンピュータ環境での実務を行ってきた。この経験をもとに、会津大学のコンピュータ環境の利用方法および基本的なコンピュータに関するリテラシーの教育を行う。授業形態：講義,演習"},{"title":"LI03 コンピュータ理工学のすすめ","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"1年","credets":"2.0","instructor":"岡　嶐一, 程　子学, 宮崎　敏明","update":"2019/06/05","outline":"(ICTGクラスはQ3に開講し、担当は程先生他です。)この講義では、主に新入生に対して、コンピュータについて、さまざまな分野の専門家によるさまざまな観点からの話を提供し、コンピュータ理工学の学問分野の内容と、コンピュータ理工学を学ぶ意義を理解し、コンピュータがあまねく社会に使われている時代に、社会がコンピュータに何を期待しているか、コンピュータがもたらす社会へのリスク等、コンピュータ理工学に期待されていることを多方面から学び、今後の進路設計に役立たせる。他の多くの科目と異なり、本講義ではさまざまな分野の専門家に講義をしていただく。具体的には、学長や学部長、各フィールドの責任教授の他に、外部の専門家の話を伺う機会も設ける。","gradingMethod":"出席点60%、レポート40%"},{"title":"LI04 コンピュータシステム概論","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年","credets":"2.0","instructor":"大津山　公平, 奥山　祐市, 宮崎　敏明, ベン　アブダラ　アブデラゼク","update":"2019/02/15","outline":"コンピュータ理工学を専門として学び始めたみなさんは、「コンピュータ理工学とは、プログラミング、シェルコマンドによる処理、Webブラウジング、といったものである」、と取り違えてしまう傾向があります。しかし、コンピュータ理工学とはそれ以上に幅広く、深い学問です。大学における学習を効率的に進めるためには、みなさんが早い段階でこれから何を学ぶのかを知り、コンピュータ理工学のトピックに幅広く触れておく必要があります。そのようなトピックを紹介するのが、この授業です。","gradingMethod":"以下の３項目により評価します。・授業中のクイズ 20%・中間試験 30%・期末試験 50%クイズは出席確認も兼ねており、授業数の２／３以上の出席がないと学務規定により期末試験を受ける事ができません。"},{"title":"LI06 情報セキュリティ","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年","credets":"2.0","instructor":"渡邊　曜大, 中村　章人, 蘇　春華","update":"2019/08/09","outline":"(ICTGクラスはQ1に開講し、担当は蘇　春華先生です。)現在のコンピューティング環境は、スマートフォン、ポータブルPC、デスクトップPC、サーバ、IoT機器、クラウド上の仮想マシンなど、様々な種類のエンドポイントから構成されている。これらの機能と性能を発揮し、事故や攻撃を防ぐためには、情報セキュリティとシステム管理の技術が必要不可欠である。　この講義では、情報セキュリティの基本的な概念および技術を学習する。また、最新の技術やツールを紹介するとともに、時事評論を行う。","gradingMethod":"期末試験: 100%任意提出レポート: 加点式"},{"title":"LI07 情報と職業","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"4年","credets":"2.0","instructor":"石橋　史朗, 苅間澤　勇人","update":"2019/08/09","outline":"情報の教員免許を取得するのに必要な科目である。情報社会における職業について，社会的視点と個人的視点から検討する。","gradingMethod":"2名の講師からそれぞれにレポートが課され，それを評価する。","reference":"実務経験あり（石橋）：富士通株式会社に26年間勤務し、システム開発やビジネス推進活動に従事してきた。この経験をもとに、情報産業における職業について教授する。実務経験あり（苅間澤）：高等学校教諭として28年勤務し，高等学校専修免許（情報）を有し，2003～2005年まで「情報」の授業を行った。また，キャリアカウンセラーの資格を有し，高校生の進路指導を行った。これらの経験をもとに，情報社会における職業について教授する。授業形態：講義"},{"title":"LI08 情報倫理","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"1年","credets":"2.0","instructor":"清野　正哉, 小山　清美","update":"2019/02/12","outline":"(ICTG class starts in Q3.And Prof. Koyama, K. is in charge of the class.)In this course, lectures and discussions will be conducted through presentation of specific solutions and problem-solving thought processes for problems which have occurred or are expected to occur in the digital network information society from the perspective of computer ethics. In conducting this course, education from a practical perspective and case studies will be emphasized through the introduction of special lectures given by faculty members and professionals who are actually playing active roles in the field of computer ethics. In addition, general knowledge as well as legal knowledge related to information will be incorporated into the course content. Therefore, students of the University of Aizu will be strongly encouraged to take this course as the field of computer ethics is an area indispensable for the information-based society in the future.","gradingMethod":"Student attitudes in class (class attendance, etc.)10%, Final examination90%etc."},{"title":"LI09 システム開発とプロジェクトマネジメントの基礎","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"4年","credets":"2.0","instructor":"岩瀬　次郎","update":"2019/08/09","outline":"利用者の求めるITシステムはどのように構築したらよいのか、一定の期間で、与えられた費用で計画通りに開発するために必要な技術は何か。当講義ではグローバルIT企業で実践されているシステム開発とプロジェクトマネジメント技術の基本を学習する。IT業界のビジネス環境と技術の動向、ITエンジニアに必要なスキルとキャリアも学習し、IT関連産業を目指す学生にその指針を提供する。グローバル化の進む日本のプロジェクトの実態とITエンジニアに求められる資質（コンピテンシー）についても紹介する。授業は講義が中心であるがテーマにより演習や課題レポートを果たす。","gradingMethod":"・筆記試験（選択式、記述式）1回, 課題レポート４題（期限1週間）、出席率（含む参加態度）により総合的に評価。評価配分の目安：最終試験50%, 課題40%, 演習10%・出席が規定の条件を満たさない者は評価しない。・課題レポート提出が遅れた場合遅れ度合いによって減点とする。・私語等の受講態度不良の場合は減点とする。・遅刻と途中退室の場合は出席とみなさない。","reference":"実務経験有り（岩瀬）：日本IBMに27年勤務し、銀行等多くのシステム開発、システム開発標準、品質管理、プロジェクト管理に従事。この経験をもとに、システム開発とプロジェクトマネジメントの基礎を教授する。企業(IBM、デロイト)より3名の技術者を外部講師としても招く。参考図書：「ソフトウェアエンジニアリング講座１，２「ソフトウェアエンジニアリング講座１，２」（岩瀬、内藤他著 日経BP社）　授業形態：講義"},{"title":"LI10 マルチメディアシステム概論","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"2年","credets":"2.0","instructor":"高橋　成雄, ジュリアン　ヴィジェガス","update":"2019/08/09","outline":"(ICTGクラスはQ4に開講し、担当はヴィジェガス先生です。)高度情報化社会と呼ばれる昨今において，我々は対話的なテキスト音楽や映像などディジタルメディアの恩恵に大きく依存している．さらにこのようなメディアは，インターネットを介した放送，携帯端末間のコミュニケーション，オンラインショッピングサービス，電子マネーなどにも深い関係をもつようになってきている．本科目は，種々のマルチメディア技術に支えられている我々のディジタルライフを理解することが目的である．そのために，マルチメディアの特徴や，その構成要素，関連する処理はコミュニケーション技術，さらにはマルチメディアシステムの期待される発展についても学習していく．さらに本科目を受講することで，ディジタル情報技術に関連するより専門的な科目を学習するための，有効な道標を得られる機会を提供していく．","gradingMethod":"期末試験(50％)，授業中のクイズ(50％)不正行為(クイズの代筆含む)には厳正に対処します．","reference":"入門マルチメディア CG-ARTS協会 編(ISBN-13: 978-4903474601, ISBN-10: 4903474601)Fundamentals of Multimedia, 2nd Edition (2014) by Ze-Nian Li, Mark S. Drew and Jiangchuan Liu.(ISBN: 978-3-319-05290-8,978-3-319-34678-6)Professor Takahashihttp://web-int.u-aizu.ac.jp/~shigeo/course/mms/Professor Villegashttp://onkyo.u-aizu.ac.jp/ims/Note: Professor Villegas has practical working experience. He worked for the Productivity National Center in Colombia and as a private consultant for five years. He was involved in the development of web-based industry productivity solutions. His experience is relevant for teaching an introductory course in Multimedia.授業形態：講義"},{"title":"LI11 コンピュータネットワーク概論","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"2.0","instructor":"程　子学, 荊　雷","update":"2019/02/15","outline":"コンピュータネットワーク概論はコンピュータネットワークについて学ぶ最初の科目です。本科目では現在、最も一般的なコンピュータ通信ネットワークであるインターネットを学習対象とし、コンピュータ通信ネットワークの設計と運用について解説を行います。本科目を受講することで、ネットワークアーキテクチャとプロトコルの基本原則、またいくつかのネットワークアルゴリズムとアプリケーションについて学習することが出来ます。","gradingMethod":"\t小テスト20％\t宿題：20％\tプロジェクト：20％、\t期末試験：40％"},{"title":"LI12 創造力開発スタジオ","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"吉岡　廉太郎, 川口　立喜","update":"2019/08/09","outline":"※この授業を履修したい学生は、まず「創造力実践プログラム履修希望申請フォーム」より申込みをする必要があります。便利で新しいものを生み出す力を創造力といいます。特に、独創的な発想や新しいアイデアを生み出すために欠かせない能力です。誰でも革新的な創造をする素質を持っていますが、創造力を発揮するには、創造が行われる手順（プロセス）や手法についての理解が欠かせません。また、創造活動の性質上、それらの理解だけでなく実践を通して創造の感覚を体感することが欠かせません。　この授業では、創造活動の初学者に対して、創造のプロセスを体験し、創造活動の性質を理解してもらうための講義と実践演習を行います。多様な価値観を意識しながらアイデアの発想と錬磨を体感するためにグループで学習します。実践演習では、実在する課題からテーマを選択し、グループごとに新しく有益な解決策・アイデアを提案します。　夏期休暇に実施する集中講義です。テーマによっては学外の施設に泊まり込んで合宿形式で実施することもあります。基本的には全日程の参加が必要です。また、場所やテーマによって履修できる人数が制限されることもあります。その際は、教員が関連科目の履修状況等を参考に履修者を選定しますのでご了承ください。なお、2019年度の開講時期は8月19日から8月23日頃で検討中ですが、テーマと合宿地を調整する中で変更になることもあります。6月頃に決定し受講者に連絡する予定です。","gradingMethod":"以下の項目で評価する1.\t各レビューでの発表40%2.\t成果物 40%3.\t活動への参加と貢献度等 20%※各学生の貢献度は活動への取り組み姿勢と各セッションのレビューの内容で確認する","reference":"http://www.u-aizu.ac.jp/enpit/実務経験有り：プロジェクト経験豊富な企業人と教員が共同で授業を行います。授業形態：講義,演習"},{"title":"LI13 コンピュータ理工学演習 I","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"2年","credets":"3.0","instructor":"北道　淳司, 本田　親寿, 束原　恒夫, 中島　有, 王　軍波, 大藤　建太, 荊　雷","update":"2019/08/09","outline":"実際の電気現象に触れる本学で最初の機会であり、学生によってはこれが最後の実験となる。抵抗計測、ハイパス・ローパスフィルタおよび共振回路を例にとって、電気回路の基礎と計測機器の取扱方法を学ぶ。最後に、コンピュータ論理演算の基礎となるディジタル信号がアナログ回路からどのように生み出されるかを体験する。","gradingMethod":"各単元レポート、クイズ、期末試験それぞれを、おおよそ４０％、１０％、５０％で合算する。実験は座席指定の２人１組で行い、１人ずつが単元ごとに実験レポートを提出する。オプション実験等でボーナス加算もある。レポートの期限を守れなかったものは減点される。時間外追加実験は、教員の許可のもとで行える。期末試験欠席、２単元以上のレポート未提出、履修規定にある出席数以上（１０週以上）に欠けた場合は、単位を与えられない。但し、欠席届が出されたうえで相応の理由と認められた場合は、授業実施時間の分母から該当週数を減じる。すなわち、履修規定で３分の１を超える欠席という規定の分母が１４週から該当週だけ差し引かれる。","reference":"・教科書正誤表・ハンドアウト等の資料（学内アクセスのみ）　http://web-int.u-aizu.ac.jp/course/csee1/index.html　・電気電子回路に関する有益なサイト（PDF入手可）：https://www.allaboutcircuits.com/textbook/・高校物理の参考書(1)\t新物理 物理基礎・物理 (チャート式・シリーズ)、数研出版、ISBN-13: 978-4410118425(2)\t視覚でとらえるフォトサイエンス 物理図録、数研出版、ISBN-13: 978-4410265136（ビジュアルでイメージがつかみ易い）【注】・実務経験あり（束原）：NTT研究所に25年間勤務し、通信システム用の半導体集積回路・LSIの研究開発に従事してきた。この経験をもとに、電気回路理論と実験の基礎について教授する。・実務経験あり（大藤）：民間の事業会社、およびシンクタンクで約10年間勤務し、エネルギー関連のフィールド技術およびそのデータ解析技法の研究開発等に従事。この経験をもとに、電気回路理論と実験の基礎について教授する。授業形態：演習"},{"title":"LI14 コンピュータ理工学演習 II","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"2年","credets":"3.0","instructor":"マイケル　コーエン, 程　同軍, 出村　裕英, 杉山　雅英, 黄　捷, 小川　佳子","update":"2019/10/15","outline":"理工系の基本ツールであるMathematica, MATLABの使い方を学び、データの定量的評価・統計的取扱・解析手法を身につける。それらを踏まえた技術レポートが書けるようになる。最後に、機械学習などを例に取って最新技術を体験する。","gradingMethod":"Quiz : Report = 4 : 6 の割合で合算する。演習で相談／役割分担は自由だが、クイズ／レポートは個人毎の提出とする。同じ結果でも考察は異なる筈（全く同じ内容の場合は不正コピーとみなす）。レポートの使用言語は日本語もしくは英語とする。PC等の持ち込みを認める。クイズ（前回内容理解度確認が初回と最終回を除いて12回、全範囲が最終回１回、計１３回実施）レポート（4単元分＋第５単元は実技その場評価）","reference":"実務経験有り：データ処理と解析、機械学習、技術レポート作成、など本科目で扱うトピックについて、担当教員の複数名が実務経験を持つ。（学内アクセスのみ）http://arashima.u-aizu.ac.jp/groups/alps_openwiki/wiki/65856/LI14II_AY2019.html授業形態：演習"}],[{"title":"PL01 プログラミング入門","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"1年","credets":"4.0","instructor":"久田　泰広, 大津山　公平, 出村　裕英, 平田　成, 中里　直人, 北里　宏平, 三瓶　岳昭, 大藤　建太, 王　軍波, エフゲニー　ピシキン","update":"2019/08/09","outline":"(ICTGクラスはQ4に開講し、担当はピシキン先生です。)Ｃ言語によるプログラミングは会津大のような情報系の学生に取って非常に重要なスキルであるにも関わらず、充分なスキルを持たないまま研究室に配属され、苦労する学生が多い。この理由として、Ｃ言語の範囲が広いため、充分な概念、スキルなどを得ないまま終了し、それが後に尾を引くことが一因として挙げられる。また、後続授業（アルゴリズムなど）の要求するプログラミングスキルがかなり高い事も一つの要因である。以上の理由により、プログラミングＣのイントロダクションという位置づけでプログラミング入門を開講し、Ｃ言語の内容を、プログラミング入門とプログラミングＣの２講義にてじっくりと講義する。このシラバスは我々教員と履修する学生のとの間の契約である。我々は履修生の下記項目の習得に責任を持つが、履修生は真摯に学ぶ態度を持って履修する事が要求される。また不正に対しては学則に則って極めて厳正な対処を行う。","gradingMethod":"以下の４項目による・クイズ（講義中に実施する小テスト）２０％・演習課題　３０％・期末試験　５０％クイズは出席確認も兼ねている。規定の出席数（２／３以上）に足りない者は放棄とみなす。期末試験を受けない場合も放棄となる。[履修上の留意点]この講義は全てのプログラミング授業の先駆けとなるものであり、全員の履修を希望する。履修にあたっては以下の事を厳重に守らなければならない。・授業・演習には遅刻・欠席しない事。全実施回数の１／３以上欠席した者は定期試験を受ける事が出来ない（つまり放棄となる）。遅刻に関してもしかるべきペナルティを与えるものとする。・演習課題・クイズ・定期試験などで不正行為（他者の課題のコピー、試験のカンニング等）を行った場合は、学則に従って前期履修科目全ての単位を没収する。演習課題は、演習時間内の口頭での採点と電子的に提出するものがある。口頭採点の締め切りは演習時間内、電子提出は、一部の問題の締め切りは演習時間終了時、それ以外は基本的に一週間が提出期限となる。なお、締め切りに遅刻した場合はシステム的に提出が出来なくなるので注意すること。但し忌引き、インフルエンザなどの罹患、プログラミングコンテストへの参加等教務委員会で授業の欠席が認可された場合などはその限りではないので教務に届け出た上で申し出る事。","reference":"学内ＷＳ以外の場合http://www.u-aizu.ac.jp/course/prog0/学内ＷＳでは以下を使用する事（より新しい情報や、成績情報等こちらのURLでしか見れない情報がある）file:///home/course/prog0/public_html/2019/welcome.html[実務経験]氏名：大津山公平職歴：富士通職務内容：超大型計算機の設計本コースとの関連性：　論理設計の傍ら、設計効率化ツールのプログラム作成を行っており、　その実務経験が本コースに生かされている。授業形態：講義,演習"},{"title":"PL02 プログラミングC","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"1年","credets":"4.0","instructor":"久田　泰広, 大津山　公平, 愼 重弼, 三瓶　岳昭, エフゲニー　ピシキン, 平田　成, 橋本　康弘","update":"2019/03/01","outline":"(ICTGクラスはQ1に開講し、担当はピシキン先生です。)Q2の「プログラミング入門」の講義を引き継いで、本講義は以下のような思想に基づいて構成されている。・卒業研究や、後続授業（アルゴリズムなど）などの要求するプログラミングスキルはかなり高いレベルであり、それに対応するスキルを身につける。・アルゴリズムに関するイントロダクションを行うことで、後続の授業への接続をスムーズにする。・より大規模なプログラム作成のスキルを身につける。このシラバスは我々教員と履修する学生のとの間の契約である。我々は履修生の下記項目の習得に責任を持つが、履修生は真摯に学ぶ態度を持って履修する事が要求される。","gradingMethod":"原則、以下の３項目による・クイズ（講義中に実施する小テスト）２０％・演習課題　３０％・期末試験　５０％クイズは出席確認も兼ねている。規定の出席数（２／３以上）に足りない者は放棄とみなす。期末試験を受けない場合も放棄となる。[履修上の留意点]　履修にあたっては以下の事を厳重に守らなければならない。・授業・演習には遅刻・欠席しない事。全実施回数の１／３以上欠席した者は定期試験を受ける事が出来ない（つまり放棄となる）。遅刻に関してもしかるべきペナルティを与えるものとする。・演習課題・クイズ・定期試験などで不正行為（他者の課題のコピー、クイズや試験のカンニング等）を行った場合は、学則に従って当該期履修科目全ての単位を没収する。演習課題は、演習時間内の口頭での採点と電子的に提出するものがあり、それぞれの問題に応じて締め切りが設定される。なお、電子的提出物の締め切りに遅れた場合はシステム的に提出が出来なくなるので注意すること。但し忌引き、インフルエンザなどの罹患、プログラミングコンテストへの参加等教務委員会で授業の欠席が認可された場合などはその限りではないので教務に届け出た上で申し出る事。","reference":"本コースのウェブページは以下の通りhttp://www.u-aizu.ac.jp/course/prog1/学内ＷＳでは以下を使用する事（より新しい情報や、成績情報等こちらのURLでしか見れない情報がある）file:///home/course/prog1/public_html/2019/welcome.html"},{"title":"PL03 プログラミングJAVA I","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"4.0","instructor":"ヴィタリー　クリュエフ, 黒川　弘国, 裴　岩, 程　同軍, 愼 重弼, モハメド　ハマダ","update":"2019/08/09","outline":"JavaおよびJava言語を利用したプログラミング技法は、現在のコンピュータ・プログラミング・トレンドの中でも優位に立っています。本科目の目標は、Javaを用いてオブジェクト指向プログラミングを勉強することです。他の科目との関連本科目は、プログラミング、ソフトウエア工学およびソフトウエア・アプリケーション設計のスペシャリストを目指す学生のための基礎科目です。本科目はまた、ハードウエア設計を志望する学生にも強く推奨されるものです。","gradingMethod":"最終成績は下記成績の重みづけ合計とします。演習課題・宿題 - 50%講義中のクイズ - 15%期末試験 - 35%","reference":"A course coordinator Prof. Vitaly Klyuev has practical working experience. He was working as a  Senior researcher in an international consortium of the INCO Copernicus Program of the Commission for European Communities, Brussels, Belgium. He was involved in the development of the distributed search system running on the Web. He has teaching experience of different courses related to programming for more than 30 years.The instructor Prof. Kurokawa has 12 years of industry career insoftware system development. All subjects of this course are basedon the experience.実務経験有り：ソフトウェアシステム開発実務経験あり（裴）：　東軟グループ(中国、CMMI5) 及びAlpine Electronics Europe D&R GmbH (ドイツ)に5年間勤務した。100万LOCレベルのソフトウェア開発のプロジェクトとチームを参加と監督し、核心的なアルゴリズムを設計し、そして産業特許を申請と獲得した。この経験に基づいて、アルゴリズム及び複雑度、プログラミング、ソフトウェア工学などについて教授する。コースWebページ 授業形態：講義,演習"},{"title":"PL04 プログラミングC++","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"3.0","instructor":"成瀬　継太郎, ピエール－アラン　ファヨール, イゴール　ルバシェフスキー","update":"2019/03/04","outline":"本講義は既にＣ言語を習得している学生を対象に、Ｃ＋＋言語の基礎を教えることを目的とする。Ｃ＋＋は１９８０年代中期にBell 研究所のBjarne Stroustrup により開発された、非常に強力なＣ言語の後継の言語である。具体的には、Ｃ＋＋はＣ言語にクラスの概念とユーザ定義型の機構を付け加え、クラスと継承、動的結合という機能により、オブジェクト指向プログラミングを実現している。","gradingMethod":"小テスト（クイズ）：２０％演習：５０％期末試験：３０％（詳細は、講義を担当する教員により変わる。）"},{"title":"PL05 コンピュータ言語論","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"4年","credets":"3.0","instructor":"鈴木　大郎, 中島　有","update":"2019/08/09","outline":"本科目はコンピュータ言語の代表であるプログラミング言語に焦点を当てる。プログラミング言語のパラダイム、モデル、技術要素などを説明することで、コンセプトやモデルなどの面よりプログラミング言語の本質について整理する。プログラミング・パラダイムと呼ばれるプログラミングに対するコンセプトについて述べ、各パラダイムの特徴について説明する。また、パラダイムを基準としてプログラミング言語を分類・整理し、同じパラダイムに基づくプログラミング言語に共通の機能について説明する。また、プログラミング言語の意味論についても説明する。本科目で取り上げるプログラミングパラダイムは、手続き型、関数型、論理型、オブジェクト指向型の４種類である。特に、他のプログラミング科目で学ぶC,C++,Javaの基礎となる手続き型とオブジェクト指向型パラダイムについて重点的に取り上げる。","gradingMethod":"演習     30%中間試験 30%期末試験 40%","reference":"David A. Watt. Programming Language Design Concepts. Wiley. 2004.Hanne Riis Nielson and‎ Flemming Nielson. Semantics with Applications: An Appetizer. Springer. 2007.Chris Hankin. Lambda calculi: a guide for computer scientists. Oxford University Press. 1994.横内寛文. プログラム意味論. 共立出版. 1994.五十嵐淳. プログラミング言語の基礎概念. サイエンス社. 2011.高橋正子. 計算論 計算可能性とラムダ計算. 近代科学社. 1991.実務経験有り(鈴木): 三菱電機東部コンピュータシステム(株)で、1987年から1990年まで、論理型とオブジェクト指向に基づくマルチパラダイム言語を用いた、Prolog推論マシン上のC、LISP言語処理系の開発に従事した。この経験をもとに、様々なプログラミングパラダイムに属するプログラミング言語の理論と実装について教授する。授業形態：講義,演習"},{"title":"PL06 プログラミングJAVA II","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"3.0","instructor":"黒川　弘国, 白　寅天","update":"2019/04/10","outline":"The Java Programming II is a course for the 3rd year students who had studied basics such as objects and classes, object oriented concept, exception handling, and I/O issues in Java. This course teaches some advance topics: annotation, reflection, threads, GUI, network programming, and Android programming including new features in Java.  In the first half of this course, we will study about topics related to Java language itself such as annotation, reflection, threads, GC, and GUI. In the second half, we will experience development of distributed network applications in Java on the Web and smart mobile device.","gradingMethod":"1. Exercise Lab. and Report : 50%2. Examination : 50%","reference":"* Reference1. Arnold, James Gosling, and David Holmes, The Java Programming Language, 4th Edition, SUN, 2006. (Japanese version by Pearson Education)2. Ivor Horton, Java 2 JDK 5 Edition, Wiley Publishing, 20053. C.S. Horstmann, G. Cornell, Core Java, Sun Microsystem Press4. J. O’Neil, Teach Yourself JAVA, McGraw-Hill5. Kathy Sierra and Bert Bates, Head First Java (Head First) 2nd edition, 2005; Japanese edition, 2006."}],[{"title":"FU01 アルゴリズムとデータ構造 I","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"1年","credets":"4.0","instructor":"渡部　有隆, 裴　岩, 黄　捷, 陳　文西, ウォンミィング　チュー, 趙　強福","update":"2019/08/09","outline":"コンピュータは情報を操作するものです。情報の組織化・操作・利用の方法を学習することは、コンピュータを効率的に、そして、効果的に使うために非常に重要なことです。プログラミングや現代のデータ処理において、本質的に必要なものは、問題解決のための、あるいは、主記憶と２次記憶装置にあるデータにアクセスするための、効率的なアルゴリズム（算法）と一連の命令です。この効率というものは、処理するデータの構造に直接結び付いています。他のデータ項目に効果的に結び付けることによって、データ項目は、個々の内容を越えた意味を持つようになります。データ構造は、単に項目だけでなく、互いの関係をも考慮した、データの組織化の方法です。この授業では、アルゴリズムとデータ構造を幅広く紹介し、プログラミング演習によってそれらの定義と実装の方法を学びます。","gradingMethod":"AA:小課題 - 最大100点PA:演習課題 - 最大120点CE:コーディング試験 - 最大120点PE:期末試験 - 最大120点TH:理論点: sqrt(AA × PE)PR:実践点: sqrt(PA × CE)成績 = sqrt(TH × PR))※sqrt(x) はxの平方根","reference":"コースウェブサイトhttp://web-int.u-aizu.ac.jp/course/alg1/演習サイトhttps://onlinejudge.u-aizu.ac.jp/参考書T. コルメン, R. リベスト, C. シュタイン, C. ライザーソン,アルゴリズムイントロダクション 第3版 総合版 (世界標準MIT教科書) 大型本,近代科学社.Thomas H. Cormen, Charles E. Leiserson,  Ronald L. Rivest, Clifford Stein, Introduction to Algorithms (MIT Press).Robert Sedgewick, Algorithms in C, Parts 1-5 (Bundle): Fundamentals, Data Structures, Sorting, Searching, and Graph Algorithms.実務経験あり（裴）：　東軟グループ(中国、CMMI5) 及びAlpine Electronics Europe D&R GmbH (ドイツ)に5年間勤務した。100万LOCレベルのソフトウェア開発のプロジェクトとチームを参加と監督し、核心的なアルゴリズムを設計し、そして産業特許を申請と獲得した。この経験に基づいて、アルゴリズム及び複雑度、プログラミング、ソフトウェア工学などについて教授する。実務経験あり（渡部）：現在、株式会社Giveryとの共同研究において、企業における人材育成、人材評価、研修・教育に活用することができるオンランプログラミングスキルチェックツールを開発している。主要コンテンツの１つとして、アルゴリズムとデータ構造に関する問題及びテストデータを数多く提供している。この経験をもとに、幅広いアルゴリズムとデータ構造の理論と実践を教授する。実務経験あり（陳）：日本光電において５年間、生体計測システム、信号処理、データ解析に関する研究開発に従事した。この経験をもとに、アルゴリズムとデータ構造の基礎を教授する。授業形態：講義,演習"},{"title":"FU02 情報理論と圧縮","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"3.0","instructor":"出村　裕英, 高橋　成雄, アン　トゥアン　ファン","update":"2019/08/09","outline":"効率よくかつ正確に情報を伝達することは、近代デジタル社会における重要な技術課題のひとつである。情報理論はこの問題に対して、数学的な定式化に根ざし、理論的解法を提供する。情報理論の考え方は、確率や統計の定理などを活用し情報通信や誤り訂正のための効率のよい符号化の構築を可能とする。情報理論は、画像データ圧縮、暗号論、ネットワークコミュニケーション、情報量評価などの分野で重要な役割を担っており、本科目でそれらの基礎を身につける。","gradingMethod":"期末試験50%、クイズ（2-14回講義）10%、演習40%"},{"title":"FU03 離散系論","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"2年","credets":"3.0","instructor":"杉山　雅英, 浅井　和人, 森　和好, イゴール　ルバシェフスキー, 浅井　信吉, 渡邊　曜大","update":"2019/08/09","outline":"離散系論は離散数学 (Discrete Math) とも呼ばれている。離散的な事象・対象に対する数学的なアプローチであり、コンピュータ、プログラム、アルゴリズムなどについての数学的な概念や手法として発展してきた。離散系論は計算機科学の数学的な基礎であり多くの計算機関連の研究や応用技術において用いられる。初年度で学んだ線形代数や微積分(解析学)とは異なる計算機科学技術のための数学である。現代の ICT(Information and CommunicationTechnology) を支える共通の道具であるとともに共通の基盤、表現するための共通言語でもある。","gradingMethod":"中間試験の実施、学生の成績評価法は担当教員によって異なるので注意をすること。不明な場合や質問があれば担当教員に確認すること。各クラス毎の評価方法を以下に述べる。  Prof. M.Sugiyama's class     定期試験 (70%), [中間試験(30%)，期末試験(40%)], 演習 (30%)\t  Prof. K.Mori's class     Midterm exam 30%, Final exam 40%, Exercises 30%  Prof. I.Lubashevsky's class     Midterm exam 30%, Final-exam 40%, Home work 30%  Prof. K.Asai's class    By Final Exam. and Exercise. (More than 80% of homework    assignments should be submitted.) Full score of Final Exam. is    approx. 150 points. The raw score \"p\" is converted to a scaled score    \"s\" by the formula: s=75+(p-75)/3+e (p>75), s=p+e (p≦75) (in    principle). Here, \"e\" is Exercise score, which is added up to s=80.","reference":"Prof. M.Sugiyama's class    http://web-int.u-aizu.ac.jp/~sugiyama/Lecture/DS/2019/welcome.html  Prof. K.Mori's class    離散数学―コンピュータサイエンスの基礎数学 (マグロウヒル大学演習)    Seymour Lipschutz (著),‎ 成嶋 弘 (翻訳)    Schaum's Outline of Discrete Mathematics, Revised Third Edition    Seymour Lipschutz (著),‎ Marc Lipson (著)  Prof. I.Lubashevsky's class  Prof. K.Asai's class    Directory for Asai's class: ~k-asai/classes/disc/    Handouts and Exercises for Asai's class:    http://web-ext.u-aizu.ac.jp/~k-asai/classes/class-texts.html  実務経験有り：   - M.Sugiyama\t1979-1986 NTT Musashino ECL (NTT Musashino Research Center)\t1986-1987 AT&T Bell Lab. visiting researcher\t1987-1990 NTT Basic Research Lab.\t1990-1993 ATR Interpreting Telephony Research Lab.            「数え上げと組み合せ論」が情報探索研究に関連している   - K.Mori\t1988-1988 Shinko Electric Co.,Ltd.   \t(神鋼電機株式会社)         制御用コンピュータSELCOS上への数式処理システムREDUCEの実現   - N.Asai\t1997-2000 （株）ウェーブフロント　研究員\t2002-2003　国立環境研究所　客員研究員\t2001-2010 旭硝子（株）との共同研究\tHe has practical work experience at Wave Front Co. Ltd for\tnumerical simulations, modelings and high performance\tcomputings from 1997 to 2000. After joined to U. of Aizu, he\thas continued with companies on the mentioned topics.  These\texperiences of designing models, data structure and algorithms\tare deeply related with this class topics, or each of this\tclass topics is important basic element for practical design.授業形態：講義,演習"},{"title":"FU04 論理回路設計論","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"4.0","instructor":"ウォンミィング　チュー, 西村　憲, 齋藤　寛, 富岡　洋一, 奥山　祐市, 小平　行秀","update":"2019/03/29","outline":"論理回路設計は，プロセッサといったデジタル集積回路における設計の一過程です．論理設計の目的は，集積回路として実現したい機能を0と1をとる論理変数と論理和，論理積，論理否定といった論理演算を用いて設計することです．設計した回路が正しく動作するよう設計することはもとより，コストや性能といった設計要求を満足する最適な設計を得る必要があります．","gradingMethod":"中間・期末試験 60% レポート 40%追試験はありません．以上は，全クラス共通です．"},{"title":"FU05 コンピュータアーキテクチャ論","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"4.0","instructor":"宮崎　敏明, ウォンミィング　チュー, 西村　憲, 中里　直人, ベン　アブダラ　アブデラゼク, 北道　淳司","update":"2019/08/09","outline":"コンピュータアーキテクチャの基礎、設計手法、および性能評価法ついて学ぶ。 コンピュータはプロセッサ、メモリ、入出力装置等から成り立っているが、論理回路設計論で学んだ演算器や制御回路をどのように組み合わせることでこれらが構成できるかについて解説する。コンピュータを設計する際には、 性能、コスト、柔軟性、プログラム容易性、消費電力等、さまざまな要求を考慮しなければならない。本科目では商用プロセッサの１つであるMIPSを例に挙げ、そのアーキテクチャを解説し、これらの要求に対してどのような配慮がなされているかを見て行く。演習では、CadenceなどのCAD(Computer Aided Design)ツールを使った MIPS プロセッサの実装及び動作検証シミュレーションを行う。また、アセンブラプログラミングについても学習し、プロセッサの基本動作を理解する。","gradingMethod":"定期テスト(50%)、演習リポート(50%)、追試験は実施しない。","reference":"参考リンク先初回の講義時にアナウンスする。参考図書\"HDLによるVLSI設計―VerilogHDLとVHDLによるCPU設計　第２版\" 深山正幸 他著-----実務経験あり（宮崎）: NTT研究所に22年間勤務し、CPUやFPGA等を用いた通信システムの開発やその設計自動化の研究に従事してきた。その経験をもとに、コンピュータアーキテクチャの基礎について教授する。授業形態：講義,演習"},{"title":"FU06 オペレーティングシステム論","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"2年","credets":"4.0","instructor":"アレクサンダー　ヴァジェニン, 劉　勇, 大井　仁, コンスタンティン　マルコフ, 西舘　陽平, 李　鵬, 松本　和也","update":"2019/08/09","outline":"Operating systems are an essential part of any computer system. Similarly, a course on operating systems is an essential part of any computer-science education. The operating system provides certain services to programs and to the users of those programs in order to make the programming task easier. In this course, four parts of the core of operating systems will be mainly learned. They are process management, memory and storage management, file system management, and I/O system management. Also, some abstract concepts such as cooperation of multi-process and deadlock will be discussed. We do not concentrate on any particular operating system or hardware. Instead, we discuss fundamental concepts that are applicable to a variety of systems. We present a large number of examples that pertain specifically to UNIX and to other popular operating systems.","gradingMethod":"This policy is used by all course instructors. Final examination, midterm, experimental reports.Exercises: 40 pointsQuiz, Midterm + Exam: 60 pointsReports about results of exercises should be submitted about one week after each exercise.","reference":"The course instructor Alexander Vazhenin has practical working experience. He worked for the Computer Center of Siberian Division of the Russian Academy of Sciences for 15 years where he was involved in R&D of software design and operating systems. Based on his experience, he can teach the basics of Operating Systems.The course instructor Hitoshi Oi has  more than five years of industrial experiences atDigital Equipment Corporation, ASTEM RI/Kyoto and HAL ComputerSystems.1. Course WWW-site will be provided by each instructor.2. 「オペレーティングシステム」前川　守著 岩波書店　ISBN4000103466Class:Lecture,exercises"},{"title":"FU08 オートマトンと言語理論","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"2年","credets":"3.0","instructor":"鈴木　大郎, モハメド　ハマダ, 森　和好","update":"2019/08/09","outline":"オートマトン言語理論は計算の理論の最も基本的な理論である。ここで中心となるのは、言語といわれる無限集合(主に可算無限である) を記述する方法を知ることである。本講義では、主要な2つの方法、すなわち、認識/受理システムであるオートマトンと、生成システムである文法についてについて学ぶ。さらに、文法とオートマトンを通じて形式言語の関係、言語の階層性、言語の多様な記述方法について学ぶ。これらのものは、現実に直面する問題を定式化し、それが容易に解けるものかどうかを判断したりするのに有益なツールとなる。","gradingMethod":"期末試験は40%。それ以外の評価方法と評価基準は教員によって異なる。森和好中間試験 30%  演習 30%モハメド・ハマダクラス活動 14%  中間試験 20%  演習 26%鈴木大郎中間試験 30% 演習 30%","reference":"参考図書として次のものを挙げておく。* J. Hopcroft, J. Ullman: Introduction to Automata Theory,Languages and Computation, Addison-Wesley, 1979.* J. L. Hein: Theory of Computation, An Introduction,Jones and Bartlett, 1996.* M. Sipser: Introduction to the Theory of Computation,PWS Publishing Co., 1996.* N. Pippenger: Theories of Computability,Cambridge Univ. Press, 1997.* R. Greenlaw, H. J. Hoover: Fundamentals of the Theory ofComputation, Morgan Kaufmann Pubs.Inc., 1998* A. Meduna: Automata and Languages, Theory and Applications,Springer, 1999.* J. Hopcroft, R. Motwani, J. Ullman: Introduction to Automata Theory,Languages, and Computation(3rd ed.), Addison-Wesley, 2006.* P. Linz: An Introduction to Formal Languages andAutomata(5 ed.), Jones and Bartlett, 2012.* 本多波雄：オートマトン言語理論、コロナ社（１９７２）* 福村晃夫、稲垣康善：オートマトン形式言語と計算論、 岩波書店（１９８２）* J.ホップクロフト、J.ウルマン（野崎他訳）：オートマトン　言語理論計算論I、II、 サイエンス社（１９８４、１９８６）* V.J.レイワードスミス（吉田他訳）：言語理論入門、共立出版（１９８６）* 有川節夫、宮野悟：オートマトンと計算可能性、培風館（１９８６）* A.サローマ（野崎他訳）：計算論とオートマトン理論、サイエンス社（１９８８）* 嵩忠雄、都倉信樹、谷口健一：形式言語理論、電子情報通信学会（１９８８）* 米田政明：計算機科学の基礎、森北出版（１９９１）* 富田悦次、横森貴：オートマトン言語理論、森北出版（１９９２）* 足立暁生：オートマトンと言語理論、森北出版（１９９２）* 米田政明、広瀬貞樹、大里延康、大川知：オートマトン言語理論の基礎、近代科学社（２００３）* 丸岡章：計算理論とオートマトン言語理論、サイエンス社（２００５）* 大川知、広瀬貞樹、山本博章:オートマトン言語理論入門、共立出版（２０１２）* 川添愛、白と黒のとびら: オートマトンと形式言語をめぐる冒険、東京大学出版会（２０１３）実務経験有り(鈴木): 三菱電機東部コンピュータシステム(株)で、1987年から1990年までProlog推論マシン上のC、LISP言語処理系の開発に従事した。この経験をもとに、言語理論の基礎と言語処理系との関連について教授する。実務経験有り(森): 神鋼電機(株)で、1988年に計算機代数システムREDUCEの実装に従事した。この経験をもとに、計算の理論的および機械的側面について教授する。授業形態：講義,演習"},{"title":"FU09 アルゴリズムとデータ構造 II","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"3.0","instructor":"浅井　信吉, 矢口　勇一, コンスタンティン　マルコフ, 鈴木　大郎, 劉　勇, イエン　ニール　ユーウェン","update":"2019/08/09","outline":"The study of algorithms is at the very heart of computer science. This course is intended to teach the some computer algorithms and techniques for their design and analysis which are not covered in Algorithms and Data Structures 1. After the course the students will have a solid background for this type of activity, as well as for representing algorithms in the format of computer programs.","gradingMethod":"Lab. Exercises: 40%;Mid-Term Exam: 30%;Final Exam: 30%;","reference":"1. Alfred V. Aho, John E. Hopcroft, Jeffrey D. Ullman. The Design and Analysis of Computer Algorithms (Addison Wesley Professional, 1974, ISBN:0-201-00029-6);2. Alfred V. Aho, John E. Hopcroft, Jeffrey D. Ullman(著), 野崎昭弘, 野下浩平(訳)『アルゴリズムの設計と解析I』 (サイエンス社, 1977, ISBN:4-7819-0279-0);3. Alfred V. Aho, John E. Hopcroft, Jeffrey D. Ullman(著), 野崎昭弘, 野下浩平(訳)『アルゴリズムの設計と解析II』 (サイエンス社, 1977, ISBN:4-7819-0280-4);4. Robert Sedgewick(著), 野下浩平, 星守, 佐藤創, 田口東(訳)『アルゴリズムC　第１巻　基礎・整列』 (近代科学社, ISBN:4-7649-0255-9);5. Robert Sedgewick(著), 野下浩平, 星守, 佐藤創, 田口東(訳)『アルゴリズムC　第２巻　探索・文字列・計算幾何』 (近代科学社, ISBN:4-7649-0256-7);6. Robert Sedgewick(著), 野下浩平, 星守, 佐藤創, 田口東(訳)『アルゴリズムC　第３巻　グラフ・数理・トピックス』 (近代科学社, ISBN:4-7649-0257-5);Reference (coursewebsite, literature, etc.)Course Website: http://hare.u-aizu.ac.jp/classaa/2019  (N. Asai class)  (Moodle):http://hi-srv2.u-aizu.ac.jp/ (K. Markov class)Prof. Asai has practical experience at Wave Front Co. Ltd for numerical simulations, modelings and high performance computings from 1997 to 2000. After joined to U. of Aizu, he has continued with companies on the mentioned topics. These experience is deeply related to this class topics of cost of computation, data structure, and algorithms.Prof. Suzuki was engaged in the development of C and Lisp languageprocessing systems implemented on inference machines based on Prolog,developed in the Fifth Generation Computer Systems national projectfrom 1987 to 1990 at Mitsubishi Electric Eastern Computer System Co.Ltd. After joined to U. of Aizu, he has been engaged in the preparationfor the PC Koshien Programming  Division, a programming contest forhigh-school students, since 2012. Prof. Markov has a practical experience at the Advanced Telecommunications Research (ATR) Institute where he worked from 1999 to 2009. This experience includes complex algorithms for search, dynamic programming and optimization which are directly related to the topics of this class.Class:Lecture,Exercises"},{"title":"FU10 言語処理系論","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"4年","credets":"3.0","instructor":"モハメド　ハマダ","update":"2019/02/05","outline":"言語の処理は、コンピュータ科学において基本的かつ必須の科目であり、1950年代初めから精力的に研究され、今日でも重要な研究分野である。以下のような理由から、この科目は学部のカリキュラムにおいて重要な 位置を占めている。--言語をより良く理解し正当に評価する能力を養う。-- プログラムを開発するときに、プログラミング言語処理に用いられる   技法を活用することができる。-- コンピュータ科学の理論的な課題を学ぶ必要性に対する動機付けになる。","gradingMethod":"1. Class activities: 14%2. Exercise: 26%3. Midterm exam: 20%4. Final exam: 40%","reference":"Will be given in lecture"},{"title":"FU11 数値解析","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"3.0","instructor":"西舘　陽平, 北里　宏平, 劉　勇","update":"2019/02/05","outline":"数値計算手法の基礎について学ぶ科目。コンピュータサイエンスにおいて幅広く使われる、数値計算手法やアイディアについて応用例を交えながら学ぶ。","gradingMethod":"演習課題 50%中間試験 20%期末試験 30%","reference":"数値で学ぶ計算と解析,金谷健一,共立出版."},{"title":"FU14 ソフトウェア工学概論","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"3.0","instructor":"吉岡　廉太郎, アレクサンダー　ヴァジェニン, 白　寅天, ヴィタリー　クリュエフ, 裴　岩, ジュリアン　ヴィジェガス","update":"2019/08/09","outline":"ソフトウェア工学は、ソフトウェア開発に関係する技術や手法に関する学問です。それは、ソフトウェアをどのように作ると良いのか、どのように管理すれば良いのかなど、理論的なものから実践的なものまで実に多くの知識を含んでいます。ソフトウェアが人々の生活をあらゆる面で支えるようになった今日、ソフトウェア工学の重要性は増す一方です。また、コンピュータに携わる技術者として、ソフトウェアに関する基礎知識としてその基本は知っておく必要があります。　この授業では、まず、ソフトウェアを作るのに必要な（一般的な）工程を説明し、各工程が完成するソフトウェアに及ぼす影響について考えます。そして、各工程での課題について考え、関連する技術・手法を紹介します。技術や手法の紹介では、どういった課題があるのかを知り、代表的な解決策について理解してもらうことを目的とします。新しいものも古いものも、必要に応じて取り混ぜて扱います。また、ソフトウェアの種類（組み込み、ウェブ、並列など）による違いについては大きく扱わず、より一般的に通用する部分を対象とします。　以上のように、この授業ではソフトウェア工学がどのような知識・技術群であるかを理解してもらうことに主眼を置きます。　演習では、講義で扱う一般的な知識の理解を助けるため、より具体的な演習課題に取り組みます。各回は、開発工程のいずれかと対応しており、その工程で必要となる作業の基本を順に理解していきます。各課題は実世界の課題を意識して作られているので、理論や基本だけでは理解しづらい要素に気づくこともできます。演習を一通り実施することで、代表的な開発プロセス、開発モデルに沿ったシステム開発を体験することができ、それらの役割を理解できます。","gradingMethod":"以下の項目で評価します。　1. クイズ 5%　2. 期末試験　60%　3. 演習 35%演習は要求課題を充足している度合いを評価します。各演習課題は原則時間内提出とし、最終提出を次の授業日前日24:00とします。期末試験では演習課題の内容に対する理解を確認する問題も出題します。","reference":"http://borealis.u-aizu.ac.jp/classes/se1Moodle http://sealpv0.u-aizu.ac.jp:20000/実務経験有り：現役のソフトウェア技術者（30年以上の実務経験）とソフトウェア開発に従事した経験豊富な教員（企業での開発経験を含む）が共同で授業を行います。授業形態：講義,演習"},{"title":"FU15 データマネジメント概論","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"2年","credets":"3.0","instructor":"エフゲニー　ピシキン, マキシム　モズゴボイ, ジュリアン　ヴィジェガス, ウォンミィング　チュー, イエン　ニール　ユーウェン, 大藤　建太","update":"2019/08/09","outline":"The course is focused on representing the following conceptual units (please see the class schedule for implementation details):- Foundation Concepts necessary for introducing basic data management principles,- Data modeling approaches, implementation and practical use.- Methods and organization of data storage, versioning, distribution and backup.- Accessing and storing data with using database systems and specialized data management systems.","gradingMethod":"The final grade is calculated based on the following weights:- Tests and quizzes during lecture and hands-on time – 40%- Exercises and individual projects – 30%- Final test – 30%Additional bonus points may be given by the course instructors for active participation in classroom activities and high quality creative exercise solutions and be used to compensate the possible grade deficit for major course activities up to 20%.","reference":"The course lecturers have extensive working experiences in software design, development and testing. Prof. Evgeny Pyshkin worked as a software engineer for St. Petersburg Polytechnic University and participated in software projects with Spectrasize (Switzerland) as a developer and a project manager. Prof. Maxim Mozogovoy worked in joint software projects with industry partners as software developer, software QA engineer and project team leader. Prof Ofuji has a 10-year work experience in a private company and a research institute, involved in a real-world, energy-related statistical data analysis.Official Course Web Page: http://web-int.u-aizu.ac.jp/~pyshe/courses/idm/.The access to the course on Moodle: https://aizudc.gnomio.com.Class:Lecture,Exercises"}],[{"title":"SY02 電子回路","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"4.0","instructor":"束原　恒夫, 久田　泰広","update":"2019/08/09","outline":"VLSIを構成するデバイスはディジタル回路のみならず、アナログ回路、無線周波数（RF）回路においてもCMOSデバイスが主流になっている。そこで、この電子回路の授業では、MOSFET（MOS電界効果トランジスタ）を中心としたアナログ電子回路の設計法について学ぶ。最初に電気回路の基礎について復習をし、ラプラス変換を用いた過渡解析についても触れる。続いて、MOSFETを中心とした半導体デバイスの直流特性の復習と負荷線の考え方を学ぶ。引き続き、増幅器の基礎として、各種接地回路の特徴、小信号等価回路について理解を深めていく。最後に応用的な観点から、オペアンプの基本を学んだ後、アナログとディジタルのインタフェース回路としてのサンプル・ホールド回路、A/D変換器、D/A変換器の基礎を理解する。　実験のクラスでは、LC共振回路の実験から始める。続いて、MOSFETを用いたソース接地型増幅回路を中心に回路を作成して動作を学ぶ。さらに、CMOS型の増幅器を用いて、増幅回路とディジタル回路のインバータとの類似性を理解する。最後に、オペアンプの応用回路、サンプル・ホールド回路とコンパレータを用いた、低ビットのA/D変換器の実験を行う。","gradingMethod":"講義：期末試験（50％）　　　演習問題（小テスト）（10％）実験：レポート（40％）注意：演習問題（小テスト）や実験レポートの提出が無い場合は出席と認めない。","reference":"【電気回路】1. Schaum's Outline of Electric Circuits, ISBN: 00713930722. 安居院、吉村、倉持、「エッセンシャル電気回路」 第2版、森北出版、ISBN978-4-627-73562-0【電子回路、MOSアナログ集積回路】3. 松澤 昭、「はじめてのアナログ電子回路」（実用回路編）、講談社、ISBN978-4-06-156545-6A/D・D/A変換器、アクティブ・フィルタなど4. 谷口 研二、「CMOSアナログ回路入門」、CQ出版、ISBN4-7898-3037-35. B. Razavi、「アナログCMOS集積回路の設計　基礎編」、丸善、ISBN4-621-07220-X【注】実務経験あり（束原）：NTT研究所に25年間勤務し、通信システム用の半導体集積回路・LSIの研究開発に従事してきた。この経験をもとに、電子回路の基礎について教授する。授業形態：講義,演習"},{"title":"SY04 組込みシステム","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"4.0","instructor":"北道　淳司, 奥山　祐市","update":"2019/02/04","outline":"This course provides students with experience in embedded systemsdesign. The course introduces issues in upstream design in embedded systemand RTOS for real time systems. There are also weekly laboratory sessions on design of a microprocessor-based embedded system including one or more custom peripherals.","gradingMethod":"Final examination (50%), and reports of exercises (50%).","reference":"Course website and other reference material will be given by the instructor during the first class."},{"title":"SY05 並列コンピュータシステム","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"3.0","instructor":"中里　直人, ベン　アブダラ　アブデラゼク","update":"2019/02/15","outline":"今日、私達が利用するコンピューターは、パソコンであろうとケータイ電話であろうと、スマートフォン、タブレット、どれも並列計算機であり、それらを効率よく利用するためには、並列計算の理解が欠かせない。本講義では、並列計算(Parallel Computing)、およびその応用としての高性能計算(High Performance Computing)について学ぶ。","gradingMethod":"演習(50%)およびレポート(50%)の内容で評価する。","reference":"Website in 2017: http://galaxy.u-aizu.ac.jp/note/wiki/PCA2017"},{"title":"SY06 VLSI設計技術","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"小平　行秀","update":"2019/02/15","outline":"近年のLSI技術の進歩により，電子機器の発達，飛躍的な性能向上が成し遂げられている．特に，LSIプロセスの微細化により，トランジスタの動作速度が向上するが，配線遅延は増加する．配線遅延はレイアウト設計で決まるので，電子機器の性能向上を実現するにはレイアウト設計の知識は不可欠である．この授業では，LSIのレイアウト設計を中心にLSI設計全般の知識を学ぶ．","gradingMethod":"期末試験 60%演習課題 40%を目安に評価する．別途，授業に欠席した場合は，減点する．","reference":"参考書國枝 博昭「集積回路設計入門」コロナ社"},{"title":"SY07 論理回路設計特論","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"3.0","instructor":"齋藤　寛, 富岡　洋一","update":"2019/01/29","outline":"プロセッサといったデジタル集積回路において，設計のほとんどは，実現したい機能をハードウェア記述言語を用いてモデリングし，Electronic Design Automation (EDA) ツールを用いて自動合成します．そのため，ハードウェア記述言語を用いてどのように回路をモデリングするか, またEDAツールがどのように回路を合成するのかを理解することが必要となります．","gradingMethod":"レポート(45%)、期末テスト(55%)追試験はありません．"}],[{"title":"CN02 ネットワークセキュリティ","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"3.0","instructor":"アン　トゥアン　ファン","update":"2019/02/28","outline":"This course offers the fundamentals of the highly important topics in the computer networking – the network security. Students are required to take the L11 course to have basic concepts of networking, from application to link-layer layers.","gradingMethod":"Grading: - Q: Quiz: 10%- L: Lab assignments: (15x3) 45% - M: Mid-term exams: 20%- E: Final exams: 25%Final score (F)- If any of Q, L, M or E = 0 --> F = 0- Otherwise F = 0.1Q + 0.45L + 0.2M + 0.25E"},{"title":"CN03 ネットワークプログラミング","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"3.0","instructor":"コン　タン　チョオン","update":"2019/08/09","outline":"The Internet is currently the main infrastructure to connect people and machines all over the world. This course covers the practical knowledge and skills to connect the computers, at application layer, transport layer, and network layer. Topics include Addresses and Protocols, Client-Server architecture, Socket basics, UDP/TCP sockets, App-layer networking, and Software Defined Network (SDN). Students are required to take the L11 course to have basic concepts of networking, from application to link-layer layers.","gradingMethod":"-\tQuizzes: 15%-\tExercise reports: 45% -\tMid-term exam: 20%-\tFinal exam:        20%","reference":"web-int.u-aizu.ac.jp/~thang/cno/The course instructor C.T. Truong has practical working experiences in network programming. He worked for Electronics and Telecommunications Research Institute (ETRI) of South Korea for 5 years where he was involved in R&D of multimedia communications and networking. He also actively contributed in ISO/IEC & ITU-T standards related to IPTV and video streaming for more than 10 years.授業形態：講義,演習"},{"title":"CN04 ワイヤレスネットワーク","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"アン　トゥアン　ファン","update":"2019/02/28","outline":"This course helps to develop an understanding of the various aspects of wireless and mobile networks. Following the first course on computer networking (L11: Introduction to Computer Networking) which covers basic concepts the Internet, including applications, transport, network and a part of data-link layers, the N04 course provides a solid conceptual understanding of the fundamentals of the most popular transmission media today: the wireless transmission. The course covers fundamentals of design and architecture of wireless networks.","gradingMethod":"Grading- Quiz (Q): 10%- Assignments (A): 40%- Mid-term exams (M): 25% - Final exams (E): 25%Final score (F)- If any of Q, A, M or E = 0 --> F = 0- Otherwise F = 0.1Q + 0.4A + 0.25M + 0.25E"},{"title":"CN05 コンピュータネットワークシステムのモデリングとシミュレーション","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"3.0","instructor":"李　鵬","update":"2019/02/05","outline":"Computer and network modeling and simulation is a key step in the design and procurement of new computer systems including processors, languages, operating systems, networking architectures, or database systems. In all cases, it is necessary to compare performance of new computer systems with that of similar systems. This course provides these professionals with fundamental performance analysis techniques and require a minimal level of statistical sophistication.","gradingMethod":"Class Q&A: 20%Assignment: 30%Examination: 50%"}],[{"title":"IT01 人工知能","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"4.0","instructor":"趙　強福, 愼 重弼, イエン　ニール　ユーウェン, 白　寅天","update":"2019/01/28","outline":"人工知能は知的思考や行動を計算機械(Computing machine)で実現する方法を考察する学問である。人工知能の最終目標は、自律的に学習し、自律的に計画を立て、自律的に与えられた問題を解決することができる計算機械を作ることである。人工知能の歴史は既に半世紀以上経っているが、総合的に考えれば、人間並みの知能を持つ計算機械はまだない。しかし、さまざまな分野において、人工知能の成功例は数多く挙げられる。場合によっては、人間よりも計算機械のほうは知能が高いともいえる。よく知られている例は、囲碁の世界チャンピオンを破ったAlphaGoというシステムである。医療診断や機械設計などにおいても、人間をサポートする「専門家システム」が広く使用されている。即ち、総合的には人間の知恵に匹敵できる人工システムがまだ存在しないが、個別領域では人間よりも「賢い」システムが既に開発されている。このようなシステムと組むことによって人間は「より知的」（より知恵があるようになったかどうかはわからないが）になっていることは否定できない事実であろう。人工知能の主な研究テーマをあげると、問題解決、推論、計画立案、自然言語理解、コンピュータビジョン、自動プログラミング、機械学習、などがある。これらのテーマは互いに独立ではない。例えば、機械学習によって獲得した知識を問題解決にも使えるし、推論にも使える。問題解決の方法自体も学習によって得られるかも知れない。また、有効な問題解決方法は、推論の過程にも使えるし、計画立案にも有用である。更に、言語の理解とコンピュータビジョンはパターン認識の領域で考えれば、同じ種の問題であり、データの表現方法だけが違う。","gradingMethod":"演習(40点)、期末試験（60点）","reference":"[1] 人工知能概論、荒屋　真二著、共立出版、ISBN4-320-12116-3[2] 新しい人工知能（基礎編）、前田　隆、青木　文夫共著、オーム社、ISBN4-274-13179[3] 　新世代工学シリーズ、人工知能、溝口　理一郎、石田亨、オーム社、ISBN4-274-13200-5 [4] Artificial Intelligence: a modern approach, S. Russell and P. Norvig, Prentice Hall, ISBN0-13-080302-2[5] この授業のホームページ：http://web-ext.u-aizu.ac.jp/~qf-zhao/TEACHING/AI/AI.html"},{"title":"IT02 コンピュータグラフィックス論","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"3.0","instructor":"ピエール－アラン　ファヨール, 西舘　陽平, 高橋　成雄, 平田　成","update":"2019/02/15","outline":"本授業はコンピュータと情報技術の重要な応用であるコンピュータグラフィックスについて学習する。コンピュータグラフィックスは人間の目で見た物体をコンピュータで立体的画像を作成する技術であり、下記の分野で応用されている。* CAD (Computer-aided design):機械設計、建築設計、回路設計など。* 娯楽：　映画制作、アニメ、ゲームなど。* バーチャルリアリティ：フライトシミュレーション、手術支援など。* ビジュアリゼーション：シミュレーション、データビジュアライゼーション。","gradingMethod":"* 演習、宿題 、適宜問題：50%* 期末試験：50%","reference":"2018年の授業ホームページ高橋先生：* http://web-int.u-aizu.ac.jp/~shigeo/course/cglec/index.html* http://web-int.u-aizu.ac.jp/~shigeo/course/cgex/index.htmlファヨール先生：* https://web-int.u-aizu.ac.jp/~fayolle/teaching/cg/index.html"},{"title":"IT03 画像処理論","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"4年","credets":"3.0","instructor":"矢口　勇一, 朱　欣","update":"2019/08/09","outline":"『百聞は一見に如かず』ということわざが示す通り、画像は日常生活におけるコミュニケーションや知識の蓄積に置いて非常に重要な役割を果たしている。特に近年では、ほぼ100％に近いモバイルデバイスにカメラが搭載されるなど、全ての人間が気軽に画像を撮り、扱うことが出来るようになった。また、Web等を介して、様々な画像を見ることが出来るようになり、コンピュータによって自動的に画像の認識と理解を行う事が重要なビジネスの対象となっている。画像処理は、カメラ等によって撮られた画像を如何に加工し、その情報を基に目的の認識・理解を得られるかを行う技術である。授業では、画像の入力装置を経て、コンピュータへの転送のためのデータ圧縮、ノイズや撮影環境を合わせるための種々の加工技術、画像特徴を得るためのフィルタリング技術、得られた特徴から事前知識や学習等を用いての認識・理解までを、基本的な画像処理の手法を紹介しながら、『どのように画像から知見を得るか？』を議論し、画像処理に対する理解を深めていく。","gradingMethod":"全 7 回の演習提出とExtra Projectによって採点する。中間・期末は実施しない。但し、講義への出席は点数に加味されないが、5 回以上欠席の場合は F とする。なお、出席は、授業中に配られる課題を提出することで出席とみなす。（課題の点数は成績に加味しないが、理解度を図る良い材料となる。）演習提出: 1 回 10~15 点満点 x 7 = 100 点演習の初回提出が期限内に出せない場合は各回で -4 点とする。（0 点を下回る場合はその回の点数を 0 点とする）但し、事前に出席できない旨を教員に知らせる場合は、その限りではない。（病欠、就活による欠席、イベント出席による欠席等は、減点しない期間を与える）","reference":"画像処理学講座 Moodlehttp://hartman.u-aizu.ac.jp/実務経験有り：The course instructor Xin Zhu has practical working experiences. He had performed biomedical image processing at Tianjin University for 5 years, and has performed biomedical image processing at the University of Aizu for 15 years with the financial support from universities and JSPS. Based on his experiences, he can teach the basics of image processing.The course instructor Yuichi Yaguchi is studied a set of image processing techniques from 2008, and he has teaching experience of this course from 2011 to 2017. He also has practical working experience of image processing research such as the finding irregular control by drive recorder, remote survey system of sewage plant by web camera, visual SLAM system for robot system and so on. He also teach the advanced course of image processing such as image recognition and understanding in graduate school.授業形態：講義,演習"},{"title":"IT05 ロボット工学と自動制御","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"4年","credets":"3.0","instructor":"成瀬　継太郎","update":"2019/02/15","outline":"現代社会ではコンピュータは様々な機器の制御に広く用いられ、制御などの知識が必要不可欠となっている。本科目ではコンピュータ科学・工学専攻の学生のための、ロボット工学と自動制御理論の基礎を与えるものである。とくに実世界において制御理論の中心であるフィードバック制御の概念を学ぶことと、ロボットを制御するための基本的な理論と考え方を習得することに主眼を置く。また講義だけではなく、演習を通じてより深い理解を目指す。","gradingMethod":"講義のクイズ：３０％演習：４０％期末試験：３０％","reference":"http://iplab.u-aizu.ac.jp/moodle"},{"title":"IT06 ヒューマンインターフェイスと仮想現実","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"4年","credets":"3.0","instructor":"ジュリアン　ヴィジェガス, マイケル　コーエン","update":"2019/08/09","outline":"このコースでは、インタラクティブマルチメディア、つまりリアルタイムゲーム、マンマシンインタフェースを学ぶクラスです。この講座では学部生や大学院生を対象に、特にデスクトップVR（別名、fishtank VR）を通してヒューマンインターフェースの技術と仮想現実の範例を紹介します。講座ではCGM(消費者生成メディア）とUGC(ユーザー生成コンテンツ）を活用して自身でデザインした仮想世界の作成を実際に行います。主に、オブジェクト指向でラピッドプロトタイピング3Dシナリオ統合開発環境である「Unity」を用いて、ソフトウェア工学同様、デスクトップVR、モーション グラフィックス、色彩 (とカラー勾配)、図形・視覚のデザイン、テクスチャマッピング、音、音楽、スピーチ、ソフトウェア工学、並列計算、対話の分野の表現を行います。Photopea、Audacity、GarageBandなどのソフトも用います。実用的な実験、体験的なレッスンなどに力を入れています。","gradingMethod":"必要な技術が身に付いているかを毎週『チェックポイント』課題で、発見やデザインの確認をします。シナリオ製作と絵コンテ製作、絵描きと色塗り、カラーモデルと仕様、デジタル合成（レイヤー・オーバレイ・テクスチャマッピング）、立体視（3D図面を含むオートステレオグラム・ランダムドットステレオグラム・アナグリフ・クロマステレオスコープ）、SFXを用いた音声編集、TTSによる音声との対話、BGM用のデスクトップ音楽の合成を通じて、仮想世界とストーリーを徐々に製作していきます。クリエイティブスタジオでの課題と時折クイズ、試験があります。クロマステレオスコピックアートコンテストを開催し、優秀な作品は大学図書館に展示されます。また、「Unity」を用いてシナリオ、動画、ゲームなどの独創的な作品を製作します。中間試験は個人製作、期末試験ではチームで製作し、スペシャルレビューセッションで授業中に発表します。演習、クイズ: 35%、試験: 25%、個別プロジェクト: 20%、グループ プロジェクト: 20%","reference":"Related web pages:course home page: http://web-int.u-aizu.ac.jp/~mcohen/welcome/courses/AizuDai/undergraduate/IT06 HI&amp;VRnewsletter article about the course: http://sighci.org/uploads/SIGHCI%20Newsletters/AIS_SIGHCI_Newsletter_v12_n1.pdf#page=10 (pages 10-11 if not automatically scrolled)PhotoBooth photo capture: https://support.apple.com/ja-jp/guide/photo-booth/welcome/macPhotos photo manipulation: https://www.apple.com/jp/macos/photos/OS X \"say\" TTS (text-to-speech) utility: http://developer.apple.com/library/mac/#documentation/Darwin/Reference/ManPages/man1/say.1.htmlAudacity audio editor: http://audacity.sourceforge.net/?lang=jaPhotopea image editor: https://www.photopea.com/GarageBand DTM (desk-top music) composition application: http://www.apple.com/jp/mac/garageband/University of Aizu virtual tour: http://www.u-aizu.ac.jp/~mcohen/welcome/courses/AizuDai/undergraduate/HI&VR/VirtualTourChromastereoptic stereo system: http://www.chromatek.comUnity: https://unity3d.com/jp/Unity チュートリアル: https://unity3d.com/jp/learn/tutorialsBlender: https://www.blender.org (https://blender.jp)Prof. Cohen instructor has several years of industrial experience related to the course contents.Besides appointments to academic positions at the University of Washington (Industrial Engineering Dept.) and the African University of Technology (Computer Science Dept.) teaching these topics,he has worked in industry on virtual environments, especially audio interfaces, at Bellcore (Bell Communications Research),doing R&D of synchronous and asynchronous network services, including hypermedia collaborative tools and TTS,and at the NTT Human Interface Laboratories,researching stereotelephony, digital typography, hypermedia, and groupware, and visual languages.Prof. Villegas has practical working experience. He worked for the Productivity National Center in Colombia and as a private consultant for five years. He was involved in the development of web-based industry productivity solutions.授業形態：講義,演習"},{"title":"IT08 信号処理と線形システム","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"4.0","instructor":"陳　文西, コン　タン　チョオン, 朱　欣","update":"2019/08/09","outline":"Signals and systems are present in any aspects of our world. The examples of signals are speech, audio, image and video signals in TV, PC, and smartphone; electrocardiograms in medical systems; electronic radar waveforms in military equipment. Signal processing is concerned with the representation, transformation and manipulation of signals, and extraction of the significant information contained in signals. For example, we may wish to remove the noise in speech signals to make them clear, or to enhance an image to make it more natural. Signal processing is one of the fundamental theories and techniques to construct modern information systems. During the last century, lots of theories and methods have been proposed and widely studied in signal processing. This course includes the concept of continuous-time and discrete-time signals, representations of signals in time, frequency, and other transform domains, representations and analyses of systems, filter structures and designs.The course is a prerequisite course for your further studying on other related courses, such as biomedical signal processing, speech processing, image processing, audio and video data compressing, pattern recognition, communication systems and so forth.","gradingMethod":"1. Mid-term exam: 20%2. Final exam: 30%3. Exercises: 40%4. Quiz: 10%","reference":"1.\tInstructorsThe course instructor Wenxi Chen has practical working experience. He worked for Nihon Kohden Industrial Corp. for 5 years where he was involved in R&D of bioinstrumentation, signal processing and data analysis. Based on his experience, he can teach the basis of signal processing and linear systems.The course instructor Cong Thang Truong has practical working experiences. He worked for Electronics and Telecommunications Research Institute (ETRI) of South Korea for 5 years where he was involved in R&D of multimedia signal processing and communications. He also actively contributed in ISO/IEC & ITU-T standards of signals and systems for more than 10 years. Based on his experiences, he can teach the basics of signal processing and linear systems.The course instructor Xin Zhu has practical working experiences. He had performed biomedical signal processing at Tianjin University for 5 years, and has performed ECG, EEG, and pulse signal processing at the University of Aizu for 15 years. He had also performed collaboration research with Shinken Corp. and Asahi Denshi Corp. for the development of biomedical signal processing algorithms for about 5 years. Based on his experiences, he can teach the basics of signal processing and linear systems.2.\tLecture and Exercisehttp://web-int.u-aizu.ac.jp/spls/3.\tMIT OpenCourseWarehttps://ocw.mit.edu/resources/res-6-007-signals-and-systems-spring-2011/index.htmClass:Lecture,Exercises"},{"title":"IT09 音響音声処理論","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"4年","credets":"3.0","instructor":"ジュリアン　ヴィジェガス, マイケル　コーエン","update":"2019/08/09","outline":"The purpose of this course is two-fold: To learn some techniques used for extracting information from acoustic signals and to use acoustic signals to display information. Hearing is the second most important sensory modality and it is sometimes preferable than vision to display and acquire information. For example, a car navigation system delivers guidance using speech, or you verbally ask your mobile phone to dial some number. In this course, we briefly review the main characteristics of sound, audio, and their processing for human-computer interaction.","gradingMethod":"Exercises 30% Quizzes 30%Final exam 40%"},{"title":"IT10 ビジュアルコンピューティングのための幾何学","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"3年","credets":"3.0","instructor":"本田　親寿, 高橋　成雄","update":"2019/02/15","outline":"計算幾何学はコンピュータサイエンスの中で重要な分野の一つである．近年，大量のデータを扱う地理情報システム（GIS）やコンピュータグラフィクス（CG），コンピュータ支援設計（CAD），パターン認識，ロボティクスの分野などでは計算幾何学的問題を高速に処理することが求められている．本科目の前半（1-7章）では計算幾何学の基本概念を理解し，後半（8-14章）では計算幾何学を前提にした様々な情報の可視化について学ぶ．","gradingMethod":"演習50%期末テスト50%","reference":"Computational Geometry: Algorithms and Applications, 3rd editionM. de Berg, others,Springer, 2008Information Visualization: An IntroductionRobert SpenceSpringer, 2014コンピュータ・ジオメトリ計算幾何学：アルゴリズムと応用 第3版M. ドバーグ，他浅野哲夫 訳2010年"},{"title":"IT11 情報検索と自然言語処理","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"3.0","instructor":"矢口　勇一, 白　寅天","update":"2019/02/15","outline":"コンピューターが自然言語を理解することは、人間と機械のコミュニケーションにとって非常に重要な技術である。また、世の中は当然のごとく自然言語で記述された文書が氾濫している状態である。このために、自然言語をコンピューターで理解し、どのように文書などの意味を抽出し、再構成するかを学ぶことは、情報工学における基礎的な技術である。本授業は、Web上等にある自然言語で記述された文書等を、いかに理解し、意味を抽出し、再構成や検索をするかの技術を、Pythonで利用可能なNatural Language Toolkitを利用することを中心として学ぶ。また、授業中では、特に基本的な技術について、詳細まで立ち入り、他の言語でも利用可能な理解を促進させる。","gradingMethod":"演習は7回分、1回につき10点、合計70点分とする。期末テストは知識を問う問題、アルゴリズムを問う問題を出し、合計30点分とする。演習70点、期末テスト30点、計100点とする。","reference":"Moodle: http://hartman.u-aizu.ac.jp/Natural Language Toolkit http://www.nltk.org/NLTK Book http://www.nltk.org/book/情報検索の基礎 http://www.kyoritsu-pub.co.jp/bookdetail/9784320123229"}],[{"title":"SE01 ウェブエンジニアリング","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"3.0","instructor":"ヴィタリー　クリュエフ, イエン　ニール　ユーウェン","update":"2019/08/09","outline":"Nowadays, the Web is not only the source of information for the end users. Companies migrate more of their business activities to Web based systems. We are facing increasing demands for professionals who can design large Web systems. Web engineering is a relatively new term in computer science. It can be defined as a discipline of systematic development of Web applications. The aim of this course is to study current concepts and methods for Web application engineering.","gradingMethod":"The final grade will be calculated based on the following contributions:Exercises - 50%,Quizzes during lectures - 15%,Final examination - 35 %.","reference":"A course coordinator Prof. Vitaly Klyuev has practical working experience. He was working as a  Senior researcher in an international consortium of the INCO Copernicus Program of the Commission for European Communities, Brussels, Belgium. He was involved in the development of the distributed search system running on the Web. He has teaching experience of different courses related to programming for more than 30 years.Course Web page: http://web-int.u-aizu.ac.jp/~vkluev/courses/webengineering/Class:Lecture,Exercises"},{"title":"SE02 ウェブデータモデリング","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"3年","credets":"3.0","instructor":"サバシュ　バーラ, イエン　ニール　ユーウェン","update":"2019/02/22","outline":"The course covers concepts in Web Programming,  for    web sites and user interaction. The course is focused on    developers of large scale Web based systems.    It also covers basic knowledge at Programmer level.","gradingMethod":"Mid-term Examination(30 points); Two short quizzes (40 points (20 points each)) Web Programming Assignments(30 points)","reference":"Book, Course material, slides and notes recommended by the instructor(s)."},{"title":"SE04 ソフトウェア工学特論","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"3.0","instructor":"アレクサンダー　ヴァジェニン, 渡部　有隆","update":"2019/08/09","outline":"This course covers many current topics of interest in software engineering. Some of the topics covered are formal methods to specify requirements of software systems, software reuse, software maintenance, software maintenance models, and evaluation of processes, products, and resources. It includes Advanced Treatment of Selected Software Engineering issues: Software Maintenance, Software Configuration Management, Software Re-engineering, Managing People, Critical Systems Development, User Interface Design and Evaluation, Emerging Technologies like Visual Programming, Security Engineering, and other advanced topics including student presentation topic as well as student engineering topic.","gradingMethod":"Your final grade includes the following parts1). All Lab Exercises: 50 points in total including:* Presentation Topic: 20 points* Engineering Topic: 30 points     - All reports submitted: 20 points     - The GUI Interface designed:10 points2). Midterm Test: 25 points3). Final Exam: 25 points","reference":"The course instructor Alexander Vazhenin has practical working experience. He worked for the Computer Center of Siberian Division of the Russian Academy of Sciences for 15 years where he was involved in R&D of software design and operating systems. Based on his experience, he can teach the basics of Software Engineering.1. Course WWW-site: http://sealpv2.u-aizu.ac.jp/2. Software Engineering: A Practitioner's Approach, 4th edition by Roger S. Pressman, publisher: McGraw-Hill3. B.B. Agarwal, S.P. Tayal, M. Gupta, Software Engineering & Testing, Computer Science Series. Class:Lecture,Exercises"},{"title":"SE05 ソフトウェアスタジオ","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"4年","credets":"3.0","instructor":"吉岡　廉太郎, 川口　立喜","update":"2019/08/09","outline":"履修学生でチームを組み、顧客の求めるソフトウェアの開発を行うことを通してソフトウェア工学に対する理解を深める授業です。授業では、顧客から実際に注文を受け、一つの注文を一つの学生チームが受け持ちます。通常5～10名程度のチームになります。各チームは、顧客の要望を聞き取るヒアリングから始め、開発すべきソフトウェアの要件を決定するところから始めます。その後、設計、開発、テストの各開発工程を実施し、第14回授業内で開発作業の概要および成果物の発表を行い、顧客に納品します。各チームには産業界から派遣されるコーチが付き開発実務のアドバイスを行います。毎週教員・コーチに進捗を報告するとともに、必要に応じて顧客と打合せを持ちます。開発の各行程は成果物（ドキュメント類）で管理し、各工程を終了する度に提出していきます。顧客も参加する中間レビューと最終レビューでは、作業時間数、成果物の量、質などを定量的に分析して報告を行います。顧客によって定められた機能と品質を満たし、顧客にとって最良のソフトウェアを提供するため、創造と努力の限りを尽くします。そのため、必要となる新たな知識・技術を身につけたり、なんども修正したりするため、授業外の作業時間は当然発生します。チームを構成する全学生の自主的で主体的な取り組みが必須です。","gradingMethod":"期末試験は行わず、以下の項目で評価する1. 中間レビューと最終レビューでの発表25%2. 成果物（ドキュメントおよびソフトウェア）25%3. 個人レポート 40%4. 活動への参加と貢献度 10%※各学生の貢献度は進捗報告とプロジェクト管理システムで確認する。※評価には顧客とコーチの意見も取り入れる。※個人レポートでは、プロジェクトでの活動・貢献内容やソフトウェア工学とプロジェクトマネジメントの知識・理解に関する質問について論じてもらいます。","reference":"http://borealis.u-aizu.ac.jp/classes/studio/http://u-aizu.ac.jp/enpit/実務経験有り：現役のソフトウェア技術者（30年以上の実務経験）とソフトウェア開発に従事した経験豊富な教員が共同で授業を行います。授業形態：講義,演習"},{"title":"SE06 並列分散コンピューティング","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"3.0","instructor":"マキシム　モズゴボイ","update":"2019/12/12","outline":"Concurrent programs take advantage of modern multicore and multiprocessor machines to implement algorithms that run concurrently (in parallel) to achieve higher performance and better user experience. Distributed computing brings this idea to the next level, dealing with the systems made up of independent computers, linked by a network.At the present time, both concurrent and distributed systems are widespread, due to high popularity of multicore machines and computer networks. However, the design and implementation of such systems and corresponding software remains a challenging task. We have to know how to coordinate independent processes to achieve high performance and avoid common pitfalls.The goal of this course is to introduce the basics of concurrent and distributed systems design and implementation. We will cover a number of classical and modern approaches to this problem, paying special attention to the practical aspects of implementation using Java language.","gradingMethod":"The final grade is based on the following parts:- Exercises (50% of the final score).- Two exams (30% of the final score).- Quizzes on lecture content (20% of the final score).We keep strict deadlines in this course.","reference":"https://tinyurl.com/cds-course"},{"title":"SE07 データベースシステム論","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"3.0","instructor":"サバシュ　バーラ, ウォンミィング　チュー","update":"2019/02/22","outline":"A  model of a data is created in table form. It is matched with aset. The model helps in understanding the users' needs.It helps Programmers and improves design. The course prepares the participants to become system engineers, and software developers.  The first part, explains relationaltheory and query languages for databases. Second part contains a study of database management system.","gradingMethod":"Mid-term Examination(30 points); Two short quizzes (40 points (20 points each))Database Programming Assignments(30 points)","reference":"Books, Course material,  lecture slides and notes recommended by the instructor(s),   will be provided."}],[{"title":"OT01-I ベンチャー基本コース各論 I","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"程　子学, 石橋　史朗","update":"2019/08/09","outline":"本コースは“ベンチャー体験工房「会津IT日新館」”の一環として開講する座学形式の授業です。「会津IT日新館」では、IT教育を特徴とする会津大学が、IT関連企業や地元ベンチャー、自治体と連携し、企業や地域の現場における最新動向や技術課題などをテーマとして扱います。これにより、イノベーションに挑戦する精神と技術力を持つ、創業意識の高い若手人材を育成することを目的としています。本コースでは、ベンチャー精神育成に必要な技術の習得を目指す知識編の講義と、各分野で活躍している外部講師による講義を交互に行うことにより、実践的なビジネス知識が習得できるように構成されています。","gradingMethod":"以下の項目をもとに評価します。　・毎回の授業において提出する課題シート　50 %　・ビジネスプランレポート 25%　・期末試験   25%","reference":"実務経験あり（石橋）：富士通株式会社に26年間勤務し、システム開発やビジネス推進活動に従事してきた。この経験をもとに、各界の外部講師とともにイノベーション創出について教授する。授業形態：講義"},{"title":"OT01-II ベンチャー基本コース各論 II","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"程　子学, 石橋　史朗","update":"2019/08/09","outline":"本コースは“ベンチャー体験工房「会津IT日新館」”の一環として開講する座学形式の授業です。「会津IT日新館」では、IT教育を特徴とする会津大学が、IT関連企業や地元ベンチャー、自治体と連携し、企業や地域の現場における最新動向や技術課題などをテーマとして扱います。これにより、イノベーションに挑戦する精神と技術力を持つ、創業意識の高い若手人材を育成することを目的としています。本コースでは、ベンチャー精神育成に必要な技術の習得を目指す知識編の講義と、各分野で活躍している外部講師による講義を交互に行うことにより、実践的なビジネス知識が習得できるように構成されています。","gradingMethod":"以下の項目をもとに評価します。　・毎回の授業において提出する課題シート　50 %　・期末試験   50%","reference":"実務経験あり（石橋）：富士通株式会社に26年間勤務し、システム開発やビジネス推進活動に従事してきた。この経験をもとに、各界の外部講師とともにイノベーション創出について教授する。授業形態：講義"},{"title":"OT02-1 ベンチャー体験工房 1","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"荊　雷, 程　子学","update":"2019/02/06","outline":"テーマ：　モノのネットワーク化で安全・安心・便利な生活環境の実現ウェアラブルセンシング、BLE通信、マイコン処理などユビキタス技術を用いた健康増進、生活支援、危険防止のための組み込みシステムの研究開発を行っていきます。具体的に、センサーを体の適切な場所に付けて、高齢障害者をはじめ、利用者の動作をキャッチし、家電の制御、緊急時のコール、災害時の安否確認など、物や人とのコミュニケーションを実現し、利用者の生活をサポートします。","gradingMethod":"出席率、取り組みの積極性、最終発表などによります。"},{"title":"OT02-2 ベンチャー体験工房 2","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"出村　裕英, 平田　成, 小川　佳子, 本田　親寿, 北里　宏平, 奥平　恭子, 石橋　史朗","update":"2019/02/20","outline":"テーマ：　宇宙リモートセンシングデータの利活用宇宙からのリモートセンシングデータを利活用した課題解決型学習(PBL)を行う。各国宇宙機関から提供されているオープンデータやサービスを出発点とする。履修生はデータキュレーションとソフトウエア開発の２グループに分かれて、互いに成果をキャッチボールしながら進め、成果発表会を行う。深宇宙探査データ、地球観測データ、測位情報などを対象とし、「はやぶさ／はやぶさ２(小惑星)」・「かぐや(月)」・「国際宇宙ステーションたんぽぽ」および将来火星衛星探査等ミッションでの利用も視野に入れる。新たな価値の付与と配信、アイデアを形にする段階から実際のソフトウエア開発までを体験し、会津大学発ソフトウエアのブランディングも目指す。 文部科学省宇宙航空科学技術推進委託費（人材育成）の補助を受けて実施する。","gradingMethod":"試験は実施しない。中間・最終発表と成果物で行う。","reference":"https://www.facebook.com/SpaceSoftUoA/"},{"title":"OT02-4 ベンチャー体験工房 4","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"白　寅天","update":"2019/02/11","outline":"Title: 機械学習とディープラーニングによる自然言語と状況認識システム(System for Natural Language Processing and Situation Awareness by Machine Learning and Deep Learning)Chat bot, natural lanaguage machine translation, text classification, image and speech recognition, and many other applications to act like human have been developed by AI technique such as deep learning.In this course, using machine learning and deep learning, text classification and natural language processing will be studied.","gradingMethod":"1. Term Project: 90% (Detailed contents will be explained in the class.)2. Attendance: 10%","reference":"* Reference1. Steven Bird, Ewan Klein, Edward Loper, Natural Language Processing with Python - Analyizing Text with the Natural Language Toolkit, O'Reilly2. P. Tan, M. Steinbach, V. Kumar, Introduction to Data Mining: Pearson New International Edition, Pearson New International Edition3. Tensorflow, https://www.tensorflow.org/?hl=ja"},{"title":"OT02-5 ベンチャー体験工房 5","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"朱　欣, 裴　岩","update":"2019/08/09","outline":"大腸がんは、日本人のがん罹患率第１位、死亡率第２位である。更に、社会高齢化により、大腸がんの罹患率、死亡率が更に増えると考えられる。大腸がんは80-90%が大腸ポリープから発症するため、大腸ポリープを早期に発見し、切除すれば、大腸がんの発症率が半分以下に減少できることが報告された。大腸内視鏡検査は大腸ポリープ、大腸がん診断のゴールデンスタンダードだが、20-25%の大腸ポリープが見落とされると報告された。大腸内視鏡医の精神的・肉体的負担は大きい。従来、コンピュータ診断支援システムによる大腸内視鏡検査医の負担軽減は試みられてきたが、実用化されてはいない。","gradingMethod":"試験は実施しない。中間・最終発表と成果物で評価を行う。","reference":"http://bitlab.u-aizu.ac.jp/https://www.fmu.ac.jp/amc/byouin/shinryouka/shouchou.html実務経験有り：The course instructor Xin Zhu has practical working experiences. He had performed biomedical image processing at Tianjin University for 5 years, and has performed biomedical image processing at the University of Aizu for 15 years with the financial support from universities and JSPS. Based on his experiences, he can teach this course.授業形態：講義"},{"title":"OT02-6 ベンチャー体験工房 6","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"吉岡　廉太郎, 星野　隆之（日本ユニシス）","update":"2019/08/09","outline":"ベンチャー体験工房では、地域や企業の抱える課題やニーズを把握の上、自分の意思でテーマを設定・選択し、そのテーマに関連して、テクノロジベンチャーへの発展を意識しながら、新製品・新サービスにつながる研究・開発の擬似体験をする。指導担当教員と協力企業が互いに連携することにより、開発の進め方、ビジネス化への試み等について産学官・さらには地域の視点から助言します。　この工房は、「開発プロジェクト入門」と「開発プロジェクト実践」の２つで構成されます。「開発プロジェクト入門」は夏期休暇に実施する集中講義です。なお、2019年度は8月26日～30日の間で実施する予定ですが、今後変更する場合があります。6月頃に決定して履修者に連絡する予定です。一方、「開発プロジェクト実践」は後期（10月～1月）に実施します。　開発プロジェクト入門では、研究・開発活動の初学者に対して、判り易いテーマを取り上げ、研究・開発プロセスを体験し、理解してもらうことを主とします。　開発プロジェクト実践では、開発プロセスを理解した受講生を対象に、より実践的なテーマを取り上げ、開発するシステムの発案を含めて開発プロセスを実践してみることを主とします。","gradingMethod":"課題の完成度に基づき評価します（プロジェクト計画、要件定義等、顧客と合意した内容を充足させている度合いにより完成度を判断する）","reference":"https://u-aizu.ac.jp/enpit実務経験有り：現役のソフトウェア技術者（30年以上の実務経験）とソフトウェア開発に従事した経験豊富な教員が共同で授業を行います。授業形態：講義"},{"title":"OT02-7 ベンチャー体験工房 7","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"石橋　史朗, サバシュ　バーラ","update":"2019/08/09","outline":"テーマ：　ビジネスアナリティクス － データサイエンス実践分析演習最先端の職業として今、大きな注目を集める“データサイエンティスト”（高度な統計スキルでデータを解析するプロフェッショナル）。米ハーバード・ビジネス・レビュー誌が「２１世紀で最もセクシーな職業（The sexiest job of the 21st century）」と表現したこともあり、職業の名称として広く知られるようになりました。日本国内でも、データ分析スキルを持った人材に対する市場ニーズが、昨今非常に高まっています。本講義は、世界最大のコンサルティング企業であるアクセンチュア株式会社の現役コンサルタントによる、実践型分析演習講座です。データ分析の基礎知識から、ハッカソンなどに応募できる分析スキルの修得、そして就職活動にも直結するロジカルシンキング、プレゼンテーションスキルの修得を目指します。","gradingMethod":"授業への貢献度、演習発表の内容により評価します","reference":"実務経験あり（石橋）：富士通株式会社に26年間勤務し、システム開発やデータ解析作業に従事してきた。この経験をもとに、ビジネスアナリティクスの基礎について教授する。授業形態：講義"},{"title":"OT02-9 ベンチャー体験工房 9","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"陳　文西","update":"2019/08/09","outline":"「快風」とは、浴槽内に埋め込まれた複数の電極により日頃入浴中の心電信号を自動的に測定・蓄積・解析・表示するシステムを指す。本工房は入浴者を妨げず、入浴中の心電信号を自動的に計測し、長期に亘って大量なデータを蓄積し、生体信号の特有な処理・解析手法を用い、アルゴリズム（雑音除去、特徴点検出、健康状態変動解析など）を開発する一連のプロセスを通じて、生体情報学の基礎知識と応用実技を学びながら、ビッグデータ、人工知能、IoTなど最新技術の日常健康管理における応用を体験する。","gradingMethod":"最終成果物による評価","reference":"コースインストラクターは実務経験があり、世界有名な医療機器の専門メーカーである日本光電工業株式会社に5年間勤務し、生体計測、信号処理およびデータ解析の研究開発に携わってきた。この経験を基に、本工房において、生体信号の計測から信号処理・データ解析までの一連のプロセスを通じて、生体情報工学の基礎知識と最新技術を教授する。関連サイト　http://bitlab.u-aizu.ac.jp研究棟廊下展示ポスターも参照授業形態：講義"},{"title":"OT04 情報処理試験対策講座","semester":"2019年度／Academic Year\n            　集中\n              ／Intensive course","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"渡部　有隆, 小平　行秀, 奥山　祐市","update":"2019/02/15","outline":"「情報処理技術者試験」に対して、その対策講座を試験直前の期間に集中的に開催する。実践的な試験対策とするために、試験対象分野の講義と試験問題の演習及び宿題を交互に行いながら授業を進める。講義内容はIPA情報処理技術者試験の出題範囲及び分類に基づいている。","gradingMethod":"最終的な目標は試験に合格することであるため、評価は課題の提出率（正答率ではない）のみで行う。","reference":"http://arena.u-aizu.ac.jp/Arena/"},{"title":"OT05 キャリアデザインI","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"束原　恒夫","update":"2019/02/01","outline":"「キャリアデザインⅠ：自分・社会を知る」1.将来の自分の生き方や働き方、自分の特徴や強み、社会で必要とされる力、社会の動きや課題について、ワーク、産業界の関係者との意見交換等を通じて、勉強していきます。2.就職活動や進路決定のための「キャリアデザインⅡ：企業を知る」授業の入口にあたる授業です。","gradingMethod":"振り返りシート、グループでの成果報告と取組姿勢を踏まえて総合的に評価します。評価の配点は以下とします。(1)毎回授業終了後に提出する「振り返りシート」（５０％）(2)グループでの成果報告内容と取組姿勢（５０％）"},{"title":"OT06 キャリアデザインII","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"3年 \n                  ,\n                  4年","credets":"1.0","instructor":"束原　恒夫","update":"2019/08/26","outline":"「キヤリアデザインⅡ：企業を知る」１社会で働く意味、自分の強みや弱み、社会や産業界の動向、コンピュータ理工学と産業界との関係、必要とされる人材像等について、産業界の最前線で働いている関係者との意見交換を通じて、勉強していきます。２企業、公共団体等への就職活動や進路決定に関する手続き、自己分析、業界研究、エントリー、筆記試験、面接などの就職活動対策を行い、第一志望の内定獲得を目指します。","gradingMethod":"振り返りシート、レポート内容と取組姿勢を踏まえて総合的に評価します。評価の配点は以下とします。①毎回授業終了後に提出する「振り返りシート」（５０％）②自己分析・キャリアに関するレポート内容と取組姿勢（５０％）"},{"title":"OT08 TOEIC準備コース(Level A)","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"桑田　カツ子","update":"2019/03/08","outline":"This is a TOEIC preparation course for university students. This course is designed for students to familiarize themselves with the TOEIC test format and to improve their listening and reading skills. Through instructions and practice, students will be able to comprehend basic communications in English in daily life. By the end of the semester, students will obtain a good amount of vocabulary and get enough practice in English grammar and have a good understanding of TOEIC test format to reach TOEIC score 400.","gradingMethod":"Vocabulary quizzes 30%Words and Phrases Test 30%Class participation 40%＊授業に出席し、その内容を吸収してスコアアップにつなげることが一番大切なことである。"},{"title":"OT08 TOEIC準備コース(Level B)","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"桑田　カツ子","update":"2019/03/08","outline":"This is a TOEIC preparation course for university students. This course is designed for students to familiarize themselves with the TOEIC test format and to improve their listening and reading skills. Through instructions and practice, students will be able to comprehend communications in English in work place and daily life. By the end of the semester, students will obtain a good amount of vocabulary and get enough practice in English grammar and have a good understanding of TOEIC test format to increase their TOEIC score.","gradingMethod":"Quizzes 30%Words & Phrases Test 30%Class participation 30%Assignments 10%"},{"title":"OT10 課外活動コース II＜インターンシップIII（大連）＞","semester":"2019年度／Academic Year\n            　集中\n              ／Intensive course","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップI（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、インターンシップ科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"実務経験有り（光永）：株式会社富士総合研究所にて３年間勤務、システム開発及び社内教育に携わってきた。その経験に基づいてインターンシップについて教授する。授業形態：講義,演習"},{"title":"OT10 課外活動コースII＜インターンシップII（国内A）＞","semester":"2019年度／Academic Year\n            　集中\n              ／Intensive course","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップⅠ（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"実務経験有り（光永）：株式会社富士総合研究所にて３年間勤務、システム開発及び社内教育に携わってきた。その経験に基づいてインターンシップについて教授する。授業形態：講義,演習"},{"title":"OT10 課外活動コースII＜インターンシップII（国内B）＞","semester":"2019年度／Academic Year\n            　集中\n              ／Intensive course","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップⅠ（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"実務経験有り（光永）：株式会社富士総合研究所にて３年間勤務、システム開発及び社内教育に携わってきた。その経験に基づいてインターンシップについて教授する。授業形態：講義,演習"},{"title":"OT10 課外活動コースII＜インターンシップII（国内C）＞","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップⅠ（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"実務経験有り（光永）：株式会社富士総合研究所にて３年間勤務、システム開発及び社内教育に携わってきた。その経験に基づいてインターンシップについて教授する。授業形態：講義,演習"},{"title":"OT10 課外活動コースII＜インターンシップII（国内D）＞","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップⅠ（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"実務経験有り（光永）：株式会社富士総合研究所にて３年間勤務、システム開発及び社内教育に携わってきた。その経験に基づいてインターンシップについて教授する。授業形態：講義,演習"},{"title":"OT10 課外活動コースII＜インターンシップI（地域A）＞","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップⅠ（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"実務経験有り（光永）：株式会社富士総合研究所にて３年間勤務、システム開発及び社内教育に携わってきた。その経験に基づいてインターンシップについて教授する。授業形態：講義,演習"},{"title":"OT10 課外活動コース II＜インターンシップIII（シリコンバレーA）＞","semester":"2019年度／Academic Year\n            　集中\n              ／Intensive course","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"2.0","instructor":"光永　祐司","update":"2019/08/09","outline":"インターンシップ科目は、国内外の企業における現場体験をもとに、グローバルに活躍できる素養を身に付けることを目的とします。これにより、スーパーグローバル大学の取組み目標である「世界で活躍する革新的 ICT人材の育成」を目指します。インターンシップ科目では、その内容に応じて以下の3つの科目を提供します。　・インターンシップⅠ（地域）：地域企業やベンチャーでのインターンシップを行う科目　・インターンシップII（国内）：国内企業でのインターンシップを行う科目　・インターンシップIII（海外）：海外研修や海外企業でのインターンシップを行う科目各科目は、「事前研修」「実習」「事後研修」の３つのパートからなり、「事前研修」と「事後研修」を学内において講義・演習形式で実施し、その間の期間で各研修先の現場において「実習」を行います。「実習」については、インターンシップ科目毎に用意されたメニューの中から、各自選択により実施内容（研修場所）を決めます。","gradingMethod":"以下の項目をもとに評価します。・事前研修および事後研修の取組み状況（事前の計画書提出・事後の報告書提出）50%・実習期間の取組み状況（実習期間中の報告書提出）50%なお実習期間の取組み状況に関しては、受入れ先による評価も考慮します。","reference":"特になし。 授業形態：講義､演習"}],[{"title":"IE01 システム総合演習 I","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"3年","credets":"3.0","instructor":"齋藤　寛, 小平　行秀, 荊　雷","update":"2019/01/29","outline":"(ICTGクラスの担当は荊雷先生です。)Raspberry Piは、教育用途に開発された安価な基板で、Linuxの下、プログラム開発、センサーやアクチュエータとの連携、および深層学習など様々なことに利用することができる。そのため、ソフトウェア、ハードウェアを含んだコンピュータシステムを理解する上では最も適した教材の一つで、世界中の様々なところで利用されている。","gradingMethod":"演習課題1-6 42% 演習課題7 58%","reference":"林、”ラズベリーパイで遊ぼう!”、ラトルズ"},{"title":"IE02 システム総合演習 II","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"3年","credets":"3.0","instructor":"富岡　洋一, 中里　直人, 奥山　祐市","update":"2019/02/15","outline":"(ICTGクラスの担当は奥山先生です。)本演習ではField-Programmable Gate Array (FPGA)を利用した組込みシステム開発について学びます．FPGAはユーザが論理や配線を自由に変更できる集積回路で，設計した回路を現場ですぐにFPGA上に実装し検証することが可能です．製造後には論理や配線が固定化されてしまうApplication Specific Integrated Circuit (ASIC)に比べて，FPGAはエンジニアリングコストと開発期間を削減できることが知られています．組込みシステムではマイコンが良く用いられますが，音声処理，画像処理等のように計算量が多いアプリケーションでは多くの場合マイコンだけでは十分な速度を実現できません．このようなとき，FPGA上にターゲットアプリケーションを大規模並列処理する専用回路を実装することで，消費電力は低く保ちつつリアルタイム処理を実現します．このため，今日の組込みシステム開発ではFPGAはマイコンと並んで必要不可欠なデバイスとなっています．本演習ではスイッチ，LEDの制御や画像処理を題材に，ソフトウェアとハードウェアを合わせた組込みシステム開発を基礎から学んでいきます．","gradingMethod":"レポート100%","reference":"圓山 宗智，完全版 FPGA電子工作オールインワン・キット (トライアルシリーズ) 単行本，CQ出版小林 優，FPGAボードで学ぶ組込みシステム開発入門 [Intel FPGA編] 改定2版，技術評論社"},{"title":"IE03 ソフトウェア総合演習 I","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"3年","credets":"3.0","instructor":"渡部　有隆, 西舘　陽平, 朱　欣, コンスタンティン　マルコフ","update":"2019/08/09","outline":"ソフトウェア開発は、ソフトウェアに求められる要件（機能）を理解し、要件を満たす設計を行い、設計通りにソフトウェアを構築する総合的な活動です。これらの活動を適切に行うには、プログラミングやソフトウェア工学はもとより、さまざまな知識と技術を組み合わせながら開発を推進する実践的な能力が必要となります。ソフトウェア総合演習では、学生が2-3人のチームで与えられた課題を解決するソフトウェアの開発を通してソフトウェア開発の実践的な能力を身につけます。課題は授業の始めにチーム毎に指定され、3週間1フェーズで段階的に開発を行い、中間レビューでの進捗報告と最終レビューでの成果報告を行います。また、同じ課題に取り組むチーム間で成果物の性能を競い合います。また、開発作業はツールを使って計画・管理し、開発過程を記録する方法を実践します。ソフトウェア総合演習Ⅰでは1～2年までに学んだ各科目の内容を使った総合的なソフトウェア開発を実施します。開発の内容は、データ演算を中心としたソフトウェアを対象とし、適切なデータ構造やアルゴリズムの選択と実装を意識した開発を行います。","gradingMethod":"以下の項目で評価します。1. 各レビュー（中間と最終）での発表25%2. 成果物（ドキュメントおよびソフトウェア）40%3. 期末試験（個人面談） 25%4. 活動への参加と貢献度 10%※成果物の評価では、要件の充足率（機能の有無と精度）、性能、創造性、新規性を評価します。※各学生の貢献度は活動への取り組み姿勢と各レビューの内容および開発記録で確認します。※期末試験の形態と内容については授業の開始時に改めて定めますので確認してください。","reference":"Prof. Zhu has working experiences. He has collaborated with somecorporations in the research and development of algorithms for the softwareof signal and image processing since 2003. In 2003-2016, he developedalgorithms for ECG signal processing with Nihon Kohden and ECG TechnologyCorp. In 2013-2015, he developed algorithms for sleep monitoring with AsahiDenshi Corp. Now he is developing image processing algorithms for endoscopywith Fujifilm Corp.※準備中授業形態：演習"},{"title":"IE04 ソフトウェア総合演習 II","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"3年","credets":"3.0","instructor":"吉岡　廉太郎, ピエール－アラン　ファヨール, 王　軍波, マキシム　モズゴボイ","update":"2019/08/09","outline":"ソフトウェア開発は、ソフトウェアに求められる要件（機能）を理解し、要件を満たす設計を行い、設計通りにソフトウェアを構築する総合的な活動です。これらの活動を適切に行うには、プログラミングやソフトウェア工学はもとより、さまざまな知識と技術を組み合わせながら開発を推進する実践的な能力が必要となります。ソフトウェア総合演習では、学生が3-4人のチームで与えられた課題を解決するソフトウェアの開発を通してソフトウェア開発の実践的な能力を身につけます。課題は授業の始めにチーム毎に指定され、3週間1フェーズで段階的に開発を行い、中間レビューでの進捗報告と最終レビューでの成果報告を行います。同じ課題に取り組むチーム間で成果物を競い合います。また、開発作業はツールを使って計画・管理し、開発過程が常に明らかになるよう実践します。ソフトウェア総合演習Ⅱでは1～3年前期までに学んだ各科目の内容を使った総合的なソフトウェア開発を実施します。開発の内容は、ソフトウェア総合演習Ⅰで取り組んだ内容に加え、オブジェクト指向による設計、データベースの利用、ユーザインタフェースを含む課題に取り組みます。","gradingMethod":"以下の項目で評価します。1. 各レビュー（中間と最終）での発表25%2. 成果物（ドキュメントおよびソフトウェア）40%3. 期末試験（個人面談） 25%4. 活動への参加と貢献度 10%※成果物の評価では、要件の充足率（機能の有無と精度）、性能、創造性、新規性を評価します。※各学生の貢献度は活動への取り組み姿勢と各レビューの内容および開発記録で確認します。※期末試験の形態と内容については授業の開始時に改めて定めますので確認してください。","reference":"https://ie04-aizu.github.io/実務経験有り：ソフトウェア開発に従事した経験豊富な教員が指導を行います。授業形態：演習"}],[{"title":"TE01 教師入門","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/08/09","outline":"中学校・高等学校の教員免許状の取得に必要な「教職の意義等に関する科目」に対応していますので必修の科目です。「教師入門」も教職課程への導入的性格をもつ科目です。講義を通して、教師（教職）の魅力と困難について理解を深めてほしいと思います。そして、自分が教職に向いているかどうか判断する機会にしてください。","gradingMethod":"グループでレポート作成と発表50％，授業の振り返りカード30％，討議への積極的な参加20％","reference":"秋田喜代美・佐藤学　2015　新しい時代の教職入門 改訂版　有斐閣アルマ　（1900円+税）http://www.mext.go.jp/a_menu/01_h.htm・文部科学省「魅力ある教員を求めて」・文部科学省「教員をめざそう」実務経験あり（小林）：小学校の教諭および学校長として38年の教職経験がある。その経験に基づいて教師の職務について教授する実務経験あり（苅間澤）：高等学校教諭として28年勤務した経験がある。その経験に基づいて教師の職務について教授する授業形態：講義"},{"title":"TE02 教育入門","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/08/09","outline":"中学校・高等学校の教員免許状の取得に必要な「教育の基礎理論に関する科目」に対応していますので必修の科目です。「教育入門」は教職課程への導入的性格をもつ科目です。本講義を通して、よく分かっているつもりの「教育」や「学校」を、「教育とは何だろう」、「学校とは何だろう」と改めて問うてみることで、教育の課題を深く理解できます。学ぶ側から見てきた教育を、教える側から見直す経験は、教師になる際にとても大切なことです。","gradingMethod":"レポート（14回）50％，授業の振り返りカード30％，討議への積極的な参加20％、","reference":"汐見稔幸他　2011　よくわかる教育原理　ミネルヴァ書房実務経験あり（苅間澤）：高等学校教諭として28年勤務した経験がある。その経験をもとに臨床教育学の視点から教育について教授する。授業形態：講義"},{"title":"TE03 教育心理学","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"2年","credets":"2.0","instructor":"蛯名　正司","update":"2019/02/14","outline":"本講義では，子どもが発達する上で教育がどのような役割を果たすのか，発達と教育の相互作用の様相を概説する。また，学習に関する諸理論について紹介し，学習の促進要因・妨害要因について多角的に論じる。","gradingMethod":"討論への参加20%，レポート80%"},{"title":"TE04 教育課程論","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"蛯名　正司","update":"2019/02/14","outline":"教育課程の歴史的変遷，及び幼稚園教育要領から高等学校学習指導要領までを俯瞰し，我が国の教育課程全体を概説する。また，教育課程の編成方法を具体例を通して紹介する。","gradingMethod":"討論への参加20%，レポート80%"},{"title":"TE05 教育方法","semester":"2019年度／Academic Year\n            　4学期集中\n              ／4thQuarter Intensive","corseFor":"3年","credets":"2.0","instructor":"蛯名　正司","update":"2019/02/14","outline":"授業に関する教授理論を概説する。特に，学校現場で重視されている協同活動，ICT，パフォーマンス評価に関して，その具体的な実践例を紹介する。","gradingMethod":"討論への参加20%，レポート80%。"},{"title":"TE06 数学科教育法１","semester":"2019年度／Academic Year\n            　1学期\n              ／First Quarter","corseFor":"2年","credets":"2.0","instructor":"土屋　貴裕, 森　和好, 蛯名　正司","update":"2019/03/08","outline":"中等教育における数学科では，抽象的な数学的概念が複数扱われる。教師は直接授業で取り上げる学習内容だけではなく，関連する学問領域に関して幅広い知識を身につけていなければならない。この授業では，中等教育で扱われる数学的概念の背景となる学問領域に関して，より発展的な内容を扱い，数学教育に必要な素地を育成する。","gradingMethod":"担当教官毎に評価して，それを加算して，成績評価とする。"},{"title":"TE07 数学科教育法２","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"2年","credets":"2.0","instructor":"山﨑　浩三","update":"2019/08/09","outline":"中学校数学科の目標である数学的活動を通しての基礎的・基本的な知識及び技能の習得、数学的に考える力の育成、日常生活への有用性や科学技術との関連性の理解、事象　を数理的に考察できる能力の養成などの内容を理解し、そのための指導内容や指導方法について学習する。　具体的には中学校学習指導要領を主教材として、中学校においての数学学習の本質や数学教育の背景、具体的指導方法などを理解し、様々な授業場面を想定した演習、さらには授業設計の立案方法などを学習する。","gradingMethod":"最終レポート（50％）と授業内小テスト（50％）による総合評価","reference":"実務経験有り：福島県立高校数学科教員及び管理職として３８年間勤務数学科教育法（学術図書出版社）評価規準の作成、評価方法等の工夫改善のための参考資料（中学校　数学）（平成23年11月　文部科学省）高等学校学習指導要領解説　数学編（（予定）平成30年　文部科学省）授業形態：講義"},{"title":"TE08 数学科教育法３","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/02/14","outline":"この授業では、高等学校での数学教育の目標を理解し、数学的活動を通して生徒が事象を数学的に考察し表現する能力の向上、創造性の育成などの質的な学習目標を達成しうるよう指導できる教授法等について学習する。具体的には高等学校学習指導要領を主教材として、高等学校においての数学学習の本質や生徒の認識の特徴、指導における要点などを理解し、評価を踏まえた授業設計の立案方法などを学習し、さらに様々な授業場面を想定した演習を行う。","gradingMethod":"最終レポート（50％）と授業内小テスト（50％）による総合評価","reference":"数学科教育法（学術図書出版社）評価規準の作成、評価方法等の工夫改善のための参考資料（高等学校　数学）（平成24年7月　文部科学省）中学校学習指導要領解説　数学編（（予定）平成30年　文部科学省）"},{"title":"TE09 数学科教育法４","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/02/14","outline":"本講義は教育心理学、学習科学等で蓄積されてきた学習理論、教育理論を中心に取り上げ、数学の学習支援にとって有効な立てを概説する。1コマ目～5コマ目では、数学全般に関連する内容、6コマ目～12コマ目は、特定の数学領域に関する誤概念とその学習支援、13・14コマ目は、21世紀型スキルについて概説する。","gradingMethod":"試験（80%）、討論への参加（20%）","reference":"中学校学習指導要領（平成29年告示　文部科学省）、高等学校学習指導要領（平成30年告示　文部科学省））"},{"title":"TE10 情報科教育法１","semester":"2019年度／Academic Year\n            　2学期\n              ／Second Quarter","corseFor":"3年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/02/27","outline":"この授業は、高等学校教諭免許状「情報」を取得しようとする学生を対象とする。「情報」の教師として、「情報」に関する専門知識・技術のほかに、学習指導要領を理解し、その教科の目標や指導法を知る。本授業においては、共通教科「情報」の指導法について実践的に学ぶ。","gradingMethod":"レポート等の提出物（３０％）、期末試験（７０％）　による","reference":"Webページ　文部科学省　　http://www.mext.go.jp/"},{"title":"TE11 情報科教育法２","semester":"2019年度／Academic Year\n            　4学期集中\n              ／4thQuarter Intensive","corseFor":"3年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/02/27","outline":"＊This course is courses on curriculums and teaching methods about Senior high school 1st-class teaching license (Information)この授業は、高等学校教諭免許状「情報」を取得しようとする学生を対象とする。「情報」の教師として、「情報」に関する専門知識・技術のほかに、学習指導要領を理解し、その教科の目標や指導法を知る必要がある。本授業においては、共通教科「情報科」を学ぶ「情報科教育法１」の継続履修として、専門教科「情報科」の指導法について実践的に学ぶ。","gradingMethod":"レポート等の提出物（３０％）、期末試験（７０％）　による。","reference":"Webページ　文部科学省　　http://www.mext.go.jp/"},{"title":"TE12 道徳教育","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"3年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/08/09","outline":"この授業は中学校教員を目指す際の必修の科目です。また、高等学校教員には必修ではないですが、道徳や市民性の指導が課題となっており、履修することが望ましい科目です。この授業では，道徳教育の意義と役割と各理論を理解します。また，実際に行われている道徳教育の実践を学びます。道徳教育は，教育基本法及び学校教育法に定められた教育の根本精神に基づき，自己の生き方や人間としての生き方を考え，主体的な判断の下に行動し，自立した人間として他者と共によりよく生きるための基盤となる道徳性を育成する教育活動である。","gradingMethod":"レポート（指導案作成）50％，授業振り返りカード30％，討議への積極的な参加20％","reference":"実務経験あり（苅間澤）：高等学校教諭として28年勤務した経験がある。その経験に基づいて，道徳及び道徳の指導法について教授する授業形態：講義"},{"title":"TE13 特別活動","semester":"2019年度／Academic Year\n            　4学期\n              ／Fourth Quarter","corseFor":"3年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/08/09","outline":"本学で中学校あるいは高校の教員免許を取得しようとする場合，この授業は必修科目です。　中学校を例にすると，学習指導要領には「各教科」と「道徳」，「総合的な学習の時間」，「特別活動」が教育課程に含まれることが示されています。この授業では「特別活動」の指導法に関して学びます。特別活動は，学校における様々な構成の集団での活動を通して，課題の発見や解決を行い，よりよい集団や学校生活を目指して様々に行われる活動の総体です。学校教育全体における特別活動の意義を理解し，特別活動の特質を踏まえた指導に必要な知識並びに素養を身につける。","gradingMethod":"事前レポート50％，授業振り返りカード30％，討議への積極的な参加20％","reference":"文部科学省　高等学校学習指導要領解説　特別活動編実務経験あり（苅間澤）：高等学校教諭として28年勤務し，学級担任としてLHR（ロング・ホーム・ルーム）を運営した経験がある。その経験に基づいて特別活動について教授する授業形態：講義"},{"title":"TE14 生徒指導・教育相談","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/08/09","outline":"本学で中学校あるいは高校の教員免許を取得しようとする場合，この授業は必修科目です。　生徒指導と教育相談は，一人ひとりの児童生徒の人格を尊重し，個性の伸長を図りながら，社会的資質及び行動力を高めることを目指して教育活動全体を通じて行われる，学習指導と並ぶ重要な教育活動であることを理解し，基本的な考え方や技法を身につける。","gradingMethod":"レポート50％，授業振り返りカード30％，討議への積極的な参加20％","reference":"実務経験あり（苅間澤）：高等学校教諭として28年勤務し，教育相談や生徒指導の業務に当たった経験がある。その経験に基づいて教授する授業形態：講義"},{"title":"TE15 キャリア教育","semester":"2019年度／Academic Year\n            　2学期集中\n              ／2ndQuarter Intensive","corseFor":"3年","credets":"2.0","instructor":"菊地　則行","update":"2019/02/06","outline":"キャリア教育は進路選択の基礎となる資質・能力を発達させることを目的としている。進路選択とは学校・仕事の選択を含む人生の選択である。この授業では、キャリア教育の基礎理論、教育課程における位置づけ、実践の具体例について講義する。","gradingMethod":"キャリア教育実践の指導方針・計画についてのレポートで評価する"},{"title":"TE16 教育実習１","semester":"2019年度／Academic Year\n            　通年\n              ／Yearlong","corseFor":"4年","credets":"4.0","instructor":"苅間澤　勇人, 蛯名　正司","update":"2019/08/09","outline":"教育実習校での3週間の実習。中学校一種、または中高両方の免許取得希望者は教育実習１(実習校で 3週間の実習）、高校一種のみの免許 取得希望者は教育実習２（実習校で2週間の実習）を履修登録すること。","gradingMethod":"実習校から提出された所見を参考にする。","reference":"実務経験あり（苅間澤）：高等学校教諭として28年勤務し，数学や情報の授業実践や校務分掌などの経験がある。その経験に基づいて教職について教授する。授業形態：講義"},{"title":"TE17 教育実習２","semester":"2019年度／Academic Year\n            　通年\n              ／Yearlong","corseFor":"4年","credets":"2.0","instructor":"苅間澤　勇人, 蛯名　正司","update":"2019/08/09","outline":"高校一種のみの免許の取得希望者が対象の教育実習であり，教育実習校で２週間の実習を行う。（なお，中学校一種または中高両方の免許の取得希望者は，教育実習１を履修してください。）","gradingMethod":"実習校から提出された所見を参考にする。","reference":"実務経験あり（苅間澤）：高等学校教諭として28年勤務し，数学や情報の授業実践や校務分掌などの経験がある。その経験に基づいて教職について教授する授業形態：講義"},{"title":"TE18 教育実習事前事後指導","semester":"2019年度／Academic Year\n            　1学期・2学期\n              ／1st & 2nd Quarter","corseFor":"4年","credets":"1.0","instructor":"苅間澤　勇人, 蛯名　正司","update":"2019/08/09","outline":"本授業の履修は，すでに教育実習校の配属が決定していることが前提である。本授業は、教育実習を実りあるものにすることをねらいとして，教育実習の準備（事前指導）と反省（事後指導）のために開講される。","gradingMethod":"授業毎の小レポート20％，討議への積極的な参加20％，最終レポート60％","reference":"実務経験あり（苅間澤）：高等学校教諭として28年勤務した経験がある。その経験をもとに，教育実習の心構えなどについて教授する。授業形態：講義"},{"title":"TE19 教育制度論","semester":"2019年度／Academic Year\n            　4学期集中\n              ／4thQuarter Intensive","corseFor":"2年","credets":"2.0","instructor":"苅間澤　勇人","update":"2019/08/22","outline":"The purpose of this course is to understand Japanese educational systems from view point of Educational Administrations and Finance Studies.","gradingMethod":"Term paper 100 %"},{"title":"TE20 教職実践演習（中・高）","semester":"2019年度／Academic Year\n            　3学期\n              ／Third Quarter","corseFor":"4年","credets":"2.0","instructor":"苅間澤　勇人, 土屋　貴裕, 森　和好, 蛯名　正司","update":"2019/08/09","outline":"教員として必要な資質能力についての修得状態を、使命感・責任感・教育的愛情、社会性・対人関係能力、生徒理解と学級経営、教科内容の指導力の４つの視点から、総合的に把握し指導する。その際、事例研究、ロールプレイイング、グループ討議、模擬授業などの方法を適宜使用する。","gradingMethod":"レポート（各教員ごとに課す）50％授業への関与（討論、資料作成などへの関与） 50％","reference":"実務経験あり（苅間澤）：高等学校教諭として28年勤務し，学級担任として学級経営の経験がある。その経験に基づいて学級経営について教授する授業形態：講義"}],[{"title":"OT03-001 大規模分散Webインフラ構築入門","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"阿部　泰裕","update":"2019/08/09","outline":"一般的にWebシステムは3層モデルに対応するWebフロントエンド、データベース、アプリケーションロジックを実行するサーバー等を備えている。実際のシステムは上記に加えて、共通認証基盤、外部システムとの連携機能、負荷分散装置、高可用性機能、テスト・開発環境などの総合的な機能を持ち、互いに連携して稼動している。このため1台のコンピュータを使用する場合と異なり、比較的大規模なシステムを構築・理解するためには、様々な周辺知識・技術が必要となる。このプロジェクトでは、総合的なWebインフラ基盤とその管理を取り扱う。演習として負荷分散・高可用性機能、管理の自動化(Orchestration)などの構築や活用を検討する。その他、比較的大規模なWebアプリケーションを開発・運用するために必要な知識の習得を目指す。","gradingMethod":"成績の評価は以下の観点にもとづいて実施する。より具体的な項目は1回目の冒頭にシラバスと共に周知します。1. 計算機科学とITC利活用に関連した情報収集を日常的に行なえること2. コンピュータの利用において、特に、Raspberry Pi等のシングルボードマイコンを対象として、必要な準備と活用ができること3. 会津大学のネットワーク環境について、公開された情報を元に構成を理解・説明できること4. (個人が所有するコンピュータと比較して)大規模なコンピューティング環境を管理・運営する上での特性を理解していること5. (4)の上で求められる技術的要素について概要を理解していること6. 最近の事象等について、自分の考えを表明できること7. 学んだ事を元に、自ら実践し説明できること","reference":"http://web-int.u-aizu.ac.jp/~yasu-abe/ja/sccp/edwi/(実務経験有り:外資系コンピュータメーカーで社内/社外システムの設計・管理に関わった経験有り。Kubernetesなどの最近のトピック・傾向を加えて実施する)授業形態：講義"},{"title":"OT03-002 月惑星データ解析＆国際宇宙ステーションたんぽぽプロジェクト","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"出村　裕英, 平田　成, 小川　佳子, 北里　宏平, 本田　親寿, 奥平　恭子","update":"2019/08/09","outline":"本プロジェクトでは、これまでに得られた小惑星・月惑星の画像や形状データに基づくデータの可視化処理を体験し、月惑星探査を身近に感じられるような手ほどきを行う。また、国際宇宙ステーションたんぽぽ関連の活動も班を分けて行う。ベンチャー体験工房no.2「宇宙リモートセンシングデータの利活用」とも連携した活動を行う。次の３つのパートで構成する。＜施設見学会＞筑波宇宙センターおよび近隣研究所、JAXA相模原キャンパス等の施設見学を履修学生の希望を募って土休日に日帰りで実施する。＜観望会・講演会＞希望者のみ、定時外に本学天文台望遠鏡による月惑星等の観望会を行う。学外講師による講義・実習や、ハッカソン等の月惑星探査に関わるようなイベントや活動にもチームで参加する。＜座学とデータ解析実習＞通年学期中、深宇宙探査機リモートセンシングデータの解析や、iPhone/iPadアプリ開発等を手がける。内容は画像処理工学・コンピュータビジョンと関連するが、新入生であっても受講可能な範囲を想定している。SCCP時間に演習室で行う。＜国際宇宙ステーションたんぽぽ計画参画＞たんぽぽ計画（https://www.wakusei.jp/book/pp/2011/2011-2/2011-2-117.pdf）は国際宇宙ステーション・日本実験棟で有機物／微生物の宇宙暴露と宇宙塵・微生物の捕集を目的とした日本の宇宙ミッションです。国際宇宙ステーションは名前の通り国際的で、海外研究者を含めた複数の研究機関・大学とも連携した活動となるため、教育的効果の大きいプロジェクトベースドラーニングとなります。実際にJAXAの宇宙ミッションに関わることができる、またとない機会です。宇宙に興味があって実際に手を動かすことに興味と熱意のある学生さんであれば十分可能です。","gradingMethod":"レポート、クラス活動（プレゼン、質疑応答）、取り組む姿勢などで総合評価する。","reference":"実務経験有り：JAXA宇宙開発プロジェクト経験者が実施している。ウエブページリンク会津大学発ソフトを世に出そう！　https://www.facebook.com/SpaceSoftUoA/ はやぶさ２　http://www.jaxa.jp/projects/sat/hayabusa2/　たんぽぽ計画　http://logos.ls.toyaku.ac.jp/~lcb-7/tanpopo/introduction.html　会津大学ARC-Space　http://www.u-aizu.ac.jp/research/caist/arc-space/　国立天文台、ほしぞら情報２０１９　http://www.nao.ac.jp/astro/sky/2019/大学附属図書館で閲覧できる参考資料（画像処理工学）　リモートセンシング工学の基礎（森北出版）　画像処理標準テキストブック（画像情報教育振興協会）　C言語による画像処理プログラミング入門（昭晃堂）　詳解 OpenCV ―コンピュータビジョンライブラリを使った画像処理・認識（オライリー）（月の基礎知識）　月のきほん（誠文堂新光社）　最新・月の科学（NHKブックス）（太陽系の基礎知識）　星の地図館　太陽系大地図（小学館）　太陽系と惑星　シリーズ現代の天文学（日本評論社）（はやぶさミッション）　はやぶさ : 不死身の探査機と宇宙研の物語（幻冬舎）　小惑星探査機はやぶさの大冒険（マガジンハウス）　私たちの「はやぶさ」 : その時制御室で、何を思い、どう動いたか（毎日新聞社）　　はやぶさパワースポット50（三和書籍）授業形態：講義"},{"title":"OT03-003 天文データを用いたRによる統計解析入門","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"石橋　史朗","update":"2019/08/09","outline":"テーマ：　天文データを用いたRによるデータサイエンス入門最近のIoT (Internet of Things) やオープンデータの普及に伴い、身の回りのデータ量は増大の一途を辿っています。そしてこれらのデータから、さまざまな知見を導き出す「データサイエンス」の分野が社会的にも注目を集め、データサイエンティストの需要も高まってきています。一方、科学の分野では、大量のデータを処理することによって、新たな発見につなげる研究分野が従来から存在しており、遺伝子工学や天文学はその代表例です。このプロジェクトでは、「データサイエンス」で用いられる統計解析手法について学びつつ、天文データを使った実践的な演習を進めていきます。","gradingMethod":"授業への貢献度、演習への取組み状況により評価します","reference":"実務経験あり（石橋）：富士通株式会社に26年間勤務し、システム開発やデータ解析作業に従事してきた。この経験をもとに、データサイエンスの基礎について教授する。授業形態：講義"},{"title":"OT03-004 教師になろう！","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"蛯名　正司","update":"2019/02/14","outline":"本課外プロジェクトは教員採用試験合格に向けた対策課外授業です。ですから，教員採用試験を受験する学生が対象です。合格に向けて一人で学習するよりも、同じ目標をもつ仲間と共に学ぶことを通して、学習効果を高めることが目的です。教師を志す学生さんの未来を応援します。","gradingMethod":"問題演習への取り組み状況","reference":"授業内で紹介します。"},{"title":"OT03-005 異文化リーダーシップトレーニング-理工系学生のための異文化理解及び地域イノベーション","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"川口　立喜","update":"2019/08/09","outline":"この授業は、これからグローバルで活躍するにあたり必要な：　・前期[1学期・2学期]に理工系学生のための異文化理解、　・後期[3学期・4学期]には理工系学生のための地域イノベーション　　について様々な視点から考察していく体験型の授業です。・前期[1学期・2学期]（理工系学生のための異文化理解）：「日本では緑色の信号を青信号というけどなぜ？」という海外の方からの素朴な疑問などを異なる観点で考察し、「初対面の人と話すのはちょっと苦手」という場合の対処法などを様々な場面を想定してトレーニングをし、リーダーシップを発揮できるような資質を向上させる複合的な形式の授業となっています。・後期[3学期・4学期]（理工系学生のための地域イノベーション）：地域資源を活用して新しい価値を生み出し、人々の考えや行動に大きな変化を起こす地域イノベーションを創り出すことは、今日の閉塞感漂う地域社会で非常に重要なことです。しかしながら、課題解決能力を身につけた人材になることだけではそうしたことを起こすための力としては十分ではありません。課題に対して「創造的なプロセスを創り出す力」をもった人材こそが地域イノベーションを　起こすのであり、そうした人材を育てることが重要です。この授業を通して、受講生が地域イノベーションを起こすための創造的なプロセスを生み出せるようになることをゴールとしています。そのために、受講生は方法論（スキルセット）、考え方（マインドセット）、動機づけ（モチベーション）を学びます。スキルセットとは、地域で新しいアイデアを生み出すための方法論をみにつけること。マインドセットとは、地域で新しいアイデアを生み出すことに挑戦するときの考え方。そして、モチベーションとは自分も明日から地域で新しいアイデアを生み出したいと思うにようになる気持ちです。本授業は座学だけでなく、フィールドワーク（現地調査）やアイデア創出のワークショップ、そして現場で活躍する地域イノベーターからのお話しなども伺う複合的な形式の授業となっています。","gradingMethod":"各種プレゼンテーション　　　　　20                            中間プレゼンテーション　　　　　20振り返りシート　　　　　　　　　20課外活動　　　　　　　　　　　　15期末プレゼンテーション、小論文　25","reference":"実務経験有り：海外の大学等で培った見識、異文化体験を最大限に活かすとともに、大学の国際交流業務の充実に貢献し、教職員・学生・地域住民の三者が連携・協働する中でのリエゾン的役割を担っている。会津大学の国際交流（海外留学、留学生支援）：http://www.u-aizu.ac.jp/osip/成長分野を支える情報技術人材の育成拠点の形成（enPiT2)http://www.u-aizu.ac.jp/enpit/授業形態：講義"},{"title":"OT03-006 なんでも手作りプロジェクト","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"北道　淳司","update":"2019/02/04","outline":"このプロジェクトは,いくつかのサブプロジェクトからなります.1つは,1年生を対象に(2年以上も可能)マイコンボードキットを作りながら,電子工作の基礎とマイコンプログラミングの基礎を学びます.ただ作って動作したら終わりではなく,マイコンボードの一部を作っては,プログラムによりLEDやブザーを使って,LEDを制御して時計にしたり,ブザーを制御してメロディーを奏でたりさせることができるようになります.一つは,上記の内容を1年経験した学生のためのサブプロジェクトです.2年生以上が参加可能です．Raspberry piなどより高機能なマイコンやプログラムできるLSI（FPGA）を使って自分の作りたいものを作っていくというプロジェクトです. 3年生はLSIデザインコンテストの参加も視野にいれています．ヘッドホンアンプやスピーカなどのオーディオ機器の製作プロジェクトも含みます．オーディオ機器は実際に使用することを前提としているので，部品代は自腹です．SCCPから若干の補助があります．","gradingMethod":"一年生は，出席を重視します.  2年生以上は，製作物の完成を目指します．","reference":"内容についてはhttp://eslweb.u-aizu.ac.jp/~kitamiti/sccp/を参考にしてください．"},{"title":"OT03-007 プログラム可視化によるC言語学習支援手法","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"黒川　弘国","update":"2019/08/09","outline":"プログラミング言語（即ちコンピュータ言語）がわかると本当の意味での「コンピュータを思いのままに動かす」ことができます。特にC言語は多くの理工系大学で最初に学ぶ本格的なコンピュータプログラム言語で、今後の学習・研究ないし仕事にとって重要な基礎知識です。　しかし一部の初学者はC言語が外国語よりも難しいと感じているようです。その原因の一つがC言語の言葉（プログラム）を掛かられたコンピュータにあります。コンピュータは生の人間と違い、掛けられあ言葉（プログラム）をどのように理解しているかをうまく表現できないのです。我々はC初学者のために学習支援システムPROVITを開発しました。PROVITはコンピュータがCプログラムをどのように理解し動くのかを細かく見せることができます。PROVITは既に多くの公開講座や出張講義で応用されいます。","gradingMethod":"以下の項目で総合評価する。　クラス活動　議論・発表　レポート・課題の完成状況　取り組む姿勢","reference":"実務経験有り：ソフトウェアシステム開発http://cleast.u-aizu.ac.jp/http://web-ext.u-aizu.ac.jp/~aiguo/ext-projects/ext-provit/introduction-0/index-introduction.html 授業形態：講義"},{"title":"OT03-008 Virtual system experiments on human cognition near its threshold","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"イゴール　ルバシェフスキー, マキシム　モズゴボイ","update":"2019/02/22","outline":"The course is aimed at investigation of basic properties of human cognition and decision-making governed by human perception under uncertainty. Experiments based on various simulators like car-driving simulator and balancing of virtual pendulums are the gist of this research.","gradingMethod":"Homework and attending lectures"},{"title":"OT03-009 論理的に","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"森　和好","update":"2019/02/15","outline":"ゼミ形式で、理論的な技術書を輪番で読むことにより、論理的思考の充実を図る。","gradingMethod":"ゼミ内の主体性(70%)、論理的思考の到達度(30%)により定める。"},{"title":"OT03-010 競技用ロボットの開発","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"成瀬　継太郎","update":"2019/02/15","outline":"ロボット技術を学ぶには，理論面はもとより実際に製作することで深い理解が得られる．本課外プロジェクトは，ロボットコンテストに参加することにより，楽しみながらロボットの構造と制御について学ぶ．","gradingMethod":"課外プロジェクト中に説明する．","reference":"なし．"},{"title":"OT03-011 コンピュータを使った音と映像のコンテンツ制作","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"西村　憲","update":"2019/02/15","outline":"本課外プロジェクトではコンピュータを使った映像・音楽といったコンテンツの制作について学ぶ。さまざまなツールを用いて、3次元CG、2次元CG、Flash、MIDI、実写ムービー等のコンテンツを、学生が自主的に企画から制作まで行う。","gradingMethod":"プロジェクトへの貢献度、制作物など"},{"title":"OT03-012 A Peek Inside Computers","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"大井　仁","update":"2019/03/12","outline":".We will provide the students with opportunities for the following experiences:- operating system installation and customization- kernel compilation and modification- peripheral device installation- system virtual machines (Xen, VMWare)- standard benchmark programs (SPEC, EEMBC) ; workloads, run rules, performance metrics - performance profiling tools (oprofile, vmstat, iostat)- heterogeneous multi-core architecture (big.LITTLE) We will also practice to read and write technical documents,which is one of weakest aspects for the University of Aizu students.Reports from past SCCP projects are posted on my course page:http://www.u-aizu.ac.jp/~hitoshi/COURSES/SCCP/","gradingMethod":"Satisfactory/Unsatisfactory (S/U) grade. A student who fails to attend more than 30% of the classes (i.e. four class meetings) and/or does not perform the following (without justifiable reasons)  will receive Unsatisfactory grade: - Tasks assigned for the week and their report at the class meeting on the following week - Reading material assignments- Final report and its presentation","reference":"SCCP course page: http://web-ext.u-aizu.ac.jp/~hitoshi/COURSES/SCCP/You can find the final project reports of past students."},{"title":"OT03-013 自作プロセッサのための電子工作プロジェクト","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"奥山　祐市","update":"2019/02/15","outline":"注意：この授業では「CPU」を自作します！巷に売っているマイコンは使いませんが、もっと高価な機器を使います！みなさんは、WindowsやLinuxをインストールしたパソコンでWebの閲覧や、書類作成/プログラム作成をしたり、3Dグラフィックスを表示できるゲーム機で遊んだりしたことがあると思います。では、この疑問に答えることはできますか？「どうしてコンピュータは動くのか」この大学にいるのであれば、絶対に知っておきたいことですよね。1年生から勉強し初めて（もちろん2〜4年生も歓迎です）、この疑問に答えられるようにするのが、この課外プロジェクトの目的です。初めからWindowsやLinux、ゲーム機などの大きなシステムを理解することは無謀ですので、小さな小さなシステムを理解して、センスを磨き、徐々に大きなシステムに慣れていくことが重要です。","gradingMethod":"コンピュータ制作の楽しさを知ってもらうための授業ですので、テストはありません。自由課題とレポート課題で採点をします。自由課題の採点基準は以下の通りです。-自由課題が提出されている：50点-上に加えて、自分なりの変更がある：70点-上に加えて、有用性が認められる：100点レポート課題の採点基準は以下の通りです- レポートが提出され、回答欄に回答がある：50点-  上に加えて自分なりの工夫がある：70点- 上に加えて、有用性が認められる：100点","reference":"Webブラウザで文字を入力できる人であれば、だれでも参加できます。"},{"title":"OT03-014 マナビーノ　Arduino／Pi","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"大津山　公平","update":"2019/02/22","outline":"コンピュータはあらゆる所で活躍しています。携帯やスマホ、カメラにも。もう全く珍しくなくなりましたね。でも、人間の指示（プログラム）通りにコンピュータが動いて計算してくれる。。。良く考えてみたら凄いことです。それではその「脳」と言うべきコンピュータに、ハードウェア（センサーやモーターなど）を追加して、例えば「暗さに応じてＬＥＤを明るく光らせる」とか「摂氏２度以下になったらブザーで警告する」「手をかざすと表示が変わる正確な時計」「障害物を自動的に避けるミニカー」（以前に作りました）などと言った物を作る事が出来たらどうでしょう？ もっとワクワクしませんか？これまでに以下のような物を作成し、オープンラボや学祭時に展示しました・フラッシュザウルス（光が階段を下りてきて丁度ある段に来た時に飛び降りれば勝ちです）・団扇エアギター（団扇を振ると加速度に応じたギター音が鳴る）・クレーンゲーム・ArduinoとＰＣ，ラジコンカーを組み合わせたシューティングゲーム・５１２個のＬＥＤを８＊８＊８の立方体の格子に配し、光のオブジェを作成そんな事がArduinoやRaspberry PIを使うと簡単に出来るのです。このSCCPではこのArduinoやRaspberry PIを利用して普段使っているPCやWSでは出来ないような事をしたいと思います。興味と情熱を持って頂けるなら学年や知識は問いません。Arduino（アードゥイーノ。。みたいな発音 URL -> http://arduino.cc/）とは「オープンソース ハードウェア」と呼ばれているもので、最小限のマイコンボードです。しかし、このArduinoは無限の可能性を秘めています。特徴としては、・非常に小さい事（手のひらの１／３ぐらい？）・拡張性に優れている（様々な拡張ボードが販売されている）・プログラムが簡単（ＰＣ上でＣ言語に近い言語でプログラム出来る）などが挙げられます。人間の五感と同じようなセンサーや様々な電子部品を接続し、光や音、温度や傾きなどを感じることも出来ますし、ＬＥＤやモーターなども制御出来ます。そして一番、Arduinoの「味噌」であるのが、それらのハードウェアをＣに近いArduino IDE言語で制御出来ると言う事です。(ちなみに同様にArduinoを使用出来るシステムにはProcessingと言うJavaに近い言語もあります。Javaが好きならこちらを選ぶ事も可能です。)ちなみにＬＥＤを１秒おきに１秒光らせるプログラムはこんなに簡単に書くことが出来ます。何だか簡単ですね（無論今は理解出来なくても構いません）なお、このSCCPではRaspberry PI と言うArduinoとほぼ同じ大きさで更に高性能な超小型ＰＣも使用して行く予定です。---------------------------------#define LED 13void setup(){　pinMode(LED, OUTPUT);}void loop(){　digitalWrite(LED, HIGH);　delay(1000);　digitalWrite(LED, LOW);　delay(1000);}---------------------------------Arduinoを使った物づくりを通じてCreativeで柔軟な発想とグループで何かを作り上げるためのコミュニケーション能力を身につけて貰えると良いなあと思っています。","gradingMethod":"・熱心に参加した・活動に貢献した・画期的／斬新な案を出した","reference":"Arduinoのページ　http://arduino.cc/Raspberrry Piのページ　https://www.raspberrypi.org/"},{"title":"OT03-015 人工知能を搭載したラジコンの開発","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"齋藤　寛, 富岡　洋一","update":"2019/01/29","outline":"皆さんの身の周りにはスマートフォン、ノートパソコン、ゲーム機、自動改札機など様々なコンピュータシステムが存在します。このようなコンピュータシステムはどのように実現され、どのように動作しているのか知っていますか？この課外プロジェクトでは、ホビーとして多くの人に愛される「ラジコン」の開発を例に、コンピュータシステムを一から構築することで、「開発環境の構築方法」、「プログラミング」、「ネットワーク通信」、「人工知能」、「ハードウェア設計」といったコンピュータシステムの実現に必要な知識、スキルを基礎から身に着けることを目標としています。","gradingMethod":"発表 50%　普段の活動50%"},{"title":"OT03-016 Advanced Pattern Recognition and Software Development","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"愼 重弼","update":"2019/01/16","outline":"本プロジェクトでは、Pattern Recognition Software開発研究会です。会津大学で授業以外に開発できるSoftwareを考え、開発することを考えています。","gradingMethod":"進行方針・主にプログラミングをしながら、その方法を覚えていく・グループを組み、お互いに協力しながら学んでいく・言語はC, Java, Visual C++, C#, Python など","reference":"http://web-ext.u-aizu.ac.jp/labs/is-pp/pplab/research.html"},{"title":"OT03-017 Korean IT and Culture Study","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"愼 重弼","update":"2019/01/16","outline":"アンニョンハセヨ！2000年代以降に東アジアで起こった韓国大衆文化の流行。日本では2003年頃から韓国ドラマ『冬のソナタ』放送がきっかけとなった。テレビドラマに限らず、映画、音楽、アイドル、料理、言語、文学など、様々な方面に流行が見られ影響が及んだ。韓国のIT,文化や言語に接する機会が多くなっており、会津大学においても体験したいと思い、このプロジェクトを企画しました。","gradingMethod":"出席、課題に取り組む熱意"},{"title":"OT03-018 Practical application & network defense","semester":"2019年度／Academic Year\n            　前期\n              ／First Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"アレクサンダー　ヴァジェニン","update":"2019/02/12","outline":"Computer security is the protection of information systems from theft or damage to the hardware, the software, and to the information on them, as well as from disruption or misdirection of the services they provide. It includes controlling physical access to the hardware, as well as protecting against harm that may come via network access, data and code injection, and due to malpractice by operators, whether intentional, accidental, or due to them being tricked into deviating from secure procedures. In computer security, there is a competition called CTF (Capture The Flag). CTF contests are usually designed to serve as an educational exercise to give participants experience in securing a machine, as well as conducting and reacting to the sort of attacks found in the real world. We provide a dedicated UNIX environment to play actual worldwide CTF challenges. The course will be provided in cooperation with the Eyes Japan Co.","gradingMethod":"Two quizes of 30 points each will be given.The final exam will covered 40 points.","reference":"http://sealpv2.u-aizu.ac.jp/"},{"title":"OT03-019 競技プログラミング","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"渡部　有隆","update":"2019/02/15","outline":"学生のプログラミング能力と問題解決能力を高め、幅広いアルゴリズムに関する知識を深めることを目的とし、実践的なプログラミングの演習を行います。","gradingMethod":"演習\t\t50%コンテスト\t50%"},{"title":"OT03-020 実践的プログラミング","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"渡部　有隆","update":"2019/02/15","outline":"学生のプログラミング能力を高め、アルゴリズムだけでなくソフトウェア開発に必要なフレームワーク、パラダイム、開発ツールに関する知識を深めることを目的とし、実践的なプログラミングの演習を行います。学生の希望に応じて以下のコースの演習を行います：（１）C/C++またはPythonプログラミング言語と基本的なアルゴリズムの習得を目的とし、多くの問題をステップbyステップで解いていく。（２）Java, JavaScript, その他WEB技術を用いて、Aizu Online Judge (AOJ)のWEBサービスやアプリケーションの開発を行う。","gradingMethod":"演習\t\t50%プロジェクト 50%"},{"title":"OT03-021 活性知識工学と人間中心設計によるユーザインタフェースと開発","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"吉岡　廉太郎","update":"2019/02/07","outline":"ソフトウェアにおけるユーザインタフェースは、ユーザの意志をコンピュータに伝えたり、情報をユーザに説明・提示したりする接点であり、使いやすさや理解のしやすさに直結する重要な役割を担います。ユーザの目的を的確につかみ、適切なタイミングで適切な情報を表示し、次に何をすれば良いかが自然と理解できるユーザインタフェースを活性知識工学の手法を用いながら開発します。具体的なテーマはプロジェクト開始時に、参加者の興味と能力を考慮して決定します。具体的な機能や仕様は人間中心設計の手法なども用いて決定していきます。開発にはプログラミングとウェブアプリケーションの開発に関する知識が必要となりますが、足りない部分は各自で自学自習しながら進めていきます。","gradingMethod":"アイデア、成果物、積極性を総合的に判断して評価します。","reference":"http://borealis.u-aizu.ac.jp/classes/sccp/"},{"title":"OT03-022 立体形状物のモデリングと造形","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"吉岡　廉太郎","update":"2019/02/07","outline":"触覚デバイスを用いた立体形状物のモデリング技術と３Dプリンターによる造形手法の研究を行います。また、コンピュータで造形された立体形状物の新しい活用法を開発します。具体的なテーマはプロジェクト開始時に決定しますが、文字を立体化する３D漢字の技術を例に、形状の変形手法と造形手法を習得し、その応用方法について要求開発と人間中心設計にもとづく開発を行います。","gradingMethod":"アイデア、成果物、積極性を総合的に判断して評価します。","reference":"http://borealis.u-aizu.ac.jp/classes/sccp/"},{"title":"OT03-023 Human Body Motion Analysis Project","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"中澤　謙","update":"2019/02/06","outline":"本プロジェクトでは、歩行や眼球運動といった人間の生活を支えている人体の「動き」を測定／分析／評価する方法を学習していきます。","gradingMethod":"出席、プロジェクトへの取組姿勢などを総合して評価する。"},{"title":"OT03-024 Korean Language and Culture","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"ホウ　ヨンヒョン","update":"2019/02/08","outline":"This course is designed to introduce Korean language and culture. Students will learn Korean alphabet (Hangul), basic Korean words and expressions. We will also have several culture sessions, during which we can 1) watch Korean YouTube clips, movies and dramas, 2) listen to Korean music and 3) play Korean traditional games.","gradingMethod":"Participation: 20%Homework: 40%Quizzes: 40%"},{"title":"OT03-025 現代暗号入門","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"渡邊　曜大","update":"2019/02/15","outline":"暗号は，電子情報を扱うさまざまなサービスにおける安全性確保のための基盤となる重要な技術である．本科目では，視覚復号型秘密分散法と呼ばれる一風変わった暗号技術を取り上げて，現代暗号の基礎を学ぶ．","gradingMethod":"プロジェクトへの取り組みを総合的に評価","reference":"秘密分散法：http://web-int.u-aizu.ac.jp/~yodai/research/ss/ss.html"},{"title":"OT03-026 物理教育のためのコンピュータプログラムの開発","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"藤津　明","update":"2019/02/22","outline":"We make Mathematica programs for physics education.","gradingMethod":"Evaluate Mathematica programs (100%)"},{"title":"OT03-027 火山防災とデータ","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"小川　佳子","update":"2019/02/15","outline":"地元福島県内の火山を主な対象として、衛星データから地下のマグマの動きを知るためのデータ解析に取り組む。また、様々な火山関連データを一元的に可視化する地理情報システム(GIS)ツールの開発にも取り組む。火山モニタリングへの多面的な貢献を目指す。","gradingMethod":"演習50%, 成果物&プレゼン50%, で 評価します"},{"title":"OT03-028 Datalimpicに出よう","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"浅井　信吉","update":"2019/02/15","outline":"Datalimpicに参戦しよう！","gradingMethod":"活動への参加と貢献度による","reference":"昨年度のDatalimpicのホームページ：https://www.wingarc.com/datalympic2018/"},{"title":"OT03-029 Computer Modeling of Nanoelectronic Devices","semester":"2019年度／Academic Year\n            　前期・後期\n              ／1st, 2nd Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"マキシム　リズィー","update":"2019/03/04","outline":"Students will study basic principles of semiconductor device modeling techniques, study the software source code based on Ensemble Monte Carlo particle simulation method (with some programming work on class workstation).Students will study and run the software and obtain different characteristics of semiconductor devices.","gradingMethod":"Course report (100%)","reference":"Tomizawa KazutakaNumerical Simulation of Submicron Semiconductor Devices"},{"title":"OT03-030 Preparing for International Conferences","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"デボプリオ　ロイ","update":"2019/08/20","outline":"This course is about teaching the art of using language and communication skills for networking and workflow management related to attending and organizing international conferences.  The idea is to develop students’ project management and English communication skills. Attending or organizing conferences can be very productive and fun or totally overwhelming and a drain depending on many factors. The investment of time, travel and energy required to go to conferences, makes it more important to be prepared before you go so that you’re not scrambling at the last minute or worse yet – while you are there. The 21st century conference attendee has much more technology, social media and content options that can be used to share & highlight their experience and their takeaways.As part of this course, we will look into what it takes to prepare in English for a good conference as a speaker and organizer (even when your English is not good); we will spend some time learning the tricks for organizing a good international conference and the tasks and responsibilities that go with it; and the discussions and tasks will also feature how to ask good questions to the speaker; how to do problem-solving when organizing an international conference, workflow management, time and personnel management, and the art of networking with international colleagues. Students will get an opportunity to participate and network directly with international colleagues and students as part of a weeklong international conference held on our UoA campus.","gradingMethod":"The assessment rubric is part of the assignment instructions each week. However, a detailed grading schema will be maintained for each assignment. Please check the course webpage for the grading schema for each assignment. Assessment (Overall Criteria): Each assignment will be graded against a specific set of criteria. A student will either get 0 or 1 for each category as is seen below. 1. Organization of Ideas (0/1)2. Clarity of Ideas (0/1)3. Grammatical and Sentence Construction Issues (0/1)4. Use and Explanation of Graphics (0/1)5. User-Friendly Nature of the Information (0/1)6. Text-Graphics Coordination (0/1)7. Information Accessibility (0/1)Students MUST post assignments in Schoology (https://www.schoology.com/), and must NOT be absent.The grade distribution might be subjected to last minute changes. Assignment # 1: Reflection Paper on Choosing a Good Conference to Attend / Writing a    Conference Proposal - 10%Assignment # 2: Design a Good Presentation for a Conference - 10%Assignment # 3: Adding Humor to Speech and Slides in the Presentation - 10% Assignment # 4: Developing a Quick Guide Explaining how to use Easy Chair - 15%Assignment # 5: Prepare a Plan on how to Get Colleagues/Students/Partners Interested in your Conference - 10%Assignment # 6: Writing Effective Emails to Colleagues - 15%Assignment # 7: Project Management Skills:  - 30%Participating at the ACM International Conference at UoA as a volunteer in the conference team (https://www.acmchapterseminarjapan.com/etltchome2020)* Every student will receive an ACM certificate of participation.","reference":"https://easychair.org/https://www.edas.info/https://sites.google.com/newhttps://www.mindmeister.com/ja"},{"title":"OT03-031 学内生活を便利にするアプリケーション・サービスを作ろう","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"阿部　泰裕","update":"2019/08/15","outline":"会津大学内で実際に利用できるアプリケーション・サービスの構築を目指します。※ 活動に必要な場合、サーバー等は可能な範囲で準備します。※ 過去問DBのようにディプロマポリシーに反するものは対象としません。詳細は参考欄の授業ホームページを確認してください。","gradingMethod":"成績の評価は作成を目指したアプリケーション・サービスについて、以下の観点にもとづいて評価を行なう。具体的な項目は1回目の冒頭にシラバスと共に周知する。1. 課題に対して適切な目的を設定できる2. 開発を目指した対象について、目的・結果・課題を自ら説明できる","reference":"授業ホームページ - https://web-int.u-aizu.ac.jp/~yasu-abe/ja/sccp/lda4bcl/"},{"title":"OT03-032 英語の音とつづり","semester":"2019年度／Academic Year\n            　後期\n              ／Second Semester","corseFor":"1年 \n                  ,\n                  2年 \n                  ,\n                  3年 \n                  ,\n                  4年","credets":"1.0","instructor":"野北　明嗣","update":"2019/08/06","outline":"日本人の英語が通じないのは、発音が悪いからというよりも、単に英語のつづりの読み方や発音のルールを勘違いしているだけだという場合が多い。この授業では、日本語の五十音表にあたるものの英語版、日本語の漢字とひらがなに違いにあたるものの英語版、英語の拍やイントネーションなど、ほとんどの日本人が中学や高校で習わないものを扱う。ちなみに中国語教育では発音指導が徹底されており、この授業で扱うメソッドも中国語教育の発音指導法を多く取り入れている。","gradingMethod":"In-Class Assignments: 60%Quizzes: 30%Participation: 10%","reference":"https://youtu.be/g0QIzy2KfKc"}]]